{"verses":[{"passage":"Say ye to the righteous, that it shall be well with him.","reference":{"book":"Isaiah","chapter":"3","verse":"10"}}],"reading":["<i>It is well with the righteous </i><span style=\"font-variant:small-caps\" id=\"d0414pm-p3.1\">always</span>. If it had said, “Say ye to the righteous, that it is well with him in his prosperity,” we must have been thankful for so great a boon, for prosperity is an hour of peril, and it is a gift from heaven to be secured from its snares: or if it had been written, “It is well with him when under persecution,” we must have been thankful for so sustaining an assurance, for persecution is hard to bear; but when no time is mentioned, all time is included. God’s “shalls” must be understood always in their largest sense. From the beginning of the year to the end of the year, from the first gathering of evening shadows until the day-star shines, in all conditions and under all circumstances, it shall be well with the righteous. It is so well with him that we could not imagine it to be better, for he is <i>well fed</i>, he feeds upon the flesh and blood of Jesus; he is <i>well clothed</i>, he wears the imputed righteousness of Christ; he is <i>well housed</i>, he dwells in God; he is <i>well married</i>, his soul is knit in bonds of marriage union to Christ; he is <i>well provided for</i>, for the Lord is his Shepherd; he is <i>well endowed</i>, for heaven is his inheritance. It is well with the righteous—<i>well upon divine </i><i>authority</i>; the mouth of God speaks the comforting assurance. O beloved, if God declares that all is well, ten thousand devils may declare it to be ill, but we laugh them all to scorn. Blessed be God for a faith which enables us to believe God when the creatures contradict him. It is, says the Word, at all times well with thee, thou righteous one; then, beloved, if thou canst not see it, let God’s word stand thee in stead of sight; yea, believe it on divine authority more confidently than if thine eyes and thy feelings told it to thee. Whom God blesses is blest indeed, and what his lip declares is truth most sure and steadfast."]}