{"verses":[{"passage":"All they that see me laugh me to scorn: they shoot out the lip, they shake the head.","reference":{"book":"Psalm","chapter":"22","verse":"7"}}],"reading":["Mockery was a great ingredient in our Lord’s woe. Judas mocked him in the garden; the chief priests and scribes laughed him to scorn; Herod set him at nought; the servants and the soldiers jeered at him, and brutally insulted him; Pilate and his guards ridiculed his royalty; and on the tree all sorts of horrid jests and hideous taunts were hurled at him. Ridicule is always hard to bear, but when we are in intense pain it is so heartless, so cruel, that it cuts us to the quick. Imagine the Saviour crucified, racked with anguish far beyond all mortal guess, and then picture that motley multitude, all wagging their heads or thrusting out the lip in bitterest contempt of one poor suffering victim! Surely there must have been something more in the crucified One than they could see, or else such a great and mingled crowd would not unanimously have honoured him with such contempt. Was it not evil confessing, in the very moment of its greatest apparent triumph, that after all it could do no more than mock at that victorious goodness which was then reigning on the cross? O Jesus, “despised and rejected of men,” how couldst thou die for men who treated thee so ill? Herein is love amazing, love divine, yea, love beyond degree. We, too, have despised thee in the days of our unregeneracy, and even since our new birth we have set the world on high in our hearts, and yet thou bleedest to heal our wounds, and diest to give us life. O that we could set thee on a glorious high throne in all men’s hearts! We would ring out thy praises over land and sea till men should as universally adore as once they did unanimously reject.","“Thy creatures wrong thee, O thou sovereign Good!","<i>Thou art not loved, because not understood</i>:","This grieves me most, that vain pursuits beguile","Ungrateful men, regardless of thy smile.”"]}