{"verses":[{"passage":"And thou saidst, I will surely do thee good.","reference":{"book":"Genesis","chapter":"32","verse":"12"}}],"reading":["When Jacob was on the other side of the brook Jabbok, and Esau was coming with armed men, he earnestly sought God’s protection, and as a master reason he pleaded, “And thou saidst, I will surely do thee good.” Oh, the force of that plea! He was holding God to his word—“Thou saidst.” The attribute of God’s faithfulness is a splendid horn of the altar to lay hold upon; but the promise, which has in it the attribute and something more, is a yet mightier holdfast—“Thou saidst, I will surely do thee good.” And has <i>he</i> said, and shall he not do it? “Let God be true, and every man a liar.” Shall not <i>he</i> be true? Shall <i>he</i> not keep his word? Shall not every word that cometh out of his lips stand fast and be fulfilled? Solomon, at the opening of the temple, used this same mighty plea. He pleaded with God to remember the word which he had spoken to his father David, and to bless that place. When a man gives a promissory note, his honour is engaged; he signs his hand, and he must discharge it when the due time comes, or else he loses credit. It shall never be said that God dishonours his bills. The credit of the Most High never was impeached, and never shall be. He is punctual to the moment: he never is before his time, but he never is behind it. Search God’s word through, and compare it with the experience of God’s people, and you shall find the two tally from the first to the last. Many a hoary patriarch has said with Joshua, “Not one thing hath failed of all the good things which the Lord your God spake concerning you; all are come to pass.” If you have a divine promise, you need not plead it with an “if,” you may urge it with certainty. The Lord meant to fulfil the promise, or he would not have given it. God does not give his words merely to quiet us, and to keep us hopeful for awhile with the intention of putting us off at last; but when he speaks, it is because he means to do as he has said."]}