{"verses":[{"passage":"If any man hear my voice, and open the door, I will come in to him.","reference":{"book":"Revelation","chapter":"3","verse":"20"}}],"reading":["What is your desire this evening? Is it set upon heavenly things? Do you long to enjoy the high doctrine of eternal love? Do you desire liberty in very close communion with God? Do you aspire to know the heights, and depths, and lengths, and breadths? Then you must draw near to Jesus; you must get a clear sight of him in his preciousness and completeness; you must view him in his work, in his offices, in his person. He who understands Christ, receives an anointing from the Holy One, by which he knows all things. Christ is the great master-key of all the chambers of God; there is no treasure-house of God which will not open and yield up all its wealth to the soul that lives near to Jesus. Are you saying, “O that he would dwell in my bosom”? “Would that he would make my heart his dwelling-place forever”? Open the door, beloved, and he will come into your souls. He has long been knocking, and all with this object, that he may sup with you, and you with him. <i>He sups with you</i> because you find the house or the heart, and <i>you with him</i> because he brings the provision. He could not sup with you if it were not in your heart, you finding the house; nor could you sup with him, for you have a bare cupboard, if he did not bring provision with him. Fling wide, then, the portals of your soul. He will come with that love which you long to feel; he will come with that joy into which you cannot work your poor depressed spirit; he will bring the peace which now you have not; he will come with his flagons of wine and sweet apples of love, and cheer you till you have no other sickness but that of “love o'erpowering, love divine.” Only open the door to him, drive out his enemies, give him the keys of your heart, and he will dwell there forever. Oh, wondrous love, that brings such a guest to dwell in such a heart!"]}