{"verses":[{"passage":"Look upon mine affliction and my pain; and forgive all my sins.","reference":{"book":"Psalm","chapter":"25","verse":"18"}}],"reading":["It is well for us when prayers about our sorrows are linked with pleas concerning our sins—when, being under God’s hand, we are not wholly taken up with our pain, but remember our offences against God. It is well, also, to take both sorrow and sin to the same place. It was to God that David carried his sorrow: it was to God that David confessed his sin. Observe, then, <i>we </i><i>must take our sorrows to God</i>. Even your little sorrows you may roll upon God, for he counteth the hairs of your head; and your great sorrows you may commit to him, for he holdeth the ocean in the hollow of his hand. Go to him, whatever your present trouble may be, and you shall find him able and willing to relieve you. <i>But we must take our sins to God too</i>. We must carry them to the cross, that the blood may fall upon them, to purge away their guilt, and to destroy their defiling power.","The special lesson of the text is this:—that <i>we are to go </i><i>to the Lord with sorrows and with sins in the right spirit</i>. Note that all David asks concerning his sorrow is, “<i>Look </i><i>upon</i> mine affliction and my pain;” but the next petition is vastly more express, definite, decided, plain—“<i>Forgive</i> all my sins.” Many sufferers would have put it, “Remove my affliction and my pain, and look at my sins.” But David does not say so; he cries, “Lord, as for my affliction and my pain, I will not dictate to thy wisdom. Lord, look at them, I will leave them to thee, I should be glad to have my pain removed, but do as thou wilt; but as for my sins, Lord, I know what I want with them; I must have them forgiven; I cannot endure to lie under their curse for a moment.” A Christian counts sorrow lighter in the scale than sin; he can bear that his troubles should continue, but he cannot support the burden of his transgressions."]}