{"verses":[{"passage":"The precious blood of Christ.","reference":{"book":"1 Peter","chapter":"1","verse":"19"}}],"reading":["Standing at the foot of the cross, we see hands, and feet, and side, all distilling crimson streams of precious blood. It is “precious” because of its <i>redeeming</i> and <i>atoning </i><i>efficacy</i>. By it the sins of Christ’s people are atoned for; they are redeemed from under the law; they are reconciled to God, made one with him. Christ’s blood is also “precious” in its <i>cleansing power</i>; it “cleanseth from all sin.” “Though your sins be as scarlet, they shall be as white as snow.” Through Jesus’ blood there is not a spot left upon any believer, no wrinkle nor any such thing remains. O precious blood, which makes us clean, removing the stains of abundant iniquity, and permitting us to stand accepted in the Beloved, notwithstanding the many ways in which we have rebelled against our God. The blood of Christ is likewise “precious” in its <i>preserving </i><i>power</i>. We are safe from the destroying angel under the sprinkled blood. Remember it is <i>God’s seeing</i> the blood which is the true reason for our being spared. Here is comfort for us when the eye of faith is dim, for God’s eye is still the same. The blood of Christ is “precious” also in its <i>sanctifying </i><i>influence</i>. The same blood which justifies by taking away sin, does in its after-action, quicken the new nature and lead it onward to subdue sin and to follow out the commands of God. There is no motive for holiness so great as that which streams from the veins of Jesus. And “precious,” unspeakably precious, is this blood, because it has an <i>overcoming power</i>. It is written, “They overcame through the blood of the Lamb.” How could they do otherwise? He who fights with the precious blood of Jesus, fights with a weapon which cannot know defeat. The blood of Jesus! sin dies at its presence, death ceases to be death: heaven’s gates are opened. The blood of Jesus! we shall march on, conquering and to conquer, so long as we can trust its power!"]}