{"verses":[{"passage":"And he shall put his hand upon the head of the burnt offering; and it shall be accepted for him to make atonement for him.","reference":{"book":"Leviticus","chapter":"1","verse":"4"}}],"reading":["Our Lord’s being made “sin for us” is set forth here by the very significant transfer of sin to the bullock, which was made by the elders of the people. The laying of the hand was not a mere touch of contact, for in some other places of Scripture the original word has the meaning of leaning heavily, as in the expression, “thy wrath lieth hard upon me” (<a class=\"scripRef\" id=\"d0413pm-p3.1\" href=\"/ccel/bible/asv.Ps.88.html#Ps.88.7\" onclick=\"return goBible('ot','Ps','88','7','88','7');\" onmouseover=\"popupVerse(this, 'Ps 88:7 - 88:7')\" onmouseout=\"leaveVerse()\" name=\"_Ps_88_7_0_0\">Psalm 88:7</a>). Surely this is the very essence and nature of faith, which doth not only bring us into contact with the great Substitute, but teaches us to lean upon him with all the burden of our guilt. Jehovah made to meet upon the head of the Substitute all the offences of his covenant people, but each one of the chosen is brought personally to ratify this solemn covenant act, when by grace he is enabled by faith to lay his hand upon the head of the “Lamb slain from before the foundation of the world.” Believer, do you remember that rapturous day when you first realized pardon through Jesus the sin-bearer? Can you not make glad confession, and join with the writer in saying, “My soul recalls her day of deliverance with delight. Laden with guilt and full of fears, I saw my Saviour as my Substitute, and I laid my hand upon him; oh! how timidly at first, but courage grew and confidence was confirmed until I leaned my soul entirely upon him; and now it is my unceasing joy to know that my sins are no longer imputed to me, but laid on him, and like the debts of the wounded traveller, Jesus, like the good Samaritan, has said of all my future sinfulness, ‘Set that to my account.’” Blessed discovery! Eternal solace of a grateful heart!","“My numerous sins transferr'd to him,","Shall never more be found,","Lost in his blood’s atoning stream,","Where every crime is drown'd!”"]}