{"verses":[{"passage":"Remember the word unto thy servant, upon which thou hast caused me to hope.","reference":{"book":"Psalm","chapter":"119","verse":"49"}}],"reading":["Whatever your especial need may be, you may readily find some promise in the Bible suited to it. Are you faint and feeble because your way is rough and you are weary? Here is the promise—“He giveth power to the faint.” When you read such a promise, take it back to the great Promiser, and ask him to fulfil his own word. Are you seeking after Christ, and thirsting for closer communion with him? This promise shines like a star upon you—“Blessed are they that hunger and thirst after righteousness, for they shall be filled.” Take that promise to the throne continually; do not plead anything else, but go to God over and over again with this—“Lord, thou hast said it, do as thou hast said.” Are you distressed because of sin, and burdened with the heavy load of your iniquities? Listen to these words—“I, even I, am he that blotteth out thy transgressions, and will no more remember thy sins.” You have no merit of your own to plead why he should pardon you, but plead his written engagements and he will perform them. Are you afraid lest you should not be able to hold on to the end, lest, after having thought yourself a child of God, you should prove a castaway? If that is your state, take this word of grace to the throne and plead it: “The mountains may depart, and the hills may be removed, but the covenant of my love shall not depart from thee.” If you have lost the sweet sense of the Saviour’s presence, and are seeking him with a sorrowful heart, remember the promises: “Return unto me, and I will return unto you;” “For a small moment have I forsaken thee, but with great mercies will I gather thee.” Banquet your faith upon God’s own word, and whatever your fears or wants, repair to the Bank of Faith with your Father’s note of hand, saying, “Remember the word unto thy servant, upon which thou hast caused me to hope.”"]}