{"verses":[{"passage":"The flowers appear on the earth; the time of the singing of birds is come, and the voice of the turtle is heard in our land.","reference":{"book":"Song of Solomon","chapter":"2","verse":"12"}}],"reading":["Sweet is the season of spring: the long and dreary winter helps us to appreciate its genial warmth, and its promise of summer enhances its present delights. After periods of depression of spirit, it is delightful to behold again the light of the Sun of Righteousness; then our slumbering graces rise from their lethargy, like the crocus and the daffodil from their beds of earth; then is our heart made merry with delicious notes of gratitude, far more melodious than the warbling of birds—and the comforting assurance of peace, infinitely more delightful than the turtle’s note, is heard within the soul. Now is the time for the soul to seek communion with her Beloved; now must she rise from her native sordidness, and come away from her old associations. If we do not hoist the sail when the breeze is favourable, we shall be blameworthy: times of refreshing ought not to pass over us unimproved. When Jesus himself visits us in tenderness, and entreats us to arise, can we be so base as to refuse his request? He has himself risen that he may draw us after him: he now by his Holy Spirit has revived us, that we may, in newness of life, ascend into the heavenlies, and hold communion with himself. Let our wintry state suffice us for coldness and indifference; when the Lord creates a spring within, let our sap flow with vigour, and our branch blossom with high resolve. O Lord, if it be not spring time in my chilly heart, I pray thee make it so, for I am heartily weary of living at a distance from thee. Oh! the long and dreary winter, when wilt thou bring it to an end? Come, Holy Spirit, and renew my soul! quicken thou me! restore me, and have mercy on me! This very night I would earnestly implore the Lord to take pity upon his servant, and send me a happy revival of spiritual life!"]}