{"verses":[{"passage":"We would see Jesus.","reference":{"book":"John","chapter":"12","verse":"21"}}],"reading":["Evermore the worldling’s cry is, “Who will show us any good?” He seeks satisfaction in earthly comforts, enjoyments, and riches. But the quickened sinner knows of only one good. “O that I knew where I might find <span style=\"font-variant:small-caps\" id=\"d0417pm-p3.1\">Him</span> !” When he is truly awakened to feel his guilt, if you could pour the gold of India at his feet, he would say, “Take it away: I want to find <span style=\"font-variant:small-caps\" id=\"d0417pm-p3.2\">Him</span>.” It is a blessed thing for a man, when he has brought his desires into a focus, so that they all centre in one object. When he has fifty different desires, his heart resembles a mire of stagnant water, spread out into a marsh, breeding miasma and pestilence; but when all his desires are brought into one channel, his heart becomes like a river of pure water, running swiftly to fertilize the fields. Happy is he who hath one desire, if that one desire be set on Christ, though it may not yet have been realized. If Jesus be a soul’s desire, it is a blessed sign of divine work within. Such a man will never be content with mere ordinances. He will say, “I want Christ; I <i>must</i> have him—mere ordinances are of no use to me; I want <i>himself</i>; do not offer me these; you offer me the empty pitcher, while I am dying of thirst; give me water, or I die. Jesus is my soul’s desire. I would see Jesus!”","Is this thy condition, my reader, at this moment? Hast thou but one desire, and is that after Christ? Then thou art not far from the kingdom of heaven. Hast thou but one wish in thy heart, and that one wish that thou mayst be washed from all thy sins in Jesus’ blood? Canst thou really say, “I would give all I have to be a Christian; I would give up everything I have and hope for, if I might but feel that I have an interest in Christ?” Then, despite all thy fears, be of good cheer, the Lord loveth thee, and thou shalt come out into daylight soon, and rejoice in the liberty wherewith Christ makes men free."]}