{"verses":[{"passage":"Deliver me from bloodguiltiness, O God, thou God of my salvation; and my tongue shall sing aloud of thy righteousness.","reference":{"book":"Psalm","chapter":"51","verse":"14"}}],"reading":["In this <span style=\"font-variant:small-caps\" id=\"d0407pm-p3.1\">solemn confession</span>, it is pleasing to observe that David plainly names his sin. He does not call it manslaughter, nor speak of it as an imprudence by which an unfortunate accident occurred to a worthy man, but he calls it by its true name, bloodguiltiness. He did not actually kill the husband of Bathsheba; but still it was planned in David’s heart that Uriah should be slain, and he was before the Lord his murderer. Learn in confession to be honest with God. Do not give fair names to foul sins; call them what you will, they will smell no sweeter. What God sees them to be, that do you labour to feel them to be; and with all openness of heart acknowledge their real character. Observe, that David was evidently oppressed with the heinousness of his sin. It is easy to use words, but it is difficult to feel their meaning. The fifty-first Psalm is the photograph of a contrite spirit. Let us seek after the like brokenness of heart; for however excellent our words may be, if our heart is not conscious of the hell-deservingness of sin, we cannot expect to find forgiveness.","Our text has in it <span style=\"font-variant:small-caps\" id=\"d0407pm-p4.1\">an earnest prayer</span>—it is addressed to the God of <i>salvation</i>. It is his prerogative to forgive; it is his very name and office to save those who seek his face. Better still, the text calls him the God of <i>my</i> salvation. Yes, blessed be his name, while I am yet going to him through Jesus’ blood, I can rejoice in the God of <i>my</i> salvation.","The psalmist ends with <span style=\"font-variant:small-caps\" id=\"d0407pm-p5.1\">a commendable vow</span>: if God will deliver him he will <i>sing</i>—nay, more, he will “<i>sing aloud</i>.” Who can sing in any other style of such a mercy as this! But note the subject of the song—“<span style=\"font-variant:small-caps\" id=\"d0407pm-p5.2\">Thy righteousness</span>.” We must sing of the finished work of a precious Saviour; and he who knows most of forgiving love will sing the loudest."]}