{"verses":[{"passage":"He answered him to never a word.","reference":{"book":"Matthew","chapter":"27","verse":"14"}}],"reading":["He had never been slow of speech when he could bless the sons of men, but he would not say a single word for himself. “Never man spake like this man,” and never man was silent like him. Was this singular silence <i>the index of his perfect self-sacrifice</i>? Did it show that he would not utter a word to stay the slaughter of his sacred person, which he had dedicated as an offering for us? Had he so entirely surrendered himself that he would not interfere in his own behalf, even in the minutest degree, but be bound and slain an unstruggling, uncomplaining victim? Was this silence <i>a type of the </i><i>defencelessness of sin</i>? Nothing can be said in palliation or excuse of human guilt; and, therefore, he who bore its whole weight stood speechless before his judge. Is not patient silence <i>the best reply to a gainsaying world</i>? Calm endurance answers some questions infinitely more conclusively than the loftiest eloquence. The best apologists for Christianity in the early days were its martyrs. The anvil breaks a host of hammers by quietly bearing their blows. Did not the silent Lamb of God furnish us with <i>a grand example of wisdom</i>? Where every word was occasion for new blasphemy, it was the line of duty to afford no fuel for the flame of sin. The ambiguous and the false, the unworthy and mean, will ere long overthrow and confute themselves, and therefore the true can afford to be quiet, and finds silence to be its wisdom. Evidently our Lord, by his silence, furnished <i>a remarkable fulfilment of </i><i>prophecy</i>. A long defence of himself would have been contrary to Isaiah’s prediction: “He is led as a lamb to the slaughter, and as a sheep before her shearers is dumb, so he openeth not his mouth.” By his quiet he conclusively proved himself to be the true Lamb of God. As such we salute him this morning. Be with us, Jesus, and in the silence of our heart, let us hear the voice of thy love."]}