{"verses":[{"passage":"A bundle of myrrh is my well-beloved unto me.","reference":{"book":"Song of Solomon","chapter":"1","verse":"13"}}],"reading":["Myrrh may well be chosen as the type of Jesus on account of <i>its preciousness, its perfume, its pleasantness, </i><i>its healing, preserving, disinfecting qualities, and its </i><i>connection with sacrifice</i>. But why is he compared to “a <i>bundle</i> of myrrh”? First, for <i>plenty</i>. He is not a drop of it, he is a casket full. He is not a sprig or flower of it, but a whole bundle. There is enough in Christ for all my necessities; let me not be slow to avail myself of him. Our well-beloved is compared to a “bundle” again, for <i>variety</i>: for there is in Christ not only the one thing needful, but in “him dwelleth all the fulness of the Godhead bodily;” everything needful is in him. Take Jesus in his different characters, and you will see a marvellous variety—Prophet, Priest, King, Husband, Friend, Shepherd. Consider him in his life, death, resurrection, ascension, second advent; view him in his virtue, gentleness, courage, self-denial, love, faithfulness, truth, righteousness—everywhere he is a bundle of preciousness. He is a “bundle of myrrh” for <i>preservation</i>—not loose myrrh to be dropped on the floor or trodden on, but myrrh tied up, myrrh to be stored in a casket. We must value him as our best treasure; we must prize his words and his ordinances; and we must keep our thoughts of him and knowledge of him as under lock and key, lest the devil should steal anything from us. Moreover, Jesus is a “bundle of myrrh” <i>for speciality</i>; the emblem suggests the idea of distinguishing, discriminating grace. From before the foundation of the world, he was set apart for his people; and he gives forth his perfume only to those who understand how to enter into communion with him, to have close dealings with him. Oh! blessed people whom the Lord hath admitted into his secrets, and for whom he sets himself apart. Oh! choice and happy who are thus made to say, “A bundle of myrrh is my well-beloved unto me.”"]}