{"verses":[{"passage":"The Amen.","reference":{"book":"Revelation","chapter":"3","verse":"14"}}],"reading":["The word <span style=\"font-variant:small-caps\" id=\"d0419pm-p3.1\">Amen</span> solemnly confirms that which went before; and Jesus is the great Confirmer; immutable, forever is “the Amen” in all <i>his promises. Sinner</i>, I would comfort thee with this reflection. Jesus Christ said, “Come unto me all ye that labour and are heavy laden, and I will give you rest.” If you come to him, he will say “Amen” in your soul; his promise shall be true <i>to you</i>. He said in the days of his flesh, “The bruised reed I will not break.” O thou poor, broken, bruised heart, if thou comest to him, he will say “Amen” to thee, and that shall be true in <i>thy</i> soul as in hundreds of cases in bygone years. <i>Christian</i>, is not this very comforting to thee also, that there is not a word which has gone out of the Saviour’s lips which he has ever retracted? The words of Jesus shall stand when heaven and earth shall pass away. If thou gettest a hold of but half a promise, thou shalt find it true. Beware of him who is called “Clip-promise,” who will destroy much of the comfort of God’s word.","Jesus is Yea and Amen in all <i>his offices</i>. He was a Priest to pardon and cleanse once, he is Amen as Priest still. He was a King to rule and reign for his people, and to defend them with his mighty arm, he is an Amen King, the same still. He was a Prophet of old, to foretell good things to come, his lips are most sweet, and drop with honey still—he is an Amen Prophet. He is Amen as to the merit of his blood; he is Amen as to his righteousness. That sacred robe shall remain most fair and glorious when nature shall decay. He is Amen in every single title which he bears; your Husband, never seeking a divorce; your Friend, sticking closer than a brother; your Shepherd, with you in death’s dark vale; your Help and your Deliverer; your Castle and your High Tower; the Horn of your strength, your confidence, your joy, your all in all, and your Yea and Amen in all."]}