{"verses":[{"passage":"Ourselves also, which have the firstfruits of the Spirit.","reference":{"book":"Romans","chapter":"8","verse":"23"}}],"reading":["Present possession is declared. At this present moment we have the first fruits of the Spirit. We have repentance, that gem of the first water; faith, that priceless pearl; hope, the heavenly emerald; and love, the glorious ruby. We are already made “new creatures in Christ Jesus,” by the effectual working of God the Holy Ghost. This is called the firstfruit because <i>it comes first</i>. As the wave-sheaf was the first of the harvest, so the spiritual life, and all the graces which adorn that life, are the first operations of the Spirit of God in our souls. <i>The firstfruits were the pledge of the harvest</i>. As soon as the Israelite had plucked the first handful of ripe ears, he looked forward with glad anticipation to the time when the wain should creak beneath the sheaves. So, brethren, when God gives us things which are pure, lovely, and of good report, as the work of the Holy Spirit, these are to us the prognostics of the coming glory. <i>The firstfruits were always holy to the </i><i>Lord</i>, and our new nature, with all its powers, is a consecrated thing. The new life is not ours that we should ascribe its excellence to our own merit; it is Christ’s image and creation, and is ordained for his glory. But <i>the </i><i>firstfruits were not the harvest</i>, and the works of the Spirit in us at this moment are not the consummation—the perfection is yet to come. We must not boast that we have attained, and so reckon the wave-sheaf to be all the produce of the year: we must hunger and thirst after righteousness, and pant for the day of full redemption. Dear reader, this evening open your mouth wide, and God will fill it. Let the boon in present possession excite in you a sacred avarice for more grace. Groan within yourself for higher degrees of consecration, and your Lord will grant them to you, for he is able to do exceeding abundantly above what we ask or even think."]}