{"verses":[{"passage":"If thou believest with all thine heart, thou mayest.","reference":{"book":"Acts","chapter":"8","verse":"37"}}],"reading":["These words may answer your scruples, devout reader, concerning <i>the ordinances</i>. Perhaps you say, “I should be afraid to be baptized; it is such a solemn thing to avow myself to be dead with Christ, and buried with him. I should not feel at liberty to come to the Master’s table; I should be afraid of eating and drinking damnation unto myself, not discerning the Lord’s body.” Ah! poor trembler, Jesus has given you liberty, be not afraid. If a stranger came to your house, he would stand at the door, or wait in the hall; he would not dream of intruding unbidden into your parlour—he is not at home: but your child makes himself very free about the house; and so is it with the child of God. A stranger may not intrude where a child may venture. When the Holy Ghost has given you to feel the spirit of adoption, you may come to Christian ordinances without fear. The same rule holds good of the <i>Christian’s inward privileges</i>. You think, poor seeker, that you are not allowed to rejoice with joy unspeakable and full of glory; if you are permitted to get inside Christ’s door, or sit at the bottom of his table, you will be well content. Ah! but you shall not have less privileges than the very greatest. God makes no difference in his love to his children. A child is a child to him; he will not make him a hired servant; but he shall feast upon the fatted calf, and shall have the music and the dancing as much as if he had never gone astray. When Jesus comes into the heart, he issues a general licence to be glad in the Lord. No chains are worn in the court of King Jesus. Our admission into full privileges may be gradual, but it is sure. Perhaps our reader is saying, “I wish I could enjoy the promises, and walk at liberty in my Lord’s commands.” “If thou believest with all thine heart, thou mayest.” Loose the chains of thy neck, O captive daughter, for Jesus makes thee free."]}