{"verses":[{"passage":"Wait on the Lord.","reference":{"book":"Psalm","chapter":"27","verse":"14"}}],"reading":["It may seem an easy thing to wait, but it is one of the postures which a Christian soldier learns not without years of teaching. Marching and quick-marching are much easier to God’s warriors than standing still. There are hours of perplexity when the most willing spirit, anxiously desirous to serve the Lord, knows not what part to take. Then what shall it do? Vex itself by despair? Fly back in cowardice, turn to the right hand in fear, or rush forward in presumption? No, but simply wait. <i>Wait in prayer</i>, however. Call upon God, and spread the case before him; tell him your difficulty, and plead his promise of aid. In dilemmas between one duty and another, it is sweet to be humble as a child, and <i>wait with simplicity of soul</i> upon the Lord. It is sure to be well with us when we feel and know our own folly, and are heartily willing to be guided by the will of God. But <i>wait in faith</i>. Express your unstaggering confidence in him; for unfaithful, untrusting waiting, is but an insult to the Lord. Believe that if he keep you tarrying even till midnight, yet he will come at the right time; the vision shall come and shall not tarry. <i>Wait in quiet patience</i>, not rebelling because you are under the affliction, but blessing your God for it. Never murmur against the second cause, as the children of Israel did against Moses; never wish you could go back to the world again, but accept the case as it is, and put it as it stands, simply and with your whole heart, without any self-will, into the hand of your covenant God, saying, “Now, Lord, not my will, but thine be done. I know not what to do; I am brought to extremities, but I will wait until thou shalt cleave the floods, or drive back my foes. I will wait, if thou keep me many a day, for my heart is fixed upon thee alone, O God, and my spirit waiteth for thee in the full conviction that thou wilt yet be my joy and my salvation, my refuge and my strong tower.”"]}