{"verses":[{"passage":"The unsearchable riches of Christ.","reference":{"book":"Ephesians","chapter":"3","verse":"8"}}],"reading":["My Master has riches beyond the count of arithmetic, the measurement of reason, the dream of imagination, or the eloquence of words. They are <i>unsearchable</i>! You may look, and study, and weigh, but Jesus is a greater Saviour than you think him to be when your thoughts are at the greatest. My Lord is more ready to pardon than you to sin, more able to forgive than you to transgress. My Master is more willing to supply your wants than you are to confess them. Never tolerate low thoughts of my Lord Jesus. When you put the crown on his head, you will only crown him with silver when he deserves gold. <i>My Master </i><i>has riches of happiness to bestow upon you now</i>. He can make you to lie down in green pastures, and lead you beside still waters. There is no music like the music of his pipe, when he is the Shepherd and you are the sheep, and you lie down at his feet. There is no love like his, neither earth nor heaven can match it. To know Christ and to be found in him—oh! this is life, this is joy, this is marrow and fatness, wine on the lees well refined. My Master does not treat his servants churlishly; he gives to them as a king giveth to a king; he gives them two heavens—a heaven below in serving him here, and a heaven above in delighting in him forever. <i>His unsearchable riches will be </i><i>best known in eternity</i>. He will give you on the way to heaven all you need; your place of defence shall be the munitions of rocks, your bread shall be given you, and your waters shall be sure; but it is there, <span style=\"font-variant:small-caps\" id=\"d0822pm-p3.1\">there</span>, where you shall hear the song of them that triumph, the shout of them that feast, and shall have a face-to-face view of the glorious and beloved One. The unsearchable riches of Christ! This is the tune for the minstrels of earth, and the song for the harpers of heaven. Lord, teach us more and more of Jesus, and we will tell out the good news to others."]}