{"verses":[{"passage":"Thou crownest the year with thy goodness.","reference":{"book":"Psalm","chapter":"65","verse":"11"}}],"reading":["All the year round, every hour of every day, God is richly blessing us; both when we sleep and when we wake his mercy waits upon us. The sun may leave us a legacy of darkness, but our God never ceases to shine upon his children with beams of love. Like a river, his lovingkindness is always flowing, with a fulness inexhaustible as his own nature. Like the atmosphere which constantly surrounds the earth, and is always ready to support the life of man, the benevolence of God surrounds all his creatures; in it, as in their element, they live, and move, and have their being. Yet as the sun on summer days gladdens us with beams more warm and bright than at other times, and as rivers are at certain seasons swollen by the rain, and as the atmosphere itself is sometimes fraught with more fresh, more bracing, or more balmy influences than heretofore, so is it with the mercy of God; it hath its golden hours; its days of overflow, when the Lord magnifieth his grace before the sons of men. Amongst the blessings of the nether springs, <i>the joyous </i><i>days of harvest</i> are a special season of excessive favour. It is the glory of autumn that the ripe gifts of providence are then abundantly bestowed; it is the mellow season of realization, whereas all before was but hope and expectation. Great is the joy of harvest. Happy are the reapers who fill their arms with the liberality of heaven. The Psalmist tells us that the harvest is the crowning of the year. Surely these crowning mercies call for crowning thanksgiving! Let us render it by the <i>inward emotions of gratitude</i>. Let our hearts be warmed; let our spirits remember, meditate, and think upon this goodness of the Lord. Then let us <i>praise him with our lips</i>, and laud and magnify his name from whose bounty all this goodness flows. Let us glorify God by yielding <i>our gifts</i> to his cause. A practical proof of our gratitude is a special thank-offering to the Lord of the harvest."]}