{"verses":[{"passage":"He hath commanded his covenant forever.","reference":{"book":"Psalms","chapter":"111","verse":"9"}}],"reading":["The Lord’s people delight in the covenant itself. It is an unfailing source of consolation to them so often as the Holy Spirit leads them into its banqueting house and waves its banner of love. They delight to contemplate <i>the antiquity</i> of that covenant, remembering that before the day-star knew its place, or planets ran their round, the interests of the saints were made secure in Christ Jesus. It is peculiarly pleasing to them to remember <i>the sureness</i> of the covenant, while meditating upon “the sure mercies of David.” They delight to celebrate it as “signed, and sealed, and ratified, in all things ordered well.” It often makes their hearts dilate with joy to think of its <i>immutability</i>, as a covenant which neither time nor eternity, life nor death, shall ever be able to violate—a covenant as old as eternity and as everlasting as the Rock of ages. They rejoice also to feast upon <i>the fulness</i> of this covenant, for they see in it all things provided for them. God is their portion, Christ their companion, the Spirit their Comforter, earth their lodge, and heaven their home. They see in it an inheritance reserved and entailed to every soul possessing an interest in its ancient and eternal deed of gift. Their eyes sparkled when they saw it as a treasure-trove in the Bible; but oh! how their souls were gladdened when they saw in the last will and testament of their divine kinsman, that it was bequeathed to them! More especially it is the pleasure of God’s people to contemplate <i>the graciousness</i> of this covenant. They see that the law was made void because it was a covenant of works and depended upon merit, but this they perceive to be enduring because grace is the basis, grace the condition, grace the strain, grace the bulwark, grace the foundation, grace the topstone. The covenant is a treasury of wealth, a granary of food, a fountain of life, a store-house of salvation, a charter of peace, and a haven of joy."]}