{"verses":[{"passage":"And I will remember my covenant.","reference":{"book":"Genesis","chapter":"9","verse":"15"}}],"reading":["Mark the form of the promise. God does not say, “And when ye shall look upon the bow, and <i>ye</i> shall remember my covenant, <i>then</i> I will not destroy the earth,” but it is gloriously put, not upon <i>our</i> memory, which is fickle and frail, but upon <i>God's</i> memory, which is infinite and immutable. “The bow shall be in the cloud; and I will look upon it, that I may remember the everlasting covenant.” Oh! it is not my remembering God, it is God’s remembering <i>me</i> which is the ground of my safety; it is not my laying hold of his covenant, but his covenant’s laying hold on me. Glory be to God! the whole of the bulwarks of salvation are secured by divine power, and even the minor towers, which we may imagine might have been left to man, are guarded by almighty strength. Even the <i>remembrance</i> of the covenant is not left to our memories, for <i>we</i> might forget, but our Lord cannot forget the saints whom he has graven on the palms of his hands. It is with us as with Israel in Egypt; the blood was upon the lintel and the two side-posts, but the Lord did not say, “When <i>you</i> see the blood I will pass over you,” but “When <i>I</i> see the blood I will pass over you.” My looking to Jesus brings me joy and peace, but it is God’s looking to Jesus which secures my salvation and that of all his elect, since it is impossible for our God to look at Christ, our bleeding Surety, and then to be angry with us for sins already punished in him. No, it is not left with <i>us</i> even to be saved by remembering the covenant. There is no linsey-wolsey here—not a single thread of the creature mars the fabric. It is not <i>of</i> man, neither <i>by</i> man, but of the Lord alone. We <i>should</i> remember the covenant, and we <i>shall</i> do it, through divine grace; but the hinge of our safety does not hang there—it is God’s remembering <i>us</i>, not our remembering <i>him</i>; and hence the covenant is <i>an everlasting covenant</i>."]}