{"verses":[{"passage":"Sing, O barren.","reference":{"book":"Isaiah","chapter":"54","verse":"1"}}],"reading":["Though we have brought forth some fruit unto Christ, and have a joyful hope that we are “plants of his own right hand planting,” yet there are times when we feel very barren. Prayer is lifeless, love is cold, faith is weak, each grace in the garden of our heart languishes and droops. We are like flowers in the hot sun, requiring the refreshing shower. In such a condition what are we to do? The text is addressed to us in just such a state. “<i>Sing, O barren, break forth and cry aloud</i>.” But what can I sing about? I cannot talk about the present, and even the past looks full of barrenness. Ah! I can sing of Jesus Christ. I can talk of visits which the Redeemer has aforetimes paid to me; or if not of these, I can magnify the great love wherewith he loved his people when he came from the heights of heaven for their redemption. I will go to the cross again. Come, my soul, heavy laden thou wast once, and thou didst lose thy burden there. Go to Calvary again. Perhaps that very cross which gave thee life may give thee fruitfulness. What is my barrenness? It is the platform for his fruit-creating power. What is my desolation? It is the black setting for the sapphire of his everlasting love. I will go in poverty, I will go in helplessness, I will go in all my shame and backsliding, I will tell him that I am still his child, and in confidence in his faithful heart, even I, the barren one, will sing and cry aloud.","Sing, believer, for it will cheer thine own heart, and the hearts of other desolate ones. Sing on, for now that thou art really ashamed of being barren, thou wilt be fruitful soon; now that God makes thee <i>loath</i> to be without fruit he will soon cover thee with clusters. The experience of our barrenness is painful, but the Lord’s visitations are delightful. A sense of our own poverty drives us to Christ, and that is where we need to be, for in him is our fruit found."]}