{"verses":[{"passage":"So she gleaned in the field until even.","reference":{"book":"Ruth","chapter":"2","verse":"17"}}],"reading":["Let me learn from Ruth, the gleaner. As she went out to gather the ears of corn, so must I go forth into the fields of prayer, meditation, the ordinances, and hearing the word to gather spiritual food. <i>The gleaner gathers her portion ear by </i><i>ear</i>; her gains are little by little: so must I be content to search for single truths, if there be no greater plenty of them. Every ear helps to make a bundle, and every gospel lesson assists in making us wise unto salvation. <i>The gleaner keeps </i><i>her eyes open</i>: if she stumbled among the stubble in a dream, she would have no load to carry home rejoicingly at eventide. I must be watchful in religious exercises lest they become unprofitable to me; I fear I have lost much already—O that I may rightly estimate my opportunities, and glean with greater diligence. <i>The gleaner stoops for all she finds</i>, and so must I. High spirits criticize and object, but lowly minds glean and receive benefit. A humble heart is a great help towards profitably hearing the gospel. The engrafted soul-saving word is not received except with meekness. A stiff back makes a bad gleaner; down, master pride, thou art a vile robber, not to be endured for a moment. <i>What the gleaner gathers she holds</i>: if she dropped one ear to find another, the result of her day’s work would be but scant; she is as careful to retain as to obtain, and so at last her gains are great. How often do I forget all that I hear; the second truth pushes the first out of my head, and so my reading and hearing end in much ado about nothing! Do I feel duly the importance of storing up the truth? A hungry belly makes the gleaner wise; if there be no corn in her hand, there will be no bread on her table; she labours under the sense of necessity, and hence her tread is nimble and her grasp is firm; I have even a greater necessity, Lord, help me to feel it, that it may urge me onward to glean in fields which yield so plenteous a reward to diligence."]}