{"verses":[{"passage":"Let the whole earth be filled with his glory; Amen, and Amen.","reference":{"book":"Psalm","chapter":"72","verse":"19"}}],"reading":["This is a large petition. To intercede for a whole city needs a stretch of faith, and there are times when a prayer for one man is enough to stagger us. But how far-reaching was the psalmist’s dying intercession! How comprehensive! How sublime! “Let the whole earth be filled with his glory.” It doth not exempt a single country however crushed by the foot of superstition; it doth not exclude a single nation however barbarous. For the cannibal as well as for the civilized, for all climes and races this prayer is uttered: the whole circle of the earth it encompasses, and omits no son of Adam. We must be up and doing for our Master, or we cannot honestly offer such a prayer. The petition is not asked with a sincere heart unless we endeavour, as God shall help us, to extend the kingdom of our Master. Are there not some who <i>neglect</i> both to plead and to labour? Reader, is it <i>your</i> prayer? Turn your eyes to Calvary. Behold the Lord of Life nailed to a cross, with the thorn-crown about his brow, with bleeding head, and hands, and feet. What! can you look upon this miracle of miracles, the death of the Son of God, without feeling within your bosom a marvellous adoration that language never can express? And when you feel the blood applied to your conscience, and know that he has blotted out your sins, <i>you are not a man</i> unless you start from your knees and cry, “Let the whole earth be filled with his glory; Amen, and Amen.” Can you bow before the Crucified in loving homage, and not wish to see your Monarch master of the world? Out on you if you can pretend to love your Prince, and desire not to see him the universal ruler. Your piety is worthless unless it leads you to wish that the same mercy which has been extended to you may bless the whole world. Lord, it is harvest-time, put in thy sickle and reap."]}