{"verses":[{"passage":"I charge you, O daughters of Jerusalem, if ye find my beloved, that ye tell him, that I am sick of love.","reference":{"book":"Song of Solomon","chapter":"5","verse":"8"}}],"reading":["Such is the language of the believer panting after present fellowship with Jesus, <i>he is sick for his Lord</i>. Gracious souls are never perfectly at ease except they are in a state of nearness to Christ; for when they are away from him they lose their peace. The nearer to him, the nearer to the perfect calm of heaven; the nearer to him, the fuller the heart is, not only of peace, but of life, and vigour, and joy, for these all depend on constant intercourse with Jesus. What the sun is to the day, what the moon is to the night, what the dew is to the flower, such is Jesus Christ to us. What bread is to the hungry, clothing to the naked, the shadow of a great rock to the traveller in a weary land, such is Jesus Christ to us; and, therefore, if we are not consciously one with him, little marvel if our spirit cries in the words of the Song, “I charge you, O ye daughters of Jerusalem, if ye find my beloved, tell him that I am sick of love.” <i>This earnest longing after Jesus has a </i><i>blessing attending it</i>: “Blessed are they that do hunger and thirst after righteousness”; and therefore, supremely blessed are they who thirst after the Righteous One. Blessed is that hunger, since it comes from God: if I may not have the full-blown blessedness of being filled, I would seek the same blessedness in its sweet bud-pining in emptiness and eagerness till I am filled with Christ. If I may not feed on Jesus, it shall be next door to heaven to hunger and thirst after him. There is a hallowedness about that hunger, since it sparkles among the beatitudes of our Lord. But the blessing <i>involves a </i><i>promise</i>. Such hungry ones “<i>shall be filled</i>” with what they are desiring. If Christ thus causes us to long after himself, he will certainly satisfy those longings; and when he does come to us, as come he will, <i>oh, how sweet it will be</i>!"]}