{"verses":[{"passage":"He shall stand and feed in the strength of the Lord.","reference":{"book":"Micah","chapter":"5","verse":"4"}}],"reading":["Christ’s reign in his Church is that of a <i>shepherd-king</i>. He has supremacy, but it is the superiority of a wise and tender shepherd over his needy and loving flock; he commands and receives obedience, but it is the willing obedience of the well-cared-for sheep, rendered joyfully to their beloved Shepherd, whose voice they know so well. He rules by the force of love and the energy of goodness.","His reign is <i>practical in its character</i>. It is said, “He shall <i>stand and feed</i>.” The great Head of the Church is actively engaged in providing for his people. He does not sit down upon the throne in empty state, or hold a sceptre without wielding it in government. No, he stands and feeds. The expression “feed,” in the original, is like an analogous one in the Greek, which means to shepherdize, to do everything expected of a shepherd: to guide, to watch, to preserve, to restore, to tend, as well as to feed.","His reign is <i>continual in its duration</i>. It is said, “<i>He </i><i>shall stand</i> and feed;” not “He shall feed now and then, and leave his position;” not, “He shall one day grant a revival, and then next day leave his Church to barrenness.” His eyes never slumber, and his hands never rest; his heart never ceases to beat with love, and his shoulders are never weary of carrying his people’s burdens.","His reign is <i>effectually powerful in its action</i>; “He shall feed in the strength of Jehovah.” Wherever Christ is, there is God; and whatever Christ does is the act of the Most High. Oh! it is a joyful truth to consider that he who stands today representing the interests of his people is very God of very God, to whom every knee shall bow. Happy are we who belong to such a shepherd, whose humanity communes with us, and whose divinity protects us. Let us worship and bow down before him as the people of his pasture."]}