{"verses":[{"passage":"The people, when they beheld him, were greatly amazed, and running to him saluted him.","reference":{"book":"Mark","chapter":"9","verse":"15"}}],"reading":["How great the difference between Moses and Jesus! When the prophet of Horeb had been forty days upon the mountain, he underwent a kind of transfiguration, so that his countenance shone with exceeding brightness, and he put a veil over his face, for the people could not endure to look upon his glory. Not so our Saviour. He had been transfigured with a greater glory than that of Moses, and yet, it is not written that the people were blinded by the blaze of his countenance, but rather they were amazed, and running to him they saluted him. The glory of the law repels, but the greater glory of Jesus attracts. Though Jesus is holy and just, yet blended with his purity there is so much of truth and grace, that sinners run to him amazed at his goodness, fascinated by his love; they salute him, become his disciples, and take him to be their Lord and Master. Reader, it may be that just now you are blinded by the dazzling brightness of the law of God. You feel its claims on your conscience, but you cannot keep it in your life. Not that you find fault with the law, on the contrary, it commands your profoundest esteem, still you are in nowise drawn by it to God; you are rather hardened in heart, and are verging towards desperation. Ah, poor heart! turn thine eye from Moses, with all his repelling splendour, and look to Jesus, resplendent with milder glories. Behold his flowing wounds and thorn-crowned head! He is the Son of God, and therein he is greater than Moses, but he is the Lord of love, and therein more tender than the lawgiver. He bore the wrath of God, and in his death revealed more of God’s justice than Sinai on a blaze, but that justice is now vindicated, and henceforth it is the guardian of believers in Jesus. Look, sinner, to the bleeding Saviour, and as thou feelest the attraction of his love, fly to his arms, and thou shalt be saved."]}