{"verses":[{"passage":"And they fortified Jerusalem unto the broad wall.","reference":{"book":"Nehemiah","chapter":"3","verse":"8"}}],"reading":["Cities well fortified have broad walls, and so had Jerusalem in her glory. The New Jerusalem must, in like manner, be surrounded and preserved by a broad wall of nonconformity to the world, and <i>separation</i> from its customs and spirit. The tendency of these days break down the holy barrier, and make the distinction between the church and the world merely nominal. Professors are no longer strict and Puritanical, questionable literature is read on all hands, frivolous pastimes are currently indulged, and a general laxity threatens to deprive the Lord’s peculiar people of those sacred singularities which separate them from sinners. It will be an ill day for the church and the world when the proposed amalgamation shall be complete, and the sons of God and the daughters of men shall be as one: then shall another deluge of wrath be ushered in. Beloved reader, be it your aim in heart, in word, in dress, in action to maintain the broad wall, remembering that the friendship of this world is enmity against God.","The broad wall afforded a pleasant place of <i>resort</i> for the inhabitants of Jerusalem, from which they could command prospects of the surrounding country. This reminds us of the Lord’s exceeding broad commandments, in which we walk at liberty in communion with Jesus, overlooking the scenes of earth, and looking out towards the glories of heaven. Separated from the world, and denying ourselves all ungodliness and fleshly lusts, we are nevertheless not in prison, nor restricted within narrow bounds; nay, we walk at liberty, because we keep his precepts. Come, reader, this evening walk with God in his statutes. As friend met friend upon the city wall, so meet thou thy God in the way of holy prayer and meditation. The bulwarks of salvation thou hast a right to traverse, for thou art a freeman of the royal burgh, a citizen of the metropolis of the universe."]}