{"verses":[{"passage":"Lo, I am with you alway.","reference":{"book":"Matthew","chapter":"28","verse":"20"}}],"reading":["The Lord Jesus is in the midst of his church; he walketh among the golden candlesticks; his promise is, “Lo, I am with you alway.” He is as surely with us now as he was with the disciples at the lake, when they saw coals of fire, and fish laid thereon and bread. Not carnally, but still in real truth, Jesus is with us. And a blessed truth it is, for where Jesus is, <i>love becomes inflamed</i>. Of all the things in the world that can set the heart burning, there is nothing like the presence of Jesus! A glimpse of him so overcomes us, that we are ready to say, “Turn away thine eyes from me, for they have overcome me.” Even the smell of the aloes, and the myrrh, and the cassia, which drop from his perfumed garments, causes the sick and the faint to grow strong. Let there be but a moment’s leaning of the head upon that gracious bosom, and a reception of his divine love into our poor cold hearts, and we are cold no longer, but glow like seraphs, equal to every labour, and capable of every suffering. If we know that Jesus is with us, <i>every power will </i><i>be developed</i>, and every grace will be strengthened, and we shall cast ourselves into the Lord’s service with heart, and soul, and strength; therefore is the presence of Christ to be desired above all things. <i>His presence will be most realized </i><i>by those who are most like him</i>. If you desire to see Christ, you must grow in conformity to him. Bring yourself, by the power of the Spirit, into union with Christ’s desires, and motives, and plans of action, and you are likely to be favoured with his company. Remember <i>his presence may be had</i>. His promise is as true as ever. He delights to be with us. If he doth not come, it is because we hinder him by our indifference. He will reveal himself to our earnest prayers, and graciously suffer himself to be detained by our entreaties, and by our tears, for these are the golden chains which bind Jesus to his people."]}