{"verses":[{"passage":"Ye serve the Lord Christ.","reference":{"book":"Colossians","chapter":"3","verse":"24"}}],"reading":["To what choice order of officials was this word spoken? To kings who proudly boast a right divine? Ah, no! too often do they serve themselves or Satan, and forget the God whose sufferance permits them to wear their mimic majesty for their little hour. Speaks then the apostle to those so-called “right reverend fathers in God,” the bishops, or “the venerable the archdeacons”? No, indeed, Paul knew nothing of these mere inventions of man. Not even to pastors and teachers, or to the wealthy and esteemed among believers, was this word spoken, but to servants, aye, and to slaves. Among the toiling multitudes, the journeymen, the day labourers, the domestic servants, the drudges of the kitchen, the apostle found, as we find still, some of the Lord’s chosen, and to them he says, “Whatsoever ye do, do it heartily, as to the Lord, and not unto men; knowing that of the Lord ye shall receive the reward of the inheritance: for ye serve the Lord Christ.” This saying ennobles the weary routine of earthly employments, and sheds a halo around the most humble occupations. To wash feet may be servile, but to wash <i>his</i> feet is royal work. To unloose the shoe-latchet is poor employ, but to unloose the great Master’s shoe is a princely privilege. The shop, the barn, the scullery, and the smithy become temples when men and women do all to the glory of God! Then “divine service” is not a thing of a few hours and a few places, but all life becomes holiness unto the Lord, and every place and thing, as consecrated as the tabernacle and its golden candlestick.","“Teach me, my God and King, in all things thee to see;","And what I do in anything to do it as to thee.","All may of thee partake, nothing can be so mean,","Which with this tincture, <i>for thy sake</i>, will not grow bright and clean.","A servant with this clause makes drudgery divine;","Who sweeps a room, as for thy laws, makes that and the action fine.”"]}