{"verses":[{"passage":"Call the labourers, and give them their hire.","reference":{"book":"Matthew","chapter":"20","verse":"8"}}],"reading":["God is a good paymaster; he pays his servants while at work as well as when they have done it; and one of his payments is this: <i>an easy conscience</i>. If you have spoken faithfully of Jesus to one person, when you go to bed at night you feel happy in thinking, “I have this day discharged my conscience of that man’s blood.” There is a great <i>comfort in doing something for </i><i>Jesus</i>. Oh, what a happiness to place jewels in his crown, and give him to see of the travail of his soul! There is also very great reward in <i>watching the first buddings of conviction </i><i>in a soul</i>! To say of that girl in the class, “She is tender of heart, I do hope that there is the Lord’s work within.” To go home and pray over that boy, who said something in the afternoon which made you think he must know more of divine truth than you had feared! Oh, the joy of hope! But as for <i>the joy of </i><i>success</i>! it is unspeakable. This joy, overwhelming as it is, is a hungry thing—you pine for more of it. To be a soul-winner is the happiest thing in the world. With every soul you bring to Christ, you get a new heaven upon earth. But who can conceive the bliss which awaits us above! Oh, how sweet is that sentence, “Enter thou into <i>the joy of thy Lord</i>!” Do you know what the joy of Christ is over a saved sinner? This is the very joy which we are to possess in heaven. Yes, when he mounts the throne, you shall mount with him. When the heavens ring with “Well done, well done,” you shall partake in the reward; you have toiled with him, you have suffered with him, you shall now reign with him; you have sown with him, you shall reap with him; your face was covered with sweat like his, and your soul was grieved for the sins of men as his soul was, now shall your face be bright with heaven’s splendour as is his countenance, and now shall your soul be filled with beatific joys even as his soul is."]}