{"verses":[{"passage":"Behold, all is vanity.","reference":{"book":"Ecclesiastes","chapter":"1","verse":"14"}}],"reading":["Nothing can satisfy the entire man but the Lord’s love and the Lord’s own self. Saints have tried to anchor in other roadsteads, but they have been driven out of such fatal refuges. Solomon, the wisest of men, was permitted to make experiments for us all, and to do for us what we must not dare to do for ourselves. Here is his testimony in his own words: “So I was great, and increased more than all that were before me in Jerusalem: also my wisdom remained with me. And whatsoever mine eyes desired I kept not from them, I withheld not my heart from any joy; for my heart rejoiced in all my labour: and this was my portion of all my labour. Then I looked on all the works that my hands had wrought, and on the labour that I had laboured to do: and, behold, all was vanity and vexation of spirit, and there was no profit under the sun.” “Vanity of vanities, all is vanity.” What! the whole of it vanity? O favoured monarch, is there nothing in all thy wealth? Nothing in that wide dominion reaching from the river even to the sea? Nothing in Palmyra’s glorious palaces? Nothing in the house of the forest of Lebanon? In all thy music and dancing, and wine and luxury, is there nothing? “Nothing,” he says, “but weariness of spirit.” This was his verdict when he had trodden the whole round of pleasure. To embrace our Lord Jesus, to dwell in his love, and be fully assured of union with him—this is all in all. Dear reader, you need not try other forms of life in order to see whether they are better than the Christian's: if you roam the world around, you will see no sights like a sight of the Saviour’s face; if you could have all the comforts of life, if you lost your Saviour, you would be wretched; but if you win Christ, then should you rot in a dungeon, you would find it a paradise; should you live in obscurity, or die with famine, you will yet be satisfied with favour and full of the goodness of the Lord."]}