{"verses":[{"passage":"Yea, thou heardest not; yea, thou knewest not; yea, from that time that thine ear was not opened.","reference":{"book":"Isaiah","chapter":"48","verse":"8"}}],"reading":["It is painful to remember that, in a certain degree, this accusation may be laid at the door of <i>believers</i>, who too often are in a measure <i>spiritually insensible</i>. We may well bewail ourselves that <i>we</i> do not hear the voice of God as we ought, “Yea, thou heardest not.” There are gentle motions of the Holy Spirit in the soul which are unheeded by us: there are whisperings of divine command and of heavenly love which are alike unobserved by our leaden intellects. Alas! we have been <i>carelessly ignorant</i>—“Yea, thou knewest not.” There are matters within which we ought to have seen, corruptions which have made headway unnoticed; sweet affections which are being blighted like flowers in the frost, untended by us; glimpses of the divine face which might be perceived if we did not wall up the windows of our soul. But we “have not known.” As we think of it we are humbled in the deepest self-abasement. How must we adore the grace of God as we learn from the context that all this folly and ignorance, on our part, <i>was foreknown by God</i>, and, notwithstanding that foreknowledge, he yet has been pleased to deal with us in a way of mercy! Admire the marvellous sovereign grace which could have chosen us in the sight of all this! Wonder at the price that was paid for us when Christ knew what we should be! He who hung upon the cross foresaw us as unbelieving, backsliding, cold of heart, indifferent, careless, lax in prayer, and yet he said, “I am the Lord thy God, the Holy One of Israel, thy Saviour ... Since thou wast precious in my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life!” O redemption, how wondrously resplendent dost thou shine when we think how black we are! O Holy Spirit, give us henceforth the hearing ear, the understanding heart!"]}