{"verses":[{"passage":"I am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture.","reference":{"book":"John","chapter":"10","verse":"9"}}],"reading":["Jesus, the great I AM, is the entrance into the true church, and the way of access to God himself. He gives to the man who comes to God by him four choice privileges.","1. <i>He shall be saved</i>. The fugitive manslayer passed the gate of the city of refuge, and was safe. Noah entered the door of the ark, and was secure. None can be lost who take Jesus as the door of faith to their souls. Entrance through Jesus into peace is the guarantee of entrance by the same door into heaven. Jesus is the only door, an open door, a wide door, a safe door; and blessed is he who rests all his hope of admission to glory upon the crucified Redeemer.","2. <i>He shall go in</i>. He shall be privileged to go in among the divine family, sharing the children’s bread, and participating in all their honours and enjoyments. He shall go in to the chambers of communion, to the banquets of love, to the treasures of the covenant, to the storehouses of the promises. He shall go in unto the King of kings in the power of the Holy Spirit, and the secret of the Lord shall be with him.","3. <i>He shall go out</i>. This blessing is much forgotten. We go out into the world to labour and suffer, but what a mercy to go in the name and power of Jesus! We are called to bear witness to the truth, to cheer the disconsolate, to warn the careless, to win souls, and to glorify God; and as the angel said to Gideon, “Go in this thy might,” even thus the Lord would have us proceed as his messengers in his name and strength.","4. <i>He shall find pasture</i>. He who knows Jesus shall never want. Going in and out shall be alike helpful to him: in fellowship with God he shall grow, and in watering others he shall be watered. Having made Jesus his all, he shall find all in Jesus. His soul shall be as a watered garden, and as a well of water whose waters fail not."]}