{"verses":[{"passage":"Ask, and it shall be given you.","reference":{"book":"Matthew","chapter":"7","verse":"7"}}],"reading":["We know of a place in England still existing, where a dole of bread is served to every passerby who chooses to ask for it. Whoever the traveller may be, he has but to knock at the door of St. Cross Hospital, and there is the dole of bread for him. Jesus Christ so loveth sinners that he has built a St. Cross Hospital, so that whenever a sinner is hungry, he has but to knock and have his wants supplied. Nay, he has done better; he has attached to this Hospital of the Cross a bath; and whenever a soul is black and filthy, it has but to go there and be washed. The fountain is always full, always efficacious. No sinner ever went into it and found that it could not wash away his stains. Sins which were scarlet and crimson have all disappeared, and the sinner has been whiter than snow. As if this were not enough, there is attached to this Hospital of the Cross a wardrobe, and a sinner making application simply as a sinner, may be clothed from head to foot; and if he wishes to be a soldier, he may not merely have a garment for ordinary wear, but armour which shall cover him from the sole of his foot to the crown of his head. If he asks for a sword, he shall have that given to him, and a shield too. Nothing that is good for him shall be denied him. He shall have spending-money so long as he lives, and he shall have an eternal heritage of glorious treasure when he enters into the joy of his Lord.","If all these things are to be had by merely knocking at mercy’s door, O my soul, knock hard this morning, and ask large things of thy generous Lord. Leave not the throne of grace till all thy wants have been spread before the Lord, and until by faith thou hast a comfortable prospect that they shall be all supplied. No bashfulness need retard when Jesus invites. No unbelief should hinder when Jesus promises. No cold-heartedness should restrain when such blessings are to be obtained."]}