{"verses":[{"passage":"What think ye of Christ?","reference":{"book":"Matthew","chapter":"22","verse":"42"}}],"reading":["The great test of your soul’s health is, <i>What think you of </i><i>Christ</i>? Is he to you “fairer than the children of men”—“the chief among ten thousand”—the “altogether lovely”? Wherever Christ is thus esteemed, all the faculties of the spiritual man exercise themselves with energy. I will judge of your piety by this barometer: does Christ stand high or low with you? If you have thought little of Christ, if you have been content to live without his presence, if you have cared little for his honour, if you have been neglectful of his laws, then I know that your soul is sick—God grant that it may not be sick unto death! But if the first thought of your spirit has been, how can I honour Jesus? If the daily desire of your soul has been, “O that I knew where I might find him!” I tell you that you may have a thousand infirmities, and even scarcely know whether you are a child of God at all, and yet I am persuaded, beyond a doubt, that you are safe, since Jesus is great in your esteem. I care not for thy rags, what thinkest thou of <i>his</i> royal apparel? I care not for thy wounds, though they bleed in torrents, what thinkest thou of <i>his</i> wounds? are they like glittering rubies in thine esteem? I think none the less of thee, though thou liest like Lazarus on the dunghill, and the dogs do lick thee—I judge thee not by thy poverty: what thinkest thou of the King in his beauty? Has he a glorious high throne in thy heart? Wouldest thou set him higher if thou couldest? Wouldest thou be willing to die if thou couldest but add another trumpet to the strain which proclaims his praise? Ah! then it is well with thee. Whatever thou mayest think of thyself, if Christ be great to thee, thou shalt be with him ere long.","“Though all the world my choice deride,","Yet Jesus shall my portion be;","For I am pleased with none beside,","The fairest of the fair is he”"]}