{"verses":[{"passage":"The harvest is past, the summer is ended, and we are not saved.","reference":{"book":"Jeremiah","chapter":"8","verse":"20"}}],"reading":["Not <i>saved</i>! Dear reader, is this your mournful plight? Warned of the judgment to come, bidden to escape for your life, and yet at this moment <i>not saved</i>! You know the way of salvation, you read it in the Bible, you hear it from the pulpit, it is explained to you by friends, and yet you neglect it, and therefore you are <i>not saved</i>. You will be without excuse when the Lord shall judge the quick and dead. The Holy Spirit has given more or less of blessing upon the word which has been preached in your hearing, and times of refreshing have come from the divine presence, and yet you are without Christ. All these hopeful seasons have come and gone—your summer and your harvest have past—and yet you are <i>not saved</i>. Years have followed one another into eternity, and your last year will soon be here: youth has gone, manhood is going, and yet you are <i>not saved</i>. Let me ask you—<i>will you ever be saved</i>? Is there any likelihood of it? Already the most propitious seasons have left you unsaved; will other occasions alter your condition? Means have failed with you—the best of means, used perseveringly and with the utmost affection—what more can be done for you? Affliction and prosperity have alike failed to impress you; tears and prayers and sermons have been wasted on your barren heart. Are not the probabilities dead against your ever being saved? Is it not more than likely that you will abide as you are till death forever bars the door of hope? Do you recoil from the supposition? Yet it is a most reasonable one: he who is not washed in so many waters will in all probability go filthy to his end. The convenient time never has come, why should it ever come? It is logical to fear that it never will arrive, and that Felix like, you will find no convenient season till you are in hell. O bethink you of what that hell is, and of the dread probability that you will soon be cast into it!","Reader, suppose you should die unsaved, your doom no words can picture. Write out your dread estate in tears and blood, talk of it with groans and gnashing of teeth: you will be punished with everlasting destruction from the glory of the Lord, and from the glory of his power. A brother’s voice would fain startle you into earnestness. O be wise, be wise in time, and ere another year begins, believe in Jesus, who is able to save to the uttermost. Consecrate these last hours to lonely thought, and if deep repentance be bred in you, it will be well; and if it lead to a humble faith in Jesus, it will be best of all. O see to it that this year pass not away, and you an unforgiven spirit. Let not the new year’s midnight peals sound upon a joyless spirit! Now, <span style=\"font-variant:small-caps\" id=\"d1231pm-p4.1\">now</span>, NOW believe, and live.","“ESCAPE FOR THY LIFE;","LOOK NOT BEHIND THEE,","NEITHER STAY THOU IN ALL THE PLAIN;","ESCAPE TO THE MOUNTAIN,","LEST THOU BE CONSUMED.”"]}