{"verses":[{"passage":"Even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.","reference":{"book":"Romans","chapter":"8","verse":"23"}}],"reading":["This groaning is universal among the saints: to a greater or less extent we all feel it. It is not the groan of murmuring or complaint: it is rather the note of desire than of distress. Having received an earnest, we desire the whole of our portion; we are sighing that our entire manhood, in its trinity of spirit, soul, and body, may be set free from the last vestige of the fall; we long to put off corruption, weakness, and dishonour, and to wrap ourselves in incorruption, in immortality, in glory, in the spiritual body which the Lord Jesus will bestow upon his people. We long for the manifestation of our adoption as the children of God. “We groan,” but it is “<i>within ourselves</i>.” It is not the hypocrite’s groan, by which he would make men believe that he is a saint because he is wretched. Our sighs are sacred things, too hallowed for us to tell abroad. We keep our longings to our Lord alone. Then the apostle says we are “<i>waiting</i>,” by which we learn that we are not to be petulant, like Jonah or Elijah, when they said, “Let me die”; nor are we to whimper and sigh for the end of life because we are tired of work, nor wish to escape from our present sufferings till the will of the Lord is done. We are to groan for glorification, but we are to wait patiently for it, knowing that what the Lord appoints is best. Waiting implies being ready. We are to stand at the door expecting the Beloved to open it and take us away to himself. This “groaning” is a test. You may judge of a man by what he groans after. Some men groan after wealth—they worship Mammon; some groan continually under the troubles of life—they are merely impatient; but the man who sighs after God, who is uneasy till he is made like Christ, that is the blessed man. May God help us to groan for the coming of the Lord, and the resurrection which he will bring to us."]}