{"verses":[{"passage":"And lay thy foundations with sapphires.","reference":{"book":"Isaiah","chapter":"54","verse":"11"}}],"reading":["Not only that which is seen of the church of God, but that which is unseen, is fair and precious. Foundations are out of sight, and so long as they are firm it is not expected that they should be valuable; but in Jehovah’s work everything is of a piece, nothing slurred, nothing mean. The deep foundations of the work of grace are as sapphires for preciousness, no human mind is able to measure their glory. We build upon the <i>covenant of grace</i>, which is firmer than adamant, and as enduring as jewels upon which age spends itself in vain. Sapphire foundations are eternal, and the covenant abides throughout the lifetime of the Almighty. Another foundation is <i>the person of the Lord Jesus</i>, which is clear and spotless, everlasting and beautiful as the sapphire; blending in one the deep blue of earth’s ever rolling ocean and the azure of its all embracing sky. Once might our Lord have been likened to the ruby as he stood covered with his own blood, but now we see him radiant with the soft blue of love, love abounding, deep, eternal. Our eternal hopes are built upon <i>the justice and the </i><i>faithfulness of God</i>, which are clear and cloudless as the sapphire. We are not saved by a compromise, by mercy defeating justice, or law suspending its operations; no, we defy the eagle’s eye to detect a flaw in the groundwork of our confidence—our foundation is of sapphire, and will endure the fire.","The Lord himself has laid the foundation of his people’s hopes. It is matter for grave enquiry whether <i>our</i> hopes are built upon such a basis. Good works and ceremonies are not a foundation of sapphires, but of wood, hay, and stubble; neither are they laid by God, but by our own conceit. Foundations will all be tried ere long: woe unto him whose lofty tower shall come down with a crash, because based on a quicksand. He who is built on sapphires may await storm or fire with equanimity, for he shall abide the test."]}