{"verses":[{"passage":"For your sakes he became poor.","reference":{"book":"2 Corinthians","chapter":"8","verse":"9"}}],"reading":["The Lord Jesus Christ was eternally <i>rich</i>, glorious, and exalted; but “though <i>he was rich</i>, yet for your sakes he became poor.” As the rich saint cannot be true in his communion with his poor brethren unless of his substance he ministers to their necessities, so (the same rule holding with the head as between the members), it is impossible that our Divine Lord could have had fellowship with us unless he had imparted to us of his own abounding wealth, and had become poor to make us rich. Had he remained upon his throne of glory, and had we continued in the ruins of the fall without receiving his salvation, communion would have been impossible on both sides. Our position by the fall, apart from the covenant of grace, made it as impossible for fallen man to communicate with God as it is for Belial to be in concord with Christ. In order, therefore, that communion might be compassed, it was necessary that the rich kinsman should bestow his estate upon his poor relatives, that the righteous Saviour should give to his sinning brethren of his own perfection, and that we, the poor and guilty, should receive of his fulness grace for grace; that thus in giving and receiving, the One might descend from the heights, and the other ascend from the depths, and so be able to embrace each other in true and hearty fellowship. Poverty must be enriched by him in whom are infinite treasures before it can venture to commune; and guilt must lose itself in imputed and imparted righteousness ere the soul can walk in fellowship with purity. Jesus must clothe his people in his own garments, or he cannot admit them into his palace of glory; and he must wash them in his own blood, or else they will be too defiled for the embrace of his fellowship.","O believer, herein is love! For <i>your sake</i> the Lord Jesus “became poor” that he might lift you up into communion with himself."]}