{"verses":[{"passage":"The last Adam.","reference":{"book":"1 Corinthians","chapter":"15","verse":"45"}}],"reading":["Jesus is the federal head of his elect. As in Adam, every heir of flesh and blood has a personal interest, because he is the covenant head and representative of the race as considered under the law of works; so under the law of grace, every redeemed soul is one with the Lord from heaven, since he is the Second Adam, the Sponsor and Substitute of the elect in the new covenant of love. The apostle Paul declares that Levi was in the loins of Abraham when Melchizedek met him: it is a certain truth that the believer was in the loins of Jesus Christ, the Mediator, when in old eternity the covenant settlements of grace were decreed, ratified, and made sure forever. Thus, whatever Christ hath done, he hath wrought for the whole body of his Church. We were crucified in him and buried with him (read <a class=\"scripRef\" id=\"d1226am-p3.1\" href=\"/ccel/bible/asv.Col.2.html#Col.2.10\" onclick=\"return goBible('nt','Col','2','10','2','10');\" onmouseover=\"popupVerse(this, 'Col 2:10 - 2:10')\" onmouseout=\"leaveVerse()\" name=\"_Col_2_10_2_13\">Col. 2:10-13</a>), and to make it still more wonderful, we are risen with him and even ascended with him to the seats on high (<a class=\"scripRef\" id=\"d1226am-p3.2\" href=\"/ccel/bible/asv.Eph.2.html#Eph.2.6\" onclick=\"return goBible('nt','Eph','2','6','2','6');\" onmouseover=\"popupVerse(this, 'Eph 2:6 - 2:6')\" onmouseout=\"leaveVerse()\" name=\"_Eph_2_6_0_0\">Eph. 2:6</a>). It is thus that the Church has fulfilled the law, and is “accepted <i>in the beloved</i>.” It is thus that she is regarded with complacency by the just Jehovah, for he views her in Jesus, and does not look upon her as separate from her covenant head. As the Anointed Redeemer of Israel, Christ Jesus has nothing distinct from his Church, but all that he has he holds for her. Adam’s righteousness was ours so long as he maintained it, and his sin was ours the moment that he committed it; and in the same manner, all that the Second Adam is or does, is ours as well as his, seeing that he is our representative. Here is the foundation of the covenant of grace. This gracious system of representation and substitution, which moved Justin Martyr to cry out, “O blessed change, O sweet permutation!” this is the very groundwork of the gospel of our salvation, and is to be received with strong faith and rapturous joy."]}