{"verses":[{"passage":"Yet he hath made with me an everlasting covenant.","reference":{"book":"2 Samuel","chapter":"23","verse":"5"}}],"reading":["This covenant is <i>divine in its origin</i>. “<span style=\"font-variant:small-caps\" id=\"d1221am-p3.1\">He</span> hath made with me an everlasting covenant.” Oh that great word <span style=\"font-variant:small-caps\" id=\"d1221am-p3.2\">He</span> ! Stop, my soul. God, the everlasting Father, has positively made a covenant with thee; yes, that God who spake the world into existence by a word; he, stooping from his majesty, takes hold of thy hand and makes a covenant with thee. Is it not a deed, the stupendous condescension of which might ravish our hearts forever if we could really understand it? “HE hath made with me a covenant.” A king has not made a covenant with me—that were somewhat; but the Prince of the kings of the earth, Shaddai, the Lord All-sufficient, the Jehovah of ages, the everlasting Elohim, “He hath made with me an everlasting covenant.” But notice, it is <i>particular in its application</i>. “Yet hath he made with <span style=\"font-variant:small-caps\" id=\"d1221am-p3.3\">me</span> an everlasting covenant.” Here lies the sweetness of it to each believer. It is nought for me that he made peace for the world; I want to know whether he made peace for <i>me</i>! It is little that he hath made a covenant, I want to know whether he has made a covenant <i>with me</i>. Blessed is the assurance that he hath made a covenant with me! If God the Holy Ghost gives me assurance of this, then his salvation is mine, his heart is mine, he himself is mine—<i>he is my God</i>.","This covenant is <i>everlasting in its duration</i>. An everlasting covenant means a covenant which had no beginning, and which shall never, never end. How sweet amidst all the uncertainties of life, to know that “the foundation of the Lord standeth sure,” and to have God’s own promise, “My covenant will I not break, nor alter the thing that is gone out of my lips.” Like dying David, I will sing of this, even though my house be not so with God as my heart desireth."]}