{"verses":[{"passage":"His ways are everlasting.","reference":{"book":"Habakkuk","chapter":"3","verse":"6"}}],"reading":["What he hath done at one time, he will do yet again. Man’s ways are variable, but God’s ways are everlasting. There are many reasons for this most comforting truth: among them are the following—the Lord’s ways are <i>the result of wise </i><i>deliberation</i>; he ordereth all things according to the counsel of his own will. Human action is frequently the hasty result of passion, or fear, and is followed by regret and alteration; but nothing can take the Almighty by surprise, or happen otherwise than he has foreseen. His ways are <i>the </i><i>outgrowth of an immutable character</i>, and in them the fixed and settled attributes of God are clearly to be seen. Unless the Eternal One himself can undergo change, his ways, which are himself in action, must remain forever the same. Is he eternally just, gracious, faithful, wise, tender?—then his ways must ever be distinguished for the same excellences. Beings act according to their nature: when those natures change, their conduct varies also; but since God cannot know the shadow of a turning, his ways will abide everlastingly the same. Moreover there is no reason from without which could reverse the divine ways, since they are the <i>embodiment of irresistible might</i>. The earth is said, by the prophet, to be cleft with rivers, mountains tremble, the deep lifts up its hands, and sun and moon stand still, when Jehovah marches forth for the salvation of his people. Who can stay his hand, or say unto him, What doest thou? But it is not might alone which gives stability; God’s ways are <i>the manifestation of the eternal principles of right</i>, and therefore can never pass away. Wrong breeds decay and involves ruin, but the true and the good have about them a vitality which ages cannot diminish.","This morning let us go to our heavenly Father with confidence, remembering that Jesus Christ is the same yesterday, today, and forever, and in him the Lord is ever gracious to his people."]}