{"verses":[{"passage":"I will make thy windows of agates.","reference":{"book":"Isaiah","chapter":"54","verse":"12"}}],"reading":["The church is most instructively symbolized by a building erected by heavenly power, and designed by divine skill. Such a spiritual house must not be dark, for the Israelites had light in their dwellings; there must therefore be windows to let the light in and to allow the inhabitants to gaze abroad. These windows are <i>precious</i> as agates: the ways in which the church beholds her Lord and heaven, and spiritual truth in general, are to be had in the highest esteem. Agates are <i>not the most </i><i>transparent</i> of gems, they are but semi-pellucid at the best:","<i>Faith</i> is one of these precious agate windows, but alas! it is often so misty and beclouded, that we see but darkly, and mistake much that we do see. Yet if we cannot gaze through windows of diamonds and know even as we are known, it is a glorious thing to behold the altogether lovely One, even though the glass be hazy as the agate. <i>Experience</i> is another of these dim but precious windows, yielding to us a subdued religious light, in which we see the sufferings of the Man of Sorrows, through our own afflictions. Our weak eyes could not endure windows of transparent glass to let in the Master’s glory, but when they are dimmed with weeping, the beams of the Sun of Righteousness are tempered, and shine through the windows of agate with a soft radiance inexpressibly soothing to tempted souls. <i>Sanctification</i>, as it conforms us to our Lord, is another agate window. Only as we become heavenly can we comprehend heavenly things. The pure in heart see a pure God. Those who are like Jesus see him as he is. Because we are so little like him, the window is but agate; because we are somewhat like him, it is agate. We thank God for what we have, and long for more. When shall we see God and Jesus, and heaven and truth, face to face?","“Our knowledge of that life is small,","Our eye of faith is dim.”"]}