{"verses":[{"passage":"Tell me ... where thou feedest, where thou makest thy flock to rest at noon.","reference":{"book":"Song of Solomon","chapter":"1","verse":"7"}}],"reading":["These words express the desire of the believer after Christ, and his longing for present communion with him. Where doest thou feed thy flock? In <i>thy house</i>? I will go, if I may find thee there. In private <i>prayer</i>? Then I will pray without ceasing. In the <i>Word</i>? Then I will read it diligently. In thine <i>ordinances</i>? Then I will walk in them with all my heart. Tell me where thou feedest, for wherever thou standest as the Shepherd, there will I lie down as a sheep; for none but thyself can supply my need. I cannot be satisfied to be apart from thee. My soul hungers and thirsts for the refreshment of thy presence. “Where dost thou make thy flock to rest at noon?” for whether at dawn or at noon, my only rest must be where thou art and thy beloved flock. My soul’s rest must be a grace-given rest, and can only be found in thee. Where is the shadow of that rock? Why should I not repose beneath it? “Why should I be as one that turneth aside by the flocks of thy companions?” Thou hast companions—why should I not be one? Satan tells me I am unworthy; but I always was unworthy, and yet thou hast long loved me; and therefore my unworthiness cannot be a bar to my having fellowship with thee now. It is true I am weak in faith, and prone to fall, but my very feebleness is the reason why I should always be where thou feedest thy flock, that I may be strengthened, and preserved in safety beside the still waters. Why should I turn aside? There is no reason why I should, but there are a thousand reasons why I should not, for Jesus beckons me to come. If he withdrew himself a little, it is but to make me prize his presence more. Now that I am grieved and distressed at being away from him, he will lead me yet again to that sheltered nook where the lambs of his fold are sheltered from the burning sun."]}