{"verses":[{"passage":"Understandest thou what thou readest?","reference":{"book":"Acts","chapter":"8","verse":"30"}}],"reading":["We should be abler teachers of others, and less liable to be carried about by every wind of doctrine, if we sought to have a more intelligent understanding of the Word of God. As the Holy Ghost, the Author of the Scriptures is he who alone can enlighten us rightly to understand them, we should constantly ask his teaching, and his guidance into all truth. When the prophet Daniel would interpret Nebuchadnezzar’s dream, what did he do? He set himself to earnest prayer that God would open up the vision. The apostle John, in his vision at Patmos, saw a book sealed with seven seals which none was found worthy to open, or so much as to look upon. The book was afterwards opened by the Lion of the tribe of Judah, who had prevailed to open it; but it is written first—“I wept much.” The tears of John, which were his liquid prayers, were, so far as he was concerned, the sacred keys by which the folded book was opened. Therefore, if, for your own and others’ profiting, you desire to be “filled with the knowledge of God’s will in all wisdom and spiritual understanding,” remember that prayer is your best means of study: like Daniel, you shall understand the dream, and the interpretation thereof, when you have sought unto God; and like John you shall see the seven seals of precious truth unloosed, after you have wept much. Stones are not broken, except by an earnest use of the hammer; and the stone-breaker must go down on his knees. Use the hammer of diligence, and let the knee of prayer be exercised, and there is not a stony doctrine in revelation which is useful for you to understand, which will not fly into shivers under the exercise of prayer and faith. You may force your way through anything with the leverage of prayer. Thoughts and reasonings are like the steel wedges which give a hold upon truth; but prayer is the lever, the prise which forces open the iron chest of sacred mystery, that we may get the treasure hidden within."]}