{"verses":[{"passage":"Behold, what manner of love the Father hath bestowed upon us, that we should be called the sons of God: therefore the world knoweth us not, because it knew him not. Beloved, now are we the sons of God.","reference":{"book":"1 John","chapter":"3","verse":"1,2"}}],"reading":["“Behold, what manner of love the Father hath bestowed upon us.” Consider who we were, and what we feel ourselves to be even now when corruption is powerful in us, and you will wonder at our adoption. Yet we are called “<i>the sons of God</i>.” What a high relationship is that of a son, and what privileges it brings! What care and tenderness the son expects from his father, and what love the father feels towards the son! But all <i>that</i>, and more than that, we now have through Christ. As for the temporary drawback of suffering with the elder brother, this we accept as an honour: “Therefore the world knoweth us not, because it knew him not.” We are content to be unknown with him in his humiliation, for we are to be exalted with him. “<i>Beloved, now are we the sons of God</i>.” That is easy to read, but it is not so easy to feel. How is it with your heart this morning? Are you in the lowest depths of sorrow? Does corruption rise within your spirit, and grace seem like a poor spark trampled under foot? Does your faith almost fail you? Fear not, it is neither your graces nor feelings on which you are to live: you must live simply by faith on Christ. With all these things against us, now—in the very depths of our sorrow, wherever we may be—<i>now</i>, as much in the valley as on the mountain, “Beloved, <i>now</i> are we the sons of God.” “Ah, but,” you say, “see how I am arrayed! my graces are not bright; my righteousness does not shine with apparent glory.” But read the next: <i>“It doth not yet appear what we shall be: but we know </i><i>that, when he shall appear, we shall be like him</i>.” The Holy Spirit shall purify our minds, and divine power shall refine our bodies; then shall <i>we see him as he is</i>."]}