{"verses":[{"passage":"The Lord is slow to anger, and great in power.","reference":{"book":"Nahum","chapter":"1","verse":"3"}}],"reading":["Jehovah “<i>is slow to anger</i>.” When mercy cometh into the world she driveth winged steeds; the axles of her chariot-wheels are red hot with speed; but when wrath goeth forth, it toileth on with tardy footsteps, for God taketh no pleasure in the sinner’s death. God’s rod of mercy is ever in his hands outstretched; his sword of justice is in its scabbard, held down by that pierced hand of love which bled for the sins of men. “The Lord is slow to anger,” because he is <span style=\"font-variant:small-caps\" id=\"d0222pm-p3.1\">great in power</span>. He is truly great in power who hath power over himself. When God’s power doth restrain himself, then it is power indeed: the power that binds omnipotence is omnipotence surpassed. A man who has a strong mind can bear to be insulted long, and only resents the wrong when a sense of right demands his action. The weak mind is irritated at a little: the strong mind bears it like a rock which moveth not, though a thousand breakers dash upon it, and cast their pitiful malice in spray upon its summit. God marketh his enemies, and yet he bestirs not himself, but holdeth in his anger. If he were less divine than he is, he would long ere this have sent forth the whole of his thunders, and emptied the magazines of heaven; he would long ere this have blasted the earth with the wondrous fires of its lower regions, and man would have been utterly destroyed; but the greatness of his power brings us mercy. Dear reader, what is your state this evening? Can you by humble faith look to Jesus, and say, “My substitute, thou art my rock, my trust”? Then, beloved, be not afraid of God’s power; for by faith you have fled to Christ for refuge, the power of God need no more terrify you, than the shield and sword of the warrior need terrify those whom he loves. Rather rejoice that he who is “great in power” is your Father and Friend."]}