{"verses":[{"passage":"Therefore, brethren, we are debtors.","reference":{"book":"Romans","chapter":"8","verse":"12"}}],"reading":["As God’s creatures, we are all debtors to him: to obey him with all our body, and soul, and strength. Having broken his commandments, as we all have, we are debtors to his justice, and we owe to him a vast amount which we are not able to pay. But of the <i>Christian</i> it can be said that he does not owe God’s <i>justice</i> anything, for Christ has paid the debt his people owed; for this reason the believer owes the more to <i>love</i>. I am a debtor to God’s grace and forgiving mercy; but I am no debtor to his justice, for he will never accuse me of a debt already paid. Christ said, “It is finished!” and by that he meant, that whatever his people owed was wiped away forever from the book of remembrance. Christ, to the uttermost, has satisfied divine justice; the account is settled; the handwriting is nailed to the cross; the receipt is given, and we are debtors to God’s justice no longer. But then, because we are not debtors to our Lord in that sense, we become ten times more debtors to God than we should have been otherwise. Christian, pause and ponder for a moment. What a debtor thou art to divine <i>sovereignty</i>! How much thou owest to his disinterested love, for he gave his own Son that he might die for thee. Consider how much you owe to his forgiving <i>grace</i>, that after ten thousand affronts he loves you as infinitely as ever. Consider what you owe to his <i>power</i>; how he has raised you from your death in sin; how he has preserved your spiritual life; how he has kept you from falling; and how, though a thousand enemies have beset your path, you have been able to hold on your way. Consider what you owe to his <i>immutability</i>. Though you have changed a thousand times, he has not changed once. Thou art as deep in debt as thou canst be to every attribute of God. To God thou owest thyself, and all thou hast—yield thyself as a living sacrifice, it is but thy reasonable service."]}