{"verses":[{"passage":"I have blotted out, as a thick cloud, thy transgressions, and, as a cloud, thy sins: return unto me; for I have redeemed thee.","reference":{"book":"Isaiah","chapter":"44","verse":"22"}}],"reading":["Attentively observe <span style=\"font-variant:small-caps\" id=\"d0210pm-p3.1\">the instructive similitude</span>: our sins are like a <i>cloud</i>. As clouds are of many shapes and shades, so are our transgressions. As clouds obscure the light of the sun, and darken the landscape beneath, so do our sins hide from us the light of Jehovah’s face, and cause us to sit in the shadow of death. They are earth-born things, and rise from the miry places of our nature; and when so collected that their measure is full, they threaten us with storm and tempest. Alas! that, unlike clouds, our sins yield us no genial showers, but rather threaten to deluge us with a fiery flood of destruction. O ye black clouds of sin, how can it be fair weather with our souls while ye remain?","Let our joyful eye dwell upon <span style=\"font-variant:small-caps\" id=\"d0210pm-p4.1\">the notable act</span> of divine mercy—“blotting out.” God himself appears upon the scene, and in divine benignity, instead of manifesting his anger, reveals his grace: he at once and forever effectually removes the mischief, not by blowing away the cloud, but by blotting it out from existence once for all. Against the justified man no sin remains, the great transaction of the cross has eternally removed his transgressions from him. On Calvary’s summit the great deed, by which the sin of all the chosen was forever put away, was completely and effectually performed.","Practically let us obey <span style=\"font-variant:small-caps\" id=\"d0210pm-p5.1\">the gracious command</span>, “<i>return unto </i><i>me</i>.” Why should pardoned sinners live at a distance from their God? If we have been forgiven all our sins, let no legal fear withhold us from the boldest access to our Lord. Let backslidings be bemoaned, but let us not persevere in them. To the greatest possible nearness of communion with the Lord, let us, in the power of the Holy Spirit, strive mightily to return. O Lord, this night restore us!"]}