{"verses":[{"passage":"Pray one for another.","reference":{"book":"James","chapter":"5","verse":"16"}}],"reading":["As an encouragement cheerfully to offer intercessory prayer, remember that <i>such prayer is the sweetest God ever hears</i>, for the prayer of Christ is of this character. In all the incense which our Great High Priest now puts into the golden censer, there is not a single grain for himself. His intercession must be the most acceptable of all supplications—and the more like our prayer is to Christ's, the sweeter it will be; thus while petitions for ourselves will be accepted, our pleadings for others, having in them more of the fruits of the Spirit, more love, more faith, more brotherly kindness, will be, through the precious merits of Jesus, the sweetest oblation that we can offer to God, the very fat of our sacrifice. Remember, again, that <i>intercessory prayer is </i><i>exceedingly prevalent</i>. What wonders it has wrought! The Word of God teems with its marvellous deeds. Believer, thou hast a mighty engine in thy hand, use it well, use it constantly, use it with faith, and thou shalt surely be a benefactor to thy brethren. When thou hast the King’s ear, speak to him for the suffering members of his body. When thou art favoured to draw very near to his throne, and the King saith to thee, “Ask, and I will give thee what thou wilt,” let thy petitions be, not for thyself alone, but for the many who need his aid. If thou hast grace at all, and art not an intercessor, that grace must be small as a grain of mustard seed. Thou hast just enough grace to float thy soul clear from the quicksand, but thou hast no deep floods of grace, or else thou wouldst carry in thy joyous bark a weighty cargo of the wants of others, and thou wouldst bring back from thy Lord, for them, rich blessings which but for thee they might not have obtained:—","“Oh, let my hands forget their skill,","My tongue be silent, cold, and still,","This bounding heart forget to beat,","If I forget the mercy-seat!”"]}