{"verses":[{"passage":"And his allowance was a continual allowance given him of the king, a daily rate for every day, all the days of his life.","reference":{"book":"2 Kings","chapter":"25","verse":"30"}}],"reading":["Jehoiachin was not sent away from the king’s palace with a store to last him for months, but his provision was given him as a daily pension. Herein he well pictures the happy position of all the Lord’s people. A daily portion is <i>all that a man </i><i>really wants</i>. We do not need tomorrow’s supplies; that day has not yet dawned, and its wants are as yet unborn. The thirst which we may suffer in the month of June does not need to be quenched in February, for we do not feel it yet; if we have enough for each day as the days arrive we shall never know want. Sufficient for the day is <i>all that we can enjoy</i>. We cannot eat or drink or wear more than the day’s supply of food and raiment; the surplus gives us the care of storing it, and the anxiety of watching against a thief. One staff aids a traveller, but a bundle of staves is a heavy burden. Enough is not only as good as a feast, but is all that the greatest glutton can truly enjoy. This is <i>all that we should expect</i>; a craving for more than this is ungrateful. When our Father does not give us more, we should be content with his daily allowance. Jehoiachin’s case is ours, we have a sure portion, a portion <i>given us of the </i><i>king</i>, a <i>gracious</i> portion, and a <i>perpetual portion</i>. Here is surely ground for thankfulness.","Beloved Christian reader, in matters of grace <i>you need a </i><i>daily supply</i>. You have no store of strength. Day by day must you seek help from above. It is a very sweet assurance that <i>a </i><i>daily portion is provided for you</i>. In the word, through the ministry, by meditation, in prayer, and waiting upon God you shall receive renewed strength. In Jesus all needful things are laid up for you. Then <i>enjoy your continual allowance</i>. Never go hungry while the daily bread of grace is on the table of mercy."]}