{"verses":[{"passage":"Thy good Spirit.","reference":{"book":"Nehemiah","chapter":"9","verse":"20"}}],"reading":["Common, too common is the sin of forgetting the Holy Spirit. This is folly and ingratitude. He deserves well at our hands, for he is good, supremely good. As God, he is good essentially. He shares in the threefold ascription of Holy, holy, holy, which ascends to the Triune Jehovah. Unmixed purity and truth, and grace is he. He is <i>good benevolently</i>, tenderly bearing with our waywardness, striving with our rebellious wills; quickening us from our death in sin, and then training us for the skies as a loving nurse fosters her child. How generous, forgiving, and tender is this patient Spirit of God. He is <i>good operatively</i>. All his works are good in the most eminent degree: he suggests good thoughts, prompts good actions, reveals good truths, applies good promises, assists in good attainments, and leads to good results. There is no spiritual good in all the world of which he is not the author and sustainer, and heaven itself will owe the perfect character of its redeemed inhabitants to his work. He is <i>good officially</i>; whether as Comforter, Instructor, Guide, Sanctifier, Quickener, or Intercessor, he fulfils his office well, and each work is fraught with the highest good to the church of God. They who yield to his influences become good, they who obey his impulses do good, they who live under his power receive good. Let us then act towards so good a person according to the dictates of gratitude. Let us revere his person, and adore him as God over all, blessed forever; let us own his power, and our need of him by waiting upon him in all our holy enterprises; let us hourly seek his aid, and never grieve him; and let us speak to his praise whenever occasion occurs. The church will never prosper until more reverently it believes in the Holy Ghost. He is so good and kind, that it is sad indeed that he should be grieved by slights and negligences."]}