{"verses":[{"passage":"But Jonah rose up to flee unto Tarshish from the presence of the Lord, and went down to Joppa.","reference":{"book":"Jonah","chapter":"1","verse":"3"}}],"reading":["Instead of going to Nineveh to preach the Word, as God bade him, Jonah disliked the work, and went down to Joppa to escape from it. There are occasions when God’s servants shrink from duty. But what is the consequence? What did Jonah lose by his conduct? <i>He lost the presence and comfortable enjoyment of </i><i>God’s love</i>. When we serve our Lord Jesus as believers should do, our God is with us; and though we have the whole world against us, if we have God with us, what does it matter? But the moment we start back, and seek our own inventions, we are at sea without a pilot. Then may we bitterly lament and groan out, “O my God, where hast thou gone? How could I have been so foolish as to shun thy service, and in this way to lose all the bright shinings of thy face? This is a price too high. Let me return to my allegiance, that I may rejoice in thy presence.” In the next place, Jonah <i>lost all peace of mind</i>. Sin soon destroys a believer’s comfort. It is the poisonous upas tree, from whose leaves distil deadly drops which destroy the life of joy and peace. Jonah <i>lost everything upon which he might have drawn </i><i>for comfort in any other case</i>. He could not plead the promise of divine protection, for he was not in God’s ways; he could not say, “Lord, I meet with these difficulties in the discharge of my duty, therefore help me through them.” He was reaping his own deeds; he was filled with his own ways. Christian, do not play the Jonah, unless you wish to have all the waves and the billows rolling over your head. You will find in the long run that it is far harder to shun the work and will of God than to at once yield yourself to it. <i>Jonah lost his </i><i>time</i>, for he had to go to Nineveh after all. It is hard to contend with God; let us yield ourselves at once."]}