{"verses":[{"passage":"Your refuge from the avenger of blood.","reference":{"book":"Joshua","chapter":"20","verse":"3"}}],"reading":["It is said that in the land of Canaan, cities of refuge were so arranged, that any man might reach one of them within half a day at the utmost. Even so the word of our salvation is near to us; Jesus is a present Saviour, and the way to him is short; it is but a simple renunciation of our own merit, and a laying hold of Jesus, to be our all in all. With regard to the roads to the city of refuge, we are told that they were strictly preserved, every river was bridged, and every obstruction removed, so that the man who fled might find an easy passage to the city. Once a year the elders went along the roads and saw to their order, so that nothing might impede the flight of any one, and cause him, through delay, to be overtaken and slain. How graciously do the promises of the gospel remove stumbling blocks from the way! Wherever there were by-roads and turnings, there were fixed up hand-posts, with the inscription upon them—“To the city of refuge!” This is a picture of the road to Christ Jesus. It is no roundabout road of the law; it is no obeying this, that, and the other; it is a straight road: “Believe, and live.” It is a road so hard, that no self-righteous man can ever tread it, but so easy, that every sinner, who knows himself to be a sinner may by it find his way to heaven. No sooner did the man-slayer reach the outworks of the city than he was safe; it was not necessary for him to pass far within the walls, but the suburbs themselves were sufficient protection. Learn hence, that if you do but touch the hem of Christ’s garment, you shall be made whole; if you do but lay hold upon him with “faith as a grain of mustard seed,” you are safe.","Only waste no time, loiter not by the way, for the avenger of blood is swift of foot; and it may be he is at your heels at this still hour of eventide.","“A little genuine grace ensures","The death of all our sins.”"]}