{"verses":[{"passage":"Whereas the Lord was there.","reference":{"book":"Ezekiel","chapter":"35","verse":"10"}}],"reading":["Edom’s princes saw the whole country left desolate, and counted upon its easy conquest; but there was one great difficulty in their way—quite unknown to them—“<i>The Lord was there;</i>” and in his presence lay the special security of the chosen land. Whatever may be the machinations and devices of the enemies of God’s people, there is still the same effectual barrier to thwart their design. The saints are God’s heritage, and he is in the midst of them, and will protect his own. What comfort this assurance yields us in our troubles and spiritual conflicts! We are constantly opposed, and yet perpetually preserved! How often Satan shoots his arrows against our <i>faith</i>, but our faith defies the power of hell’s fiery darts; they are not only turned aside, but they are quenched upon its shield, for “the Lord is there.” <i>Our good works</i> are the subjects of Satan’s attacks. A saint never yet had a virtue or a grace which was not the target for hellish bullets: whether it was hope bright and sparkling, or love warm and fervent, or patience all-enduring, or zeal flaming like coals of fire, the old enemy of everything that is good has tried to destroy it. The only reason why anything virtuous or lovely survives in us is this, “the Lord is there.”","If the Lord be with us through life, we need not fear for our dying confidence; for <i>when we come to die</i>, we shall find that “the Lord is <i>there</i>;” where the billows are most tempestuous, and the water is most chill, we shall feel the bottom, and know that it is good: our feet shall stand upon the Rock of Ages when time is passing away. Beloved, from the first of a Christian’s life to the last, the only reason why he does not perish is because “<i>the Lord is there</i>.” When the God of everlasting love shall change and leave his elect to perish, then may the Church of God be destroyed; but not till then, because it is written, <span style=\"font-variant:small-caps\" id=\"d0217pm-p4.1\">Jehovah Shammah</span>, “<i>The Lord is there</i>.”"]}