{"verses":[{"passage":"O Lord of hosts, how long wilt thou not have mercy upon Jerusalem? ... And the Lord answered the angel ... with good words and comfortable words.","reference":{"book":"Zechariah","chapter":"1","verse":"12,13"}}],"reading":["What a sweet answer to an anxious enquiry! This night let us rejoice in it. O Zion, there are good things in store for thee; thy time of travail shall soon be over; thy children shall be brought forth; thy captivity shall end. Bear patiently the rod for a season, and under the darkness still trust in God, for his love burneth towards thee. God loves the church with a love too deep for human imagination: he loves her with all his infinite heart. Therefore let her sons be of good courage; she cannot be far from prosperity to whom God speaketh “good words and comfortable words.” What these comfortable words are the prophet goes on to tell us: “I am jealous for Jerusalem and for Zion with a great jealousy.” The Lord loves his church so much that he cannot bear that she should go astray to others; and when she has done so, he cannot endure that she should suffer too much or too heavily. He will not have his enemies afflict her: he is displeased with them because they increase her misery. When God seems most to leave his church, his heart is warm towards her. History shows that whenever God uses a rod to chasten his servants, he always breaks it afterwards, as if he loathed the rod which gave his children pain. “Like as a father pitieth his children, so the Lord pitieth them that fear him.” God hath not forgotten us because he smites—his blows are no evidences of want of love. If this is true of his church <i>collectively</i>, it is of necessity true also of <i>each individual member</i>. You may fear that the Lord has passed you by, but it is not so: he who counts the stars, and calls them by their names, is in no danger of forgetting his own children. He knows your case as thoroughly as if you were the only creature he ever made, or the only saint he ever loved. Approach him and be at peace."]}