{"verses":[{"passage":"Father, I have sinned.","reference":{"book":"Luke","chapter":"15","verse":"18"}}],"reading":["It is quite certain that those whom Christ has washed in his precious blood need not make a confession of sin, as culprits or criminals, before God the Judge, for Christ has forever taken away all their sins in a legal sense, so that they no longer stand where they can be condemned, but are once for all accepted in the Beloved; but having become children, and offending as children, ought they not every day to go before their heavenly Father and confess their sin, and acknowledge their iniquity in that character? Nature teaches that it is the duty of erring children to make a confession to their earthly father, and the grace of God in the heart teaches us that we, as Christians, owe the same duty to our heavenly Father. We daily offend, and ought not to rest without daily pardon. For, supposing that my trespasses against my Father are not at once taken to him to be washed away by the cleansing power of the Lord Jesus, what will be the consequence? If I have not sought forgiveness and been washed from these offences against my Father, I shall feel at a distance from him; I shall doubt his love to me; I shall tremble at him; I shall be afraid to pray to him: I shall grow like the prodigal, who, although still a child, was yet far off from his father. But if, with a child’s sorrow at offending so gracious and loving a Parent, I go to him and tell him all, and rest not till I realize that I am forgiven, then I shall feel a holy love to my Father, and shall go through my Christian career, not only as saved, but as one enjoying present peace in God through Jesus Christ my Lord. There is a wide distinction between confessing sin <i>as a culprit</i>, and confessing sin <i>as a child</i>. The Father’s bosom is the place for penitent confessions. We have been cleansed once for all, but our feet still need to be washed from the defilement of our daily walk as children of God."]}