{"verses":[{"passage":"Now we have received ... the spirit which is of God; that we might know the things that are freely given to us of God.","reference":{"book":"1 Corinthians","chapter":"2","verse":"12"}}],"reading":["Dear reader, have you received the spirit which is of God, wrought by the Holy Ghost in your soul? The necessity of the work of the Holy Spirit in the heart may be clearly seen from this fact, that <i>all which has been done by God the Father, and </i><i>by God the Son, must be ineffectual to us, unless the Spirit </i><i>shall reveal these things to our souls</i>. What effect does the doctrine of election have upon any man until the Spirit of God enters into him? Election is a dead letter in my consciousness until the Spirit of God calls me out of darkness into marvellous light. <i>Then</i> through my calling, I see my election, and knowing myself to be called of God, I know myself to have been chosen in the eternal purpose. A covenant was made with the Lord Jesus Christ, by his Father; but what avails that covenant to us until the Holy Spirit brings us its blessings, and opens our hearts to receive them? There hang the blessings on the nail—Christ Jesus; but being short of stature, we cannot reach them; the Spirit of God takes them down and hands them to us, and thus they become actually ours. Covenant blessings in themselves are like the manna in the skies, far out of mortal reach, but the Spirit of God opens the windows of heaven and scatters the living bread around the camp of the spiritual Israel. Christ’s finished work is like wine stored in the wine-vat; through unbelief we can neither draw nor drink. The Holy Spirit dips our vessel into this precious wine, and then we drink; but without the Spirit we are as truly dead in sin as though the Father never had elected, and though the Son had never bought us with his blood. The Holy Spirit is absolutely necessary to our well-being. Let us walk lovingly towards him and tremble at the thought of grieving him."]}