{"verses":[{"passage":"He was sore athirst, and called on the Lord, and said, thou hast given this great deliverance into the hand of thy servant: and now shall I die for thirst?","reference":{"book":"Judges","chapter":"15","verse":"18"}}],"reading":["Samson was thirsty and ready to die. The difficulty was totally different from any which the hero had met before. Merely to get thirst assuaged is nothing like so great a matter as to be delivered from a thousand Philistines! but when the thirst was upon him, Samson felt that little present difficulty more weighty than the great past difficulty out of which he had so specially been delivered. It is very usual for God’s people, when they have enjoyed a great deliverance, to find a little trouble too much for them. Samson slays a thousand Philistines, and piles them up in heaps, and then faints for a little water! Jacob wrestles with God at Peniel, and overcomes Omnipotence itself, and then goes “halting on his thigh!” Strange that there must be a shrinking of the sinew whenever we win the day. As if the Lord must teach us our littleness, our nothingness, in order to keep us within bounds. Samson boasted right loudly when he said, “I have slain a thousand men.” His boastful throat soon grew hoarse with thirst, and he betook himself to prayer. God has many ways of humbling his people. Dear child of God, if after great mercy you are laid very low, your case is not an unusual one. When David had mounted the throne of Israel, he said, “I am this day weak, though anointed king.” You must expect to feel weakest when you are enjoying your greatest triumph. If God has wrought for you great deliverances in the past, your present difficulty is only like Samson’s thirst, and the Lord will not let you faint, nor suffer the daughter of the uncircumcised to triumph over you. The road of sorrow is the road to heaven, but there are wells of refreshing water all along the route. So, tried brother, cheer your heart with Samson’s words, and rest assured that God will deliver you ere long."]}