{"verses":[{"passage":"The Messiah shall be cut off, but not for himself.","reference":{"book":"Daniel","chapter":"9","verse":"26"}}],"reading":["Blessed be his name, there was no cause of death in him. Neither original nor actual sin had defiled him, and therefore death had no claim upon him. No man could have taken his life from him justly, for he had done no man wrong, and no man could even have lain him by force unless he had been pleased to yield himself to die. But lo, one sins and another suffers. Justice was offended by us, but found its satisfaction in him. Rivers of tears, mountains of offerings, seas of the blood of bullocks, and hills of frankincense, could not have availed for the removal of sin; but Jesus was cut off for us, and the cause of wrath was cut off at once, for sin was put away forever. Herein is wisdom, whereby substitution, the sure and speedy way of atonement, was devised! Herein is condescension, which brought Messiah, the Prince, to wear a crown of thorns, and die upon the cross! Herein is love, which led the Redeemer to lay down his life for his enemies!","It is not enough, however, to admire the spectacle of the innocent bleeding for the guilty, we must make sure of our interest therein. The special object of the Messiah’s death was the salvation of his church; have we a part and a lot among those for whom he gave his life a ransom? Did the Lord Jesus stand as our representative? Are we healed by his stripes? It will be a terrible thing indeed if we should come short of a portion in his sacrifice; it were better for us that we had never been born. Solemn as the question is, it is a joyful circumstance that it is one which may be answered clearly and without mistake. To all who believe on him the Lord Jesus is a present Saviour, and upon them all the blood of reconciliation has been sprinkled. Let all who trust in the merit of Messiah’s death be joyful at every remembrance of him, and let their holy gratitude lead them to the fullest consecration to his cause."]}