{"verses":[{"passage":"Do we then make void the law through faith? God forbid: yea, we establish the law.","reference":{"book":"Romans","chapter":"3","verse":"31"}}],"reading":["When the believer is adopted into the Lord’s family, his relationship to old Adam and the law ceases at once; but then he is under a new rule, and a new covenant. Believer, you are God’s child; it is your first duty to obey your heavenly Father. A servile spirit you have nothing to do with: you are not a slave, but a child; and now, inasmuch as you are a beloved child, you are bound to obey your Father’s faintest wish, the least intimation of his will. Does he bid you fulfil a sacred ordinance? It is at your peril that you neglect it, for you will be disobeying your Father. Does he command you to seek the image of Jesus? Is it not your joy to do so? Does Jesus tell you, “Be ye perfect, even as your Father which is in heaven is perfect”? Then not because the law commands, but because your Saviour enjoins, you will labour to be perfect in holiness. Does he bid his saints love one another? Do it, not because the law says, “Love thy neighbour,” but because Jesus says, “If ye love me, keep my commandments;” and this is the commandment that he has given unto you, “that ye love one another.” Are you told to distribute to the poor? Do it, not because charity is a burden which you dare not shirk, but because Jesus teaches, “Give to him that asketh of thee.” Does the Word say, “Love God with all your heart”? Look at the commandment and reply, “Ah! commandment, Christ hath fulfilled thee already—I have no need, therefore, to fulfil thee for my salvation, but I rejoice to yield obedience to thee because God is my Father now and he has a claim upon me, which I would not dispute.” May the Holy Ghost make your heart obedient to the constraining power of Christ’s love, that your prayer may be, “Make me to go in the path of thy commandments; for therein do I delight.” Grace is the mother and nurse of holiness, and not the apologist of sin."]}