{"verses":[{"passage":"Thy love is better than wine.","reference":{"book":"Song of Solomon","chapter":"1","verse":"2"}}],"reading":["<i>Nothing gives the believer so much joy as fellowship with Christ</i>. He has enjoyment as others have in the common mercies of life, he can be glad both in God’s gifts and God’s works; but in all these separately, yea, and in all of them added together, he doth not find such substantial delight as in the matchless person of his Lord Jesus. He has wine which no vineyard on earth ever yielded; he has bread which all the corn-fields of Egypt could never bring forth. Where can such sweetness be found as we have tasted in communion with our Beloved? In our esteem, the joys of earth are little better than husks for swine compared with Jesus, the heavenly manna. We would rather have one mouthful of Christ’s love, and a sip of his fellowship, than a whole world full of carnal delights. What is the chaff to the wheat? What is the sparkling paste to the true diamond? What is a dream to the glorious reality? What is time’s mirth, in its best trim, compared to our Lord Jesus in his most despised estate? If you know anything of the inner life, you will confess that our highest, purest, and most enduring joys must be the fruit of the tree of life which is in the midst of the Paradise of God. No spring yields such sweet water as that well of God which was digged with the soldier’s spear. All earthly bliss is of the earth earthy, but the comforts of Christ’s presence are like himself, heavenly. We can review our communion with Jesus, and find no regrets of emptiness therein; there are no dregs in this wine, no dead flies in this ointment. The joy of the Lord is solid and enduring. Vanity hath not looked upon it, but discretion and prudence testify that it abideth the test of years, and is in time and in eternity worthy to be called “the only true delight.” For nourishment, consolation, exhilaration, and refreshment, no wine can rival the love of Jesus. Let us drink to the full this evening."]}