{"verses":[{"passage":"Your heavenly Father.","reference":{"book":"Matthew","chapter":"6","verse":"26"}}],"reading":["God’s people are doubly his children, they are his offspring by creation, and they are his sons by adoption in Christ. Hence they are privileged to call him, “Our Father which art in heaven.” Father! Oh, what precious word is that. Here is <i>authority</i>: “If I be a Father, where is mine honour?” If ye be sons, where is your obedience? Here is <i>affection</i> mingled with authority; an authority which does not provoke rebellion; an obedience demanded which is most cheerfully rendered—which would not be withheld even if it might. The obedience which God’s children yield to him must be <i>loving</i> obedience. Do not go about the service of God as slaves to their taskmaster’s toil, but run in the way of his commands because it is your <i>Father's</i> way. Yield your bodies as instruments of righteousness, because righteousness is your Father’s will, and <i>his</i> will should be the will of his child. <i>Father</i>!—Here is a kingly attribute so sweetly veiled in love, that the King’s crown is forgotten in the King’s face, and his sceptre becomes, not a rod of iron, but a silver sceptre of mercy—the sceptre indeed seems to be forgotten in the tender hand of him who wields it. Father!—Here is honour and love. How great is a Father’s love to his children! That which friendship cannot do, and mere benevolence will not attempt, a father’s heart and hand must do for his sons. They are his offspring, he must bless them; they are his children, he must show himself strong in their defence. If an earthly father watches over his children with unceasing love and care, how much more does our heavenly Father? Abba, Father! He who can say this, hath uttered better music than cherubim or seraphim can reach. There is heaven in the depth of that word—Father! There is all I can ask; all my necessities can demand; all my wishes can desire. I have all in all to all eternity when I can say, “Father.”"]}