{"verses":[{"passage":"We will be glad and rejoice in thee.","reference":{"book":"Song of Solomon","chapter":"1","verse":"4"}}],"reading":["We will be glad and rejoice in thee. We will not open the gates of the year to the dolorous notes of the sackbut, but to the sweet strains of the harp of joy, and the high sounding cymbals of gladness. “O come, let us sing unto the Lord: let us make a joyful noise unto the rock of our salvation.” We, the called and faithful and chosen, we will drive away our griefs, and set up our banners of confidence in the name of God. Let others lament over their troubles, we who have the sweetening tree to cast into Marah’s bitter pool, with joy will magnify the Lord. Eternal Spirit, our effectual Comforter, we who are the temples in which thou dwellest, will never cease from adoring and blessing the name of Jesus. <i>We </i><span style=\"font-variant:small-caps\" id=\"d0101pm-p3.1\">will</span>, we are resolved about it, Jesus must have the crown of our heart’s delight; we will not dishonour our Bridegroom by mourning in his presence. We are ordained to be the minstrels of the skies, let us rehearse our everlasting anthem before we sing it in the halls of the New Jerusalem. <i>We will </i><span style=\"font-variant:small-caps\" id=\"d0101pm-p3.2\">be glad and rejoice</span>: two words with one sense, double joy, blessedness upon blessedness. Need there be any limit to our rejoicing in the Lord even now? Do not men of grace find their Lord to be camphire and spikenard, calamus and cinnamon even now, and what better fragrance have they in heaven itself? <i>We will be glad and rejoice </i><span style=\"font-variant:small-caps\" id=\"d0101pm-p3.3\">in Thee</span>. That last word is the meat in the dish, the kernel of the nut, the soul of the text. What heavens are laid up in Jesus! What rivers of infinite bliss have their source, aye, and every drop of their fulness in him! Since, O sweet Lord Jesus, thou art the present portion of thy people, favour us this year with such a sense of thy preciousness, that from its first to its last day we may be glad and rejoice in thee. Let January open with joy in the Lord, and December close with gladness in Jesus."]}