{"verses":[{"passage":"Beginning to sink, he cried, saying, Lord, save me.","reference":{"book":"Matthew","chapter":"14","verse":"30"}}],"reading":["<i>Sinking times are praying times</i> with the Lord’s servants. Peter neglected prayer at starting upon his venturous journey, but when he began to sink his danger made him a suppliant, and his cry though late was not too late. In our hours of bodily pain and mental anguish, we find ourselves as naturally driven to prayer as the wreck is driven upon the shore by the waves. The fox hies to its hole for protection; the bird flies to the wood for shelter; and even so the tried believer hastens to the mercy seat for safety. Heaven’s great harbour of refuge is All-prayer; thousands of weather-beaten vessels have found a haven there, and the moment a storm comes on, it is wise for us to make for it with all sail.","<i>Short prayers are long enough</i>. There were but three words in the petition which Peter gasped out, but they were sufficient for his purpose. Not length but strength is desirable. A sense of need is a mighty teacher of brevity. If our prayers had less of the tail feathers of pride and more wing they would be all the better. Verbiage is to devotion as chaff to the wheat. Precious things lie in small compass, and all that is real prayer in many a long address might have been uttered in a petition as short as that of Peter.","<i>Our extremities are the Lord’s opportunities</i>. Immediately a keen sense of danger forces an anxious cry from us the ear of Jesus hears, and with him ear and heart go together, and the hand does not long linger. At the last moment we appeal to our Master, but his swift hand makes up for our delays by instant and effectual action. Are we nearly engulfed by the boisterous waters of affliction? Let us then lift up our souls unto our Saviour, and we may rest assured that he will not suffer us to perish. When we can do nothing Jesus can do all things; let us enlist his powerful aid upon our side, and all will be well."]}