{"verses":[{"passage":"And it came to pass in an eveningtide, that David arose from off his bed, and walked upon the roof of the king’s house.","reference":{"book":"2 Samuel","chapter":"11","verse":"2"}}],"reading":["At that hour David saw Bathsheba. We are never out of the reach of temptation. Both at home and abroad we are liable to meet with allurements to evil; the morning opens with peril, and the shades of evening find us still in jeopardy. They are well kept whom God keeps, but woe unto those who go forth into the world, or even dare to walk their own house unarmed. Those who think themselves secure are more exposed to danger than any others. The armour-bearer of Sin is Self-confidence.","David should have been engaged in fighting the Lord’s battles, instead of which he tarried at Jerusalem, and gave himself up to luxurious repose, for he arose from his bed at eventide. Idleness and luxury are the devil’s jackals, and find him abundant prey. In stagnant waters noxious creatures swarm, and neglected soil soon yields a dense tangle of weeds and briars. Oh for the constraining love of Jesus to keep us active and useful! When I see the King of Israel sluggishly leaving his couch at the close of the day, and falling at once into temptation, let me take warning, and set holy watchfulness to guard the door.","Is it possible that the king had mounted his housetop for retirement and devotion? If so, what a caution is given us to count no place, however secret, a sanctuary from sin! While our hearts are so like a tinder-box, and sparks so plentiful, we had need use all diligence in all places to prevent a blaze. Satan can climb housetops, and enter closets, and even if we could shut out that foul fiend, our own corruptions are enough to work our ruin unless grace prevent. Reader, beware of evening temptations. Be not secure. The sun is down but sin is up. We need a watchman for the night as well as a guardian for the day. O blessed Spirit, keep us from all evil this night. Amen."]}