{"verses":[{"passage":"All they that heard it wondered at those things.","reference":{"book":"Luke","chapter":"2","verse":"18"}}],"reading":["We must not cease to wonder at the great marvels of our God. It would be very difficult to draw a line between holy wonder and <i>real worship</i>; for when the soul is overwhelmed with the majesty of God’s glory, though it may not express itself in song, or even utter its voice with bowed head in humble prayer, yet it silently adores. Our incarnate God is to be worshipped as “the Wonderful.” That God should consider his fallen creature, man, and instead of sweeping him away with the besom of destruction, should himself undertake to be man’s Redeemer, and to pay his ransom price, is, indeed marvellous! But to each believer redemption is most marvellous as he views it in relation to himself. It is a miracle of grace indeed, that Jesus should forsake the thrones and royalties above, to suffer ignominiously below <i>for you</i>. Let your soul lose itself in wonder, for wonder is in this way a very practical emotion. Holy wonder will lead you to <i>grateful worship</i> and <i>heartfelt thanksgiving</i>. It will cause within you <i>godly </i><i>watchfulness</i>; you will be afraid to sin against such a love as this. Feeling the presence of the mighty God in the gift of his dear Son, you will put off your shoes from off your feet, because the place whereon you stand is holy ground. You will be moved at the same time to <i>glorious hope</i>. If Jesus has done such marvellous things on your behalf, you will feel that heaven itself is not too great for your expectation. Who can be astonished at anything, when he has once been astonished at the manger and the cross? What is there wonderful left after one has seen the Saviour? Dear reader, it may be that from the quietness and solitariness of your life, you are scarcely able to imitate the shepherds of Bethlehem, who told what they had seen and heard, but you can, at least, fill up the circle of the worshippers before the throne, by wondering at what God has done."]}