{"verses":[{"passage":"The iniquity of the holy things.","reference":{"book":"Exodus","chapter":"28","verse":"38"}}],"reading":["What a veil is lifted up by these words, and what a disclosure is made! It will be humbling and profitable for us to pause awhile and see this sad sight. The iniquities of our public worship, its hypocrisy, formality, lukewarmness, irreverence, wandering of heart and forgetfulness of God, what a full measure have we there! Our work for the Lord, its emulation, selfishness, carelessness, slackness, unbelief, what a mass of defilement is there! Our private devotions, their laxity, coldness, neglect, sleepiness, and vanity, what a mountain of dead earth is there! If we looked more carefully we should find this iniquity to be far greater than appears at first sight. Dr. Payson, writing to his brother, says, “My parish, as well as my heart, very much resembles the garden of the sluggard; and what is worse, I find that very many of my desires for the melioration of both, proceed either from pride or vanity or indolence. I look at the weeds which overspread my garden, and breathe out an earnest wish that they were eradicated. But why? What prompts the wish? It may be that I may walk out and say to myself, ‘In what fine order is my garden kept!’ This is <i>pride</i>. Or, it may be that my neighbours may look over the wall and say, ‘How finely your garden flourishes!’ This is <i>vanity</i>. Or I may wish for the destruction of the weeds, because I am weary of pulling them up. This is indolence.” So that even our desires after holiness may be polluted by ill motives. Under the greenest sods worms hide themselves; we need not look long to discover them. How cheering is the thought, that when the High Priest bore the iniquity of the holy things he wore upon his brow the words, “<span style=\"font-variant:small-caps\" id=\"d0108am-p3.1\">Holiness to the Lord</span>:” and even so while Jesus bears our sin, he presents before his Father’s face not our unholiness, but his own holiness. O for grace to view our great High Priest by the eye of faith!"]}