{"verses":[{"passage":"Grow in grace, and in the knowledge of our Lord and Saviour Jesus Christ.","reference":{"book":"2 Peter","chapter":"3","verse":"18"}}],"reading":["“Grow in grace”—not in one grace only, but in <i>all</i> grace. Grow in that root-grace, <i>faith</i>. Believe the promises more firmly than you have done. Let faith increase in fulness, constancy, simplicity. Grow also in <i>love</i>. Ask that your love may become extended, more intense, more practical, influencing every thought, word, and deed. Grow likewise in <i>humility</i>. Seek to lie very low, and know more of your own nothingness. As you grow <i>downward</i> in humility, seek also to grow <i>upward</i>—having nearer approaches to God in prayer and more intimate fellowship with Jesus. May God the Holy Spirit enable you to “<i>grow in the knowledge of our Lord and Saviour</i>.” He who grows not in the knowledge of Jesus, refuses to be blessed. To know him is “life eternal,” and to advance in the knowledge of him is to increase in happiness. He who does not long to know more of Christ, knows nothing of him yet. Whoever hath sipped this wine will thirst for more, for although Christ doth satisfy, yet it is such a satisfaction, that the appetite is not cloyed, but whetted. If you know the love of Jesus—as the hart panteth for the water-brooks, so will you pant after deeper draughts of his love. If you do not desire to know him better, then you love him not, for love always cries, “Nearer, nearer.” Absence from Christ is hell; but the presence of Jesus is heaven. Rest not then content without an increasing acquaintance with Jesus. Seek to know more of him in his divine nature, in his human relationship, in his finished work, in his death, in his resurrection, in his present glorious intercession, and in his future royal advent. Abide hard by the Cross, and search the mystery of his wounds. An increase of love to Jesus, and a more perfect apprehension of his love to us is one of the best tests of growth in grace."]}