{"verses":[{"passage":"My sister, my spouse.","reference":{"book":"Song of Solomon","chapter":"4","verse":"12"}}],"reading":["Observe the sweet titles with which the heavenly Solomon with intense affection addresses his bride the church. “<i>My </i><i>sister</i>, one near to me by ties of nature, partaker of the same sympathies. <i>My spouse</i>, nearest and dearest, united to me by the tenderest bands of love; my sweet companion, part of my own self. <i>My sister</i>, by my Incarnation, which makes me bone of thy bone and flesh of thy flesh; <i>my spouse</i>, by heavenly betrothal, in which I have espoused thee unto myself in righteousness. <i>My sister</i>, whom I knew of old, and over whom I watched from her earliest infancy; <i>my spouse</i>, taken from among the daughters, embraced by arms of love, and affianced unto me forever. See how true it is that our royal Kinsman is not ashamed of us, for he dwells with manifest delight upon this two-fold relationship. We have the word “my” twice in our version; as if Christ dwelt with rapture on his possession of his Church. “His delights were with the sons of men,” because those sons of men were his own chosen ones. He, the Shepherd, sought the sheep, because they were <i>his</i> sheep; he has gone about “to seek and to save that which was lost,” because that which was lost was <i>his</i> long before it was lost to itself or lost to him. The church is the exclusive portion of her Lord; none else may claim a partnership, or pretend to share her love. Jesus, thy church delights to have it so! Let every believing soul drink solace out of these wells. Soul! Christ is near to thee in ties of relationship; Christ is dear to thee in bonds of marriage union, and thou art dear to him; behold he grasps both of thy hands with both his own, saying, “<i>My</i> sister, <i>my</i> spouse.” Mark the two sacred holdfasts by which thy Lord gets such a double hold of thee that he neither can nor will ever let thee go. Be not, O beloved, slow to return the hallowed flame of his love."]}