{"verses":[{"passage":"The voice of one crying in the wilderness, Prepare ye the way of the Lord, make his paths straight.","reference":{"book":"Luke","chapter":"3","verse":"4"}}],"reading":["The voice crying in the wilderness demanded <i>a way for the </i><i>Lord, a way prepared, and a way prepared in the wilderness</i>. I would be attentive to the Master’s proclamation, and give him a road into my heart, cast up by gracious operations, through the desert of my nature. The four directions in the text must have my serious attention.","<i>Every valley must be exalted</i>. Low and grovelling thoughts of God must be given up; doubting and despairing must be removed; and self-seeking and carnal delights must be forsaken. Across these deep valleys a glorious causeway of grace must be raised.","<i>Every mountain and hill shall be laid low</i>. Proud creature-sufficiency, and boastful self-righteousness, must be levelled, to make a highway for the King of kings. Divine fellowship is never vouchsafed to haughty, highminded sinners. The Lord hath respect unto the lowly, and visits the contrite in heart, but the lofty are an abomination unto him. My soul, beseech the Holy Spirit to set thee right in this respect.","<i>The crooked shall be made straight</i>. The wavering heart must have a straight path of decision for God and holiness marked out for it. Double-minded men are strangers to the God of truth. My soul, take heed that thou be in all things honest and true, as in the sight of the heart-searching God.","<i>The rough places shall be made smooth</i>. Stumbling-blocks of sin must be removed, and thorns and briers of rebellion must be uprooted. So great a visitor must not find miry ways and stony places when he comes to honour his favoured ones with his company. Oh that this evening the Lord may find in my heart a highway made ready by his grace, that he may make a triumphal progress through the utmost bounds of my soul, from the beginning of this year even to the end of it."]}