{"verses":[{"passage":"I will give thee for a covenant of the people.","reference":{"book":"Isaiah","chapter":"49","verse":"8"}}],"reading":["Jesus Christ is himself the sum and substance of the covenant, and as one of its gifts. He is the property of every believer. Believer, canst thou estimate what thou hast gotten in Christ? “In him dwelleth all the fulness of the Godhead bodily.” Consider that word “God” and its infinity, and then meditate upon “perfect man” and all his beauty; for all that Christ, as God and man, ever had, or can have, is thine—out of pure free favour, passed over to thee to be thine entailed property forever. Our blessed Jesus, as God, is omniscient, omnipresent, omnipotent. Will it not console you to know that all these great and glorious attributes are altogether yours? Has he power? That power is yours to support and strengthen you, to overcome your enemies, and to preserve you even to the end. Has he love? Well, there is not a drop of love in his heart which is not yours; you may dive into the immense ocean of his love, and you may say of it all, “It is mine.” Hath he justice? It may seem a stern attribute, but even that is yours, for he will by his justice see to it that all which is promised to you in the covenant of grace shall be most certainly secured to you. And all that he has as <i>perfect man</i> is yours. As a perfect man the Father’s delight was upon him. He stood accepted by the Most High. O believer, God’s acceptance of Christ is thine acceptance; for knowest thou not that the love which the Father set on a perfect Christ, he sets on thee <i>now</i>? For all that Christ did is thine. That perfect righteousness which Jesus wrought out, when through his stainless life he kept the law and made it honourable, is thine, and is imputed to thee. Christ is in the covenant.","“My God, I am thine—what a comfort divine!","What a blessing to know that the Saviour is mine!","In the heavenly Lamb thrice happy I am,","And my heart it doth dance at the sound of his name.”"]}