{"verses":[{"passage":"In whom also we have obtained an inheritance.","reference":{"book":"Ephesians","chapter":"1","verse":"11"}}],"reading":["When Jesus gave himself for us, he gave us all the rights and privileges which went with himself; so that now, although as eternal God, he has essential rights to which no creature may venture to pretend, yet as Jesus, the Mediator, the federal head of the covenant of grace, he has no heritage apart from us. All the glorious consequences of his obedience unto death are the joint riches of all who are in him, and on whose behalf he accomplished the divine will. See, he enters into glory, but not for himself alone, for it is written, “Whither the Forerunner is <i>for us</i> entered.” <a class=\"scripRef\" id=\"d0130pm-p3.1\" href=\"/ccel/bible/asv.Heb.6.html#Heb.6.20\" onclick=\"return goBible('nt','Heb','6','20','6','20');\" onmouseover=\"popupVerse(this, 'Heb 6:20 - 6:20')\" onmouseout=\"leaveVerse()\" name=\"_Heb_6_20_0_0\">Heb. 6:20</a>. Does he stand in the presence of God?—“He appears in the presence of God <i>for us</i>.” <a class=\"scripRef\" id=\"d0130pm-p3.2\" href=\"/ccel/bible/asv.Heb.9.html#Heb.9.24\" onclick=\"return goBible('nt','Heb','9','24','9','24');\" onmouseover=\"popupVerse(this, 'Heb 9:24 - 9:24')\" onmouseout=\"leaveVerse()\" name=\"_Heb_9_24_0_0\">Heb. 9:24</a>. Consider this, believer. You have no right to heaven in yourself: your right lies in Christ. If you are pardoned, it is through <i>his</i> blood; if you are justified, it is through <i>his</i> righteousness; if you are sanctified, it is because <i>he</i> is made of God unto you sanctification; if you shall be kept from falling, it will be because you are preserved in Christ Jesus; and if you are perfected at the last, it will be because you are complete in <i>him</i>. Thus Jesus is magnified—for all is in him and by him; thus the inheritance is made certain to us—for it is obtained in him; thus each blessing is the sweeter, and even heaven itself the brighter, because it is Jesus our Beloved “in whom” we have obtained all. Where is the man who shall estimate our divine portion? Weigh the riches of Christ in scales, and his treasure in balances, and then think to count the treasures which belong to the saints. Reach the bottom of Christ’s sea of joy, and then hope to understand the bliss which God hath prepared for them that love him. Overleap the boundaries of Christ’s possessions, and then dream of a limit to the fair inheritance of the elect. “All things are yours, for ye are Christ’s and Christ is God's.”"]}