{"verses":[{"passage":"And the shepherds returned, glorifying and praising God for all the things that they had heard and seen, as it was told unto them.","reference":{"book":"Luke","chapter":"2","verse":"20"}}],"reading":["What was the subject of their praise? They <i>praised God for </i><i>what they had heard</i>—for the good tidings of great joy that a Saviour was born unto them. Let us copy them; let us also raise a song of thanksgiving that we have heard of Jesus and his salvation. They also <i>praised God for what they had seen</i>. There is the sweetest music—what we have experienced, what we have felt within, what we have made our own—“the things which we have made touching the King.” It is not enough to <i>hear</i> about Jesus: mere hearing may tune the harp, but the fingers of living faith must create the music. If you have seen Jesus with the God-giving sight of faith, suffer no cobwebs to linger among the harp strings, but loud to the praise of sovereign grace, awake your psaltery and harp. One point for which they praised God was <i>the agreement between what they had heard and what </i><i>they had seen</i>. Observe the last sentence—“As it was told unto them.” Have you not found the gospel to be in yourselves just what the Bible said it would be? Jesus said he would give you rest—have you not enjoyed the sweetest peace in him? He said you should have joy, and comfort, and life through believing in him—have you not received all these? Are not his ways ways of pleasantness, and his paths paths of peace? Surely you can say with the queen of Sheba, “The half has not been told me.” I have found Christ more sweet than his servants ever said he was. I looked upon his likeness as they painted it, but it was a mere daub compared with himself; for the King in his beauty outshines all imaginable loveliness. Surely what we have “<i>seen</i>” keeps pace with, nay, far exceeds, what we have “<i>heard</i>.” Let us, then, glorify and praise God for a Saviour so precious, and so satisfying."]}