{"verses":[{"passage":"In my flesh shall I see God.","reference":{"book":"Job","chapter":"19","verse":"26"}}],"reading":["Mark the subject of Job’s devout anticipation “I shall see God.” He does not say, “I shall see the saints”—though doubtless that will be untold felicity—but, “I shall see God.” It is not—“I shall see the pearly gates, I shall behold the walls of jasper, I shall gaze upon the crowns of gold,” but “I shall see God.” This is the sum and substance of heaven, this is the joyful hope of all believers. It is their delight to see him now in the ordinances by faith. They love to behold him in communion and in prayer; but there in heaven they shall have an open and unclouded vision, and thus seeing “him as he is,” shall be made completely like him. <i>Likeness to God</i>—what can we wish for more? And <i>a sight of God</i>—what can we desire better? Some read the passage, “Yet, I shall see God in my flesh,” and find here an allusion to Christ, as the “Word made flesh,” and that glorious beholding of him which shall be the splendour of the latter days. Whether so or not it is certain that Christ shall be the object of our eternal vision; nor shall we ever want any joy beyond that of seeing him. Think not that this will be a narrow sphere for the mind to dwell in. It is but one source of delight, but that source is infinite. All his attributes shall be subjects for contemplation, and as he is infinite under each aspect, there is no fear of exhaustion. His works, his gifts, his love to us, and his glory in all his purposes, and in all his actions, these shall make a theme which will be ever new. The patriarch looked forward to this sight of God as <i>a personal</i> enjoyment. “Whom mine eye shall behold, and not another.” Take realizing views of heaven’s bliss; think what it will be <i>to you</i>. “<i>Thine eyes</i> shall see the King in his beauty.” All earthly brightness fades and darkens as we gaze upon it, but here is a brightness which can never dim, a glory which can never fade—“<i>I shall see God</i>.”"]}