{"verses":[{"passage":"Exceeding great and precious promises.","reference":{"book":"2 Peter","chapter":"1","verse":"4"}}],"reading":["If you would know experimentally the preciousness of the promises, and enjoy them in your own heart, <i>meditate much upon </i><i>them</i>. There are promises which are like grapes in the wine-press; if you will tread them the juice will flow. Thinking over the hallowed words will often be the prelude to their fulfilment. While you are musing upon them, the boon which you are seeking will insensibly come to you. Many a Christian who has thirsted for the promise has found the favour which it ensured gently distilling into his soul even while he has been considering the divine record; and he has rejoiced that ever he was led to lay the promise near his heart.","But besides <i>meditating</i> upon the promises, <i>seek in thy </i><i>soul to receive them as being the very words of God</i>. Speak to thy soul thus, “If I were dealing with a man’s promise, I should carefully consider the ability and the character of the man who had covenanted with me. So with the promise of God; my eye must not be so much fixed upon the greatness of the mercy—that may stagger me; as upon the greatness of the promiser—that will cheer me. My soul, it is God, even thy God, God that cannot lie, who speaks to thee. This word of his which thou art now considering is as true as his own existence. He is a God unchangeable. He has not altered the thing which has gone out of his mouth, nor called back one single consolatory sentence. Nor doth he lack any power; it is the God that made the heavens and the earth who has spoken thus. Nor can he fail in wisdom as to the time when he will bestow the favours, for he knoweth when it is best to give and when better to withhold. Therefore, seeing that it is the word of a God so true, so immutable, so powerful, so wise, I will and must believe the promise.” If we thus meditate upon the promises, and consider the Promiser, we shall experience their sweetness, and obtain their fulfilment."]}