{"verses":[{"passage":"Lead me in thy truth, and teach me: for thou art the God of my salvation; on thee do I wait all the day.","reference":{"book":"Psalm","chapter":"25","verse":"5"}}],"reading":["When the believer has begun with trembling feet to walk in the way of the Lord, he asks to be still led onward like a little child upheld by its parent’s helping hand, and he craves to be further instructed in the alphabet of truth. Experimental teaching is the burden of this prayer. David knew much, but he felt his ignorance, and desired to be still in the Lord’s school: four times over in two verses he applies for a scholarship in the college of grace. It were well for many professors if instead of following their own devices, and cutting out new paths of thought for themselves, they would enquire for the good old ways of God’s own truth, and beseech the Holy Ghost to give them sanctified understandings and teachable spirits. “<i>For thou art the God of my salvation</i>.” The Three-One Jehovah is the Author and Perfecter of salvation to his people. Reader, is he the God of <i>your</i> salvation? Do you find in the Father’s election, in the Son’s atonement, and in the Spirit’s quickening, all the grounds of your eternal hopes? If so, you may use this as an argument for obtaining further blessings; if the Lord has ordained to save you, surely he will not refuse to instruct you in his ways. It is a happy thing when we can address the Lord with the confidence which David here manifests, it gives us great power in prayer, and comfort in trial. “<i>On thee do I wait all the day</i>.” Patience is the fair handmaid and daughter of faith; we cheerfully wait when we are certain that we shall not wait in vain. It is our duty and our privilege to wait upon the Lord in service, in worship, in expectancy, in trust all the days of our life. Our faith will be tried faith, and if it be of the true kind, it will bear continued trial without yielding. We shall not grow weary of waiting upon God if we remember how long and how graciously he once waited for us."]}