{"verses":[{"passage":"He that hath clean hands, and a pure heart; who hath not lifted up his soul unto vanity, nor sworn deceitfully.","reference":{"book":"Psalm","chapter":"24","verse":"4"}}],"reading":["Outward practical holiness is a very precious mark of grace. It is to be feared that many professors have perverted the doctrine of justification by faith in such a way as to treat good works with contempt; if so, they will receive everlasting contempt at the last great day. If our hands are not clean, let us wash them in Jesus’ precious blood, and so let us lift up pure hands unto God. But “<i>clean hands</i>” will not suffice, unless they are connected with “<i>a pure heart</i>.” True religion is heart-work. We may wash the outside of the cup and the platter as long as we please, but if the inward parts be filthy, we are filthy altogether in the sight of God, for our hearts are more truly ourselves than our hands are; the very life of our being lies in the inner nature, and hence the imperative need of purity within. The pure in heart shall see God, all others are but blind bats.","The man who is born for heaven “<i>hath not lifted up his soul </i><i>unto vanity</i>.” All men have their joys, by which their souls are lifted up; the worldling lifts up his soul in carnal delights, which are mere empty vanities; but the saint loves more substantial things; like Jehoshaphat, he is lifted up in the ways of the Lord. He who is content with husks, will be reckoned with the swine. Does the world satisfy thee? Then thou hast thy reward and portion in this life; make much of it, for thou shalt know no other joy.","“<i>Nor sworn deceitfully</i>.” The saints are men of honour still. The Christian man’s word is his only oath; but that is as good as twenty oaths of other men. False speaking will shut any man out of heaven, for a liar shall not enter into God’s house, whatever may be his professions or doings. Reader, does the text before us condemn thee, or dost thou hope to ascend into the hill of the Lord?"]}