{"verses":[{"passage":"Neither shall one thrust another; they shall walk every one in his path.","reference":{"book":"Joel","chapter":"2","verse":"8"}}],"reading":["Locusts always keep their rank, and although their number is legion, they do not crowd upon each other, so as to throw their columns into confusion. This remarkable fact in natural history shows how thoroughly the Lord has infused the spirit of order into his universe, since the smallest animate creatures are as much controlled by it as are the rolling spheres or the seraphic messengers. It would be wise for believers to be ruled by the same influence in all their spiritual life. <i>In their Christian </i><i>graces</i> no one virtue should usurp the sphere of another, or eat out the vitals of the rest for its own support. Affection must not smother honesty, courage must not elbow weakness out of the field, modesty must not jostle energy, and patience must not slaughter resolution. So also with <i>our duties</i>, one must not interfere with another; public usefulness must not injure private piety; church work must not push family worship into a corner. It is ill to offer God one duty stained with the blood of another. Each thing is beautiful in its season, but not otherwise. It was to the Pharisee that Jesus said, “This ought ye to have done, and not to have left the other undone.” The same rule applies to <i>our personal position</i>, we must take care to know our place, take it, and keep to it. We must minister as the Spirit has given us ability, and not intrude upon our fellow servant’s domain. Our Lord Jesus taught us not to covet the high places, but to be willing to be the least among the brethren. Far from us be an envious, ambitious spirit, let us feel the force of the Master’s command, and do as he bids us, keeping rank with the rest of the host. To-night let us see whether we are keeping the unity of the Spirit in the bonds of peace, and let our prayer be that, in all the churches of the Lord Jesus, peace and order may prevail."]}