{"verses":[{"passage":"Who went about doing good.","reference":{"book":"Acts","chapter":"10","verse":"38"}}],"reading":["Few words, but yet an exquisite miniature of the Lord Jesus Christ. There are not many touches, but they are the strokes of a master’s pencil. Of the Saviour and only of the Saviour is it true in the fullest, broadest, and most unqualified sense. “He went about doing good.” From this description it is evident that he did good <i>personally</i>. The evangelists constantly tell us that he touched the leper with his own finger, that he anointed the eyes of the blind, and that in cases where he was asked to speak the word only at a distance, he did not usually comply, but went himself to the sick bed, and there personally wrought the cure. A lesson to us, if we would do good, to do it ourselves. Give alms with your own hand; a kind look, or word, will enhance the value of the gift. Speak to a friend about his soul; your loving appeal will have more influence than a whole library of tracts. Our Lord’s mode of doing good sets forth his <i>incessant activity</i>! He did not only the good which came close to hand, but he “went about” on his errands of mercy. Throughout the whole land of Judea there was scarcely a village or a hamlet which was not gladdened by the sight of him. How this reproves the creeping, loitering manner, in which many professors serve the Lord. Let us gird up the loins of our mind, and be not weary in well doing. Does not the text imply that Jesus Christ <i>went </i><i>out of his way to do good</i>? “He went <i>about</i> doing good.” He was never deterred by danger or difficulty. He sought out the objects of his gracious intentions. So must we. If old plans will not answer, we must try new ones, for fresh experiments sometimes achieve more than regular methods. Christ’s <i>perseverance</i>, and the <i>unity</i> of his purpose, are also hinted at, and the practical application of the subject may be summed up in the words, “He hath left us an example that we should follow in his steps.”"]}