{"verses":[{"passage":"That he may set him with princes.","reference":{"book":"Psalm","chapter":"113","verse":"8"}}],"reading":["Our spiritual privileges are of the highest order. “Among princes” <i>is the place of select society</i>. “Truly our fellowship is with the Father, and with his Son Jesus Christ.” Speak of select society, there is none like this! “We are a chosen generation, a peculiar people, a royal priesthood.” “We are come unto the general assembly and church of the first-born, whose names are written in heaven.” The saints <i>have courtly </i><i>audience</i>: princes have admittance to royalty when common people must stand afar off. The child of God has free access to the inner courts of heaven. “For through him we both have access by one Spirit unto the Father.” “Let us come boldly,” says the apostle, “<i>to the throne</i> of the heavenly grace.” Among princes there is <i>abundant wealth</i>, but what is the abundance of princes compared with the riches of believers? for “all things are yours, and ye are Christ's, and Christ is God's.” “He that spared not his own Son, but delivered him up for us all, how shall he not with him also freely give us all things?” Princes have <i>peculiar power</i>. A prince of heaven’s empire has great influence: he wields a sceptre in his own domain; he sits upon Jesus’ throne, for “He hath made us kings and priests unto God, and we shall reign forever and ever.” We reign over the united kingdom of time and eternity. Princes, again, have <i>special </i><i>honour</i>. We may look down upon all earth-born dignity from the eminence upon which grace has placed us. For what is human grandeur to this, “He hath raised us up together, and made us sit together in heavenly places in Christ Jesus”? We share the honour of Christ, and compared with this, earthly splendours are not worth a thought. Communion with Jesus is a richer gem than ever glittered in imperial diadem. Union with the Lord is a coronet of beauty outshining all the blaze of imperial pomp."]}