{"verses":[{"passage":"A bruised reed shall he not break, and smoking flax shall he not quench.","reference":{"book":"Matthew","chapter":"12","verse":"20"}}],"reading":["What is weaker than the bruised reed or the smoking flax? <i>A </i><i>reed</i> that groweth in the fen or marsh, let but the wild duck light upon it, and it snaps; let but the foot of man brush against it, and it is bruised and broken; every wind that flits across the river moves it to and fro. You can conceive of nothing more frail or brittle, or whose existence is more in jeopardy, than a bruised reed. Then look at the smoking flax—what is it? It has a spark within it, it is true, but it is almost smothered; an infant’s breath might blow it out; nothing has a more precarious existence than its flame. <i>Weak things</i> are here described, yet Jesus says of them, “The smoking flax I will not quench; the bruised reed I will not break.” Some of God’s children are made strong to do mighty works for him; God has his Samsons here and there who can pull up Gaza’s gates, and carry them to the top of the hill; he has a few mighties who are lion-like men, but the majority of his people are a timid, trembling race. They are like starlings, frightened at every passer by; a little fearful flock. If temptation comes, they are taken like birds in a snare; if trial threatens, they are ready to faint; their frail skiff is tossed up and down by every wave, they are drifted along like a sea bird on the crest of the billows—weak things, without strength, without wisdom, without foresight. Yet, weak as they are, and <i>because</i> they are so weak, they have this promise made specially to them. Herein is grace and graciousness! Herein is love and lovingkindness! How it opens to us the compassion of Jesus—so gentle, tender, considerate! We need never shrink back from <i>his</i> touch. We need never fear a harsh word from <i>him</i>; though he might well chide us for our weakness, he rebuketh not. Bruised reeds shall have no blows from him, and the smoking flax no damping frowns."]}