{"verses":[{"passage":"Thou shalt arise, and have mercy upon Zion: for the time to favour her, yea, the set time is come. For thy servants take pleasure in her stones, and favour the dust thereof.","reference":{"book":"Psalm","chapter":"102","verse":"13, 14"}}],"reading":["A selfish man in trouble is exceedingly hard to comfort, because the springs of his comfort lie entirely within himself, and when he is sad all his springs are dry. But a large-hearted man full of Christian philanthropy, has other springs from which to supply himself with comfort beside those which lie within. He can go to his God first of all, and there find abundant help; and he can discover arguments for consolation in things relating to the world at large, to his country, and, above all, to the church. David in this Psalm was exceedingly sorrowful; he wrote, “I am like an owl of the desert. I watch, and am as a sparrow alone upon the house top.” The only way in which he could comfort himself, was in the reflection that God would arise, and have mercy upon Zion: though <i>he</i> was sad, yet Zion should prosper; however low his own estate, yet Zion should arise. Christian man! learn to comfort thyself in God’s gracious dealing towards the church. That which is so dear to thy Master, should it not be dear above all else to thee? What though thy way be dark, canst thou not gladden thine heart with the triumphs of his cross and the spread of his truth? Our own personal troubles are forgotten while we look, not only upon what God <i>has</i> done, and is doing for Zion, but on the glorious things he <i>will yet do</i> for his church. Try this receipt, O believer, whenever thou art sad of heart and in heaviness of spirit: forget thyself and thy little concerns, and seek the welfare and prosperity of Zion. When thou bendest thy knee in prayer to God, limit not thy petition to the narrow circle of thine own life, tried though it be, but send out thy longing prayers for the church’s prosperity, “Pray for the peace of Jerusalem,” and thine own soul shall be refreshed."]}