{"verses":[{"passage":"Tell ye your children of it, and let your children tell their children, and their children another generation.","reference":{"book":"Joel","chapter":"1","verse":"3"}}],"reading":["In this simple way, by God’s grace, a living testimony for truth is always to be kept alive in the land—the beloved of the Lord are to hand down their witness for the gospel, and the covenant to their heirs, and these again to their next descendants. This is our <i>first</i> duty, we are to begin at the family hearth: he is a bad preacher who does not commence his ministry at home. The heathen are to be sought by all means, and the highways and hedges are to be searched, but home has a prior claim, and woe unto those who reverse the order of the Lord’s arrangements. To teach our children is a <i>personal</i> duty; we cannot delegate it to Sunday school teachers, or other friendly aids; these can assist us, but cannot deliver us from the sacred obligation; proxies and sponsors are wicked devices in this case: mothers and fathers must, like Abraham, command their households in the fear of God, and talk with their offspring concerning the wondrous works of the Most High. Parental teaching is a <i>natural</i> duty—who so fit to look to the child’s well-being as those who are the authors of his actual being? To neglect the instruction of our offspring is worse than brutish. Family religion is <i>necessary</i> for the nation, for the family itself, and for the church of God. By a thousand plots Popery is covertly advancing in our land, and one of the most effectual means for resisting its inroads is left almost neglected, namely, the instruction of children in the faith. Would that parents would awaken to a sense of the importance of this matter. It is a pleasant duty to talk of Jesus to our sons and daughters, and the more so because it has often proved to be an <i>accepted</i> work, for God has saved the children through the parents’ prayers and admonitions. May every house into which this volume shall come honour the Lord and receive his smile."]}