{"verses":[{"passage":"Called to be saints.","reference":{"book":"Romans","chapter":"1","verse":"7"}}],"reading":["We are very apt to regard the apostolic saints as if they were “saints” in a more especial manner than the other children of God. All are “saints” whom God has called by His grace, and sanctified by His Spirit; but we are apt to look upon the <i>apostles</i> as extraordinary beings, scarcely subject to the same weaknesses and temptations as ourselves. Yet in so doing we are forgetful of this truth, that the nearer a man lives to God the more intensely has he to mourn over his own evil heart; and the more his Master honours him in his service, the more also doth the evil of the flesh vex and tease him day by day. The fact is, if we had seen the apostle Paul, we should have thought him remarkably like the rest of the chosen family: and if we had talked with him, we should have said, “We find that his experience and ours are much the same. He is more faithful, more holy, and more deeply taught than we are, but he has the selfsame trials to endure. Nay, in some respects he is more sorely tried than ourselves.” Do not, then, look upon the ancient saints as being exempt either from infirmities or sins; and do not regard them with that mystic reverence which will almost make us idolaters. Their holiness is attainable even by us. We are “called to be saints” by that same voice which constrained them to their high vocation. It is a Christian’s duty to force his way into the inner circle of saintship; and if these saints were superior to us in their attainments, as they certainly were, let us follow them; let us emulate their ardour and holiness. We have the same light that they had, the same grace is accessible to us, and why should we rest satisfied until we have equalled them in heavenly character? They lived <i>with</i> Jesus, they lived <i>for</i> Jesus, therefore they grew <i>like</i> Jesus. Let us live by the same Spirit as they did, “looking unto Jesus,” and our saintship will soon be apparent."]}