{"verses":[{"passage":"His camp is very great.","reference":{"book":"Joel","chapter":"2","verse":"11"}}],"reading":["Consider, my soul, the mightiness of the Lord who is thy glory and defence. He is a man of war, Jehovah is his name. All <i>the forces of heaven</i> are at his beck, legions wait at his door, cherubim and seraphim;, watchers and holy ones, principalities and powers, are all attentive to his will. If our eyes were not blinded by the ophthalmia of the flesh, we should see horses of fire and chariots of fire round about the Lord’s beloved. <i>The powers of nature</i> are all subject to the absolute control of the Creator: stormy wind and tempest, lightning and rain, and snow, and hail, and the soft dews and cheering sunshine, come and go at his decree. The bands of Orion he looseth, and bindeth the sweet influences of the Pleiades. Earth, sea, and air, and the places under the earth, are the barracks for Jehovah’s great armies; space is his camping ground, light is his banner, and flame is his sword. When he goeth forth to war, famine ravages the land, pestilence smites the nations, hurricane sweeps the sea, tornado shakes the mountains, and earthquake makes the solid world to tremble. As for <i>animate creatures</i>, they all own his dominion, and from the great fish which swallowed the prophet, down to “all manner of flies,” which plagued the field of Zoan, all are his servants, and like the palmer-worm, the caterpillar, and the cankerworm, are squadrons of his great army, for his camp is very great. My soul, see to it that thou be at peace with this mighty King, yea, more, be sure to enlist under his banner, for to war against him is madness, and to serve him is glory. Jesus, Immanuel, God with us, is ready to receive recruits for the army of the Lord: if I am not already enlisted let me go to him ere I sleep, and beg to be accepted through his merits; and if I be already, as I hope I am, a soldier of the cross, let me be of good courage; for the enemy is powerless compared with my Lord, whose camp is very great."]}