{"verses":[{"passage":"And when he thought thereon, he wept.","reference":{"book":"Mark","chapter":"14","verse":"72"}}],"reading":["It has been thought by some that as long as Peter lived, the fountain of his tears began to flow whenever he remembered his denying his Lord. It is not unlikely that it was so, for his sin was very great, and grace in him had afterwards a perfect work. This same experience is common to all the redeemed family according to the degree in which the Spirit of God has removed the natural heart of stone. We, like Peter, remember <i>our </i><i>boastful promise</i>: “Though all men shall forsake thee, yet will not I.” We eat our own words with the bitter herbs of repentance. When we think of what we vowed we would be, and of what we have been, we may weep whole showers of grief. He thought on <i>his denying his Lord</i>. The place in which he did it, the little cause which led him into such heinous sin, the oaths and blasphemies with which he sought to confirm his falsehood, and the dreadful hardness of heart which drove him to do so again and yet again. Can we, when we are reminded of our sins, and their exceeding sinfulness, remain stolid and stubborn? Will we not make our house a Bochim, and cry unto the Lord for renewed assurances of pardoning love? May we never take a dry-eyed look at sin, lest ere long we have a tongue parched in the flames of hell. Peter also thought upon <i>his Master's </i><i>look of love</i>. The Lord followed up the cock’s warning voice with an admonitory look of sorrow, pity, and love. That glance was never out of Peter’s mind so long as he lived. It was far more effectual than ten thousand sermons would have been without the Spirit. The penitent apostle would be sure to weep when he recollected the <i>Saviour’s full forgiveness</i>, which restored him to his former place. To think that we have offended so kind and good a Lord is more than sufficient reason for being constant weepers. Lord, smite our rocky hearts, and make the waters flow."]}