{"verses":[{"passage":"He appeared first to Mary Magdalene.","reference":{"book":"Mark","chapter":"16","verse":"9"}}],"reading":["Jesus “appeared first to Mary Magdalene,” probably not only on account of her great love and persevering seeking, but because, as the context intimates,<i>she had been a special </i><i>trophy of Christ’s delivering power</i>. Learn from this, that the greatness of our sin before conversion should not make us imagine that we may not be specially favoured with the very highest grade of fellowship. She was one who had left all to become <i>a constant attendant on the Saviour</i>. He was her first, her chief object. Many who were on Christ’s side did not take up Christ’s cross; <i>she</i> did. <i>She spent her substance </i><i>in relieving his wants</i>. If we would see much of Christ, let us <i>serve</i> him. Tell me who they are that sit oftenest under the banner of his love, and drink deepest draughts from the cup of communion, and I am sure they will be those who give most, who serve best, and who abide closest to the bleeding heart of their dear Lord. But notice <i>how</i> Christ revealed himself to this sorrowing one—by a <i>word</i>, “Mary.” It needed but one word <i>in his voice</i>, and at once she knew him, and <i>her heart </i><i>owned allegiance by another word</i>, her heart was too full to say more. That one word would naturally be the most fitting for the occasion. It implies obedience. She said, “<i>Master</i>.” There is no state of mind in which this confession of allegiance will be too cold. No, when your spirit glows most with the heavenly fire, then you will say, “I am thy servant, thou hast loosed my bonds.” If you can say, “Master,” if you feel that his will is your will, then you stand in a happy, holy place. He must have said, “Mary,” or else you could not have said, “Rabboni.” See, then, from all this, how Christ honours those who honour him, how love draws our Beloved, how it needs but one word of his to turn our weeping to rejoicing, how his presence makes the heart’s sunshine."]}