{"verses":[{"passage":"The dove found no rest for the sole of her foot.","reference":{"book":"Genesis","chapter":"8","verse":"9"}}],"reading":["Reader, can you find rest apart from the ark, Christ Jesus? Then be assured that your religion is vain. Are you satisfied with anything short of a conscious knowledge of your union and interest in Christ? Then woe unto you. If you profess to be a Christian, yet find full satisfaction in worldly pleasures and pursuits, your profession is false. If your soul can stretch herself at rest, and find the bed long enough, and the coverlet broad enough to cover her in the chambers of sin, then you are a hypocrite, and far enough from any right thoughts of Christ or perception of his preciousness. But if, on the other hand, you feel that if you could indulge in sin without punishment, yet it would be a punishment of itself; and that if you could have the whole world, and abide in it forever, it would be quite enough misery not to be parted from it; for your God—your God—is what your soul craves after; then be of good courage, thou art a child of God. With all thy sins and imperfections, take this to thy comfort: if thy soul has no rest in sin, thou are not as the sinner is! If thou art still crying after and craving after something better, Christ has not forgotten thee, for thou hast not quite forgotten him. The believer cannot do without his Lord; words are inadequate to express his thoughts of him. We cannot live on the sands of the wilderness, we want the manna which drops from on high; our skin bottles of creature confidence cannot yield us a drop of moisture, but we drink of the rock which follows us, and that rock is Christ. When you feed on him your soul can sing, “He hath satisfied my mouth with good things, so that my youth is renewed like the eagle's,” but if you have him not, your bursting wine vat and well-filled barn can give you no sort of satisfaction: rather lament over them in the words of wisdom, “Vanity of vanities, all is vanity!”"]}