{"verses":[{"passage":"Search the Scriptures.","reference":{"book":"John","chapter":"5","verse":"39"}}],"reading":["The Greek word here rendered <i>search</i> signifies a strict, close, diligent, curious search, such as men make when they are seeking gold, or hunters when they are in earnest after game. We must not rest content with having given a superficial reading to a chapter or two, but with the candle of the Spirit we must deliberately seek out the hidden meaning of the word. Holy Scripture <i>requires searching</i>—much of it can only be learned by careful study. There is milk for babes, but also meat for strong men. The rabbis wisely say that a mountain of matter hangs upon every word, yea, upon every title of Scripture. Tertullian exclaims, “I adore the fulness of the Scriptures.” No man who merely skims the book of God can profit thereby; we must dig and mine until we obtain the hid treasure. The door of the word only opens to the key of diligence. The Scriptures <i>claim </i><i>searching</i>. They are the writings of God, bearing the divine stamp and imprimatur—who shall dare to treat them with levity? He who despises them despises the God who wrote them. God forbid that any of us should leave our Bibles to become swift witnesses against us in the great day of account. The word of God <i>will </i><i>repay searching</i>. God does not bid us sift a mountain of chaff with here and there a grain of wheat in it, but the Bible is winnowed corn—we have but to open the granary door and find it. Scripture grows upon the student. It is full of surprises. Under the teaching of the Holy Spirit, to the searching eye it glows with splendour of revelation, like a vast temple paved with wrought gold, and roofed with rubies, emeralds, and all manner of gems. No merchandise is like the merchandise of Scripture truth. Lastly, <i>the Scriptures reveal Jesus</i>: “They are they which testify of me.” No more powerful motive can be urged upon Bible readers than this: he who finds Jesus finds life, heaven, all things. Happy he who, searching his Bible, discovers his Saviour."]}