{"verses":[{"passage":"The foundation of God standeth sure.","reference":{"book":"2 Timothy","chapter":"2","verse":"19"}}],"reading":["The foundation upon which our faith rests is this, that “God was in Christ reconciling the world unto himself, not imputing their trespasses unto them.” The great fact on which genuine faith relies is, that “the Word was made flesh and dwelt among us,” and that “Christ also hath suffered for sin, the just for the unjust, that he might bring us to God”; “Who himself bare our sins in his own body on the tree”; “For the chastisement of our peace was upon him, and by his stripes we are healed.” In one word, the great pillar of the Christian’s hope is <i>substitution</i>. The vicarious sacrifice of Christ for the guilty, Christ being made sin for us that we might be made the righteousness of God in him, Christ offering up a true and proper expiatory and substitutionary sacrifice in the room, place, and stead of as many as the Father gave him, who are known to God by name, and are recognized in their own hearts by their trusting in Jesus—this is the cardinal fact of the gospel. If this foundation were removed, what could we do? But it standeth firm as the throne of God. We know it; we rest on it; we rejoice in it; and our delight is to hold it, to meditate upon it, and to proclaim it, while we desire to be actuated and moved by gratitude for it in every part of our life and conversation. In these days a direct attack is made upon the doctrine of the atonement. Men cannot bear substitution. They gnash their teeth at the thought of the Lamb of God bearing the sin of man. But we, who know by experience the preciousness of this truth, will proclaim it in defiance of them confidently and unceasingly. We will neither dilute it nor change it, nor fritter it away in any shape or fashion. It shall still be Christ, a <i>positive substitute</i>, bearing human guilt and suffering in the stead of men. We cannot, dare not, give it up, for it is our life, and despite every controversy we feel that <i>“Nevertheless the foundation of God standeth sure.”</i>"]}