{"verses":[{"passage":"Who hath saved us, and called us with an holy calling.","reference":{"book":"2 Timothy","chapter":"1","verse":"9"}}],"reading":["The apostle uses the perfect tense and says, “Who <i>hath</i> saved us.” Believers in Christ Jesus <i>are</i> saved. They are not looked upon as persons who are in a hopeful state, and may ultimately be saved, but they <i>are</i> already saved. Salvation is not a blessing to be enjoyed upon the dying bed, and to be sung of in a future state above, but a matter to be obtained, received, promised, and enjoyed now. The Christian is perfectly saved <i>in God’s purpose</i>; God has ordained him unto salvation, and that purpose is complete. He is saved also as to the <i>price </i><i>which has been paid for him</i>: “It is finished” was the cry of the Saviour ere he died. The believer is also perfectly saved <i>in his covenant head</i>, for as he fell in Adam, so he lives in Christ. This complete salvation is accompanied by <i>a holy </i><i>calling</i>. Those whom the Saviour saved upon the cross are in due time effectually called by the power of God the Holy Spirit unto holiness: they leave their sins; they endeavour to be like Christ; they choose holiness, not out of any compulsion, but from the stress of a new nature, which leads them to rejoice in holiness just as naturally as aforetime they delighted in sin. God neither chose them nor called them because they were holy, but he called them that they might be holy, and holiness is the beauty produced by his workmanship in them. The excellencies which we see in a believer are as much the work of God as the atonement itself. Thus is brought out very sweetly the fulness of the grace of God. Salvation must be of grace, because the Lord is the author of it: and what motive but grace could move him to save the guilty? Salvation must be of grace, because the Lord works in such a manner that our righteousness is forever excluded. Such is the believer’s privilege—<i>a present </i><i>salvation</i>; such is the evidence that he is called to it—<i>a </i><i>holy life</i>."]}