{"verses":[{"passage":"He humbled himself.","reference":{"book":"Philippians","chapter":"2","verse":"8"}}],"reading":["Jesus is the great teacher of lowliness of heart. We need daily to learn of him. See the Master taking a towel and washing his disciples’ feet! Follower of Christ, wilt thou not humble thyself? See him as the Servant of servants, and surely thou canst not be proud! Is not this sentence the compendium of his biography, “He humbled himself”? Was he not on earth always stripping off first one robe of honour and then another, till, naked, he was fastened to the cross, and there did he not empty out his inmost self, pouring out his life-blood, giving up for all of us, till they laid him penniless in a borrowed grave? How low was our dear Redeemer brought! How then can we be proud? Stand at the foot of the cross, and count the purple drops by which you have been cleansed; see the thorn-crown; mark his scourged shoulders, still gushing with encrimsoned rills; see hands and feet given up to the rough iron, and his whole self to mockery and scorn; see the bitterness, and the pangs, and the throes of inward grief, showing themselves in his outward frame; hear the thrilling shriek, “My God, my God, why hast thou forsaken me?” And if you do not lie prostrate on the ground before that cross, you have never seen it: if you are not humbled in the presence of Jesus, you do not know him. You were so lost that nothing could save you but the sacrifice of God’s only begotten. Think of that, and as Jesus stooped for you, bow yourself in lowliness at his feet. A sense of Christ’s amazing love to us has a greater tendency to humble us than even a consciousness of our own guilt. May the Lord bring us in contemplation to Calvary, then our position will no longer be that of the pompous man of pride, but we shall take the humble place of one who loves much because much has been forgiven him. Pride cannot live beneath the cross. Let us sit there and learn our lesson, and then rise and carry it into practice."]}