{"verses":[{"passage":"The Lord hath done great things for us, whereof we are glad.","reference":{"book":"Psalm","chapter":"126","verse":"3"}}],"reading":["Some Christians are sadly prone to <i>look</i> on the <i>dark</i> side of everything, and to dwell more upon what they have gone through than upon what God has done for them. Ask for their impression of the Christian life, and they will describe their continual conflicts, their deep afflictions, their sad adversities, and the sinfulness of their hearts, yet with scarcely any allusion to the mercy and help which God has vouchsafed them. But a Christian whose soul is in a <i>healthy</i> state, will come forward joyously, and say, “I will speak, not about myself, but to the honour of my God. He hath brought me up out of an horrible pit, and out of the miry clay, and set my feet upon a rock, and established my goings: and he hath put a new song in my mouth, even praise unto our God. The Lord hath done great things for me, whereof I am glad.” Such an abstract of experience as this is the very best that any child of God can present. It is true that we endure trials, but it is just as true that we are delivered out of them. It is true that we have our corruptions, and mournfully do we know this, but it is quite as true that we have an all-sufficient Saviour, who overcomes these corruptions, and delivers us from their dominion. In looking back, it would be wrong to deny that we have been in the Slough of Despond, and have crept along the Valley of Humiliation, but it would be equally wicked to forget that we have been <i>through</i> them safely and profitably; we have not remained in them, thanks to our Almighty Helper and Leader, who has brought us “out into a wealthy place.” The deeper our troubles, the louder our thanks to God, who has led us through all, and preserved us until now. Our griefs cannot mar the melody of our praise, we reckon them to be the bass part of our life’s song, “He hath done great things for us, whereof we are glad.”"]}