{"verses":[{"passage":"O Lord, to us belongeth confusion of face ... because we have sinned against thee.","reference":{"book":"Daniel","chapter":"9","verse":"8"}}],"reading":["A deep sense and clear sight of sin, its heinousness, and the punishment which it deserves, should make us lie low before the throne. We have sinned as Christians. Alas! that it should be so. Favoured as we have been, we have yet been ungrateful: privileged beyond most, we have not brought forth fruit in proportion. Who is there, although he may long have been engaged in the Christian warfare, that will not blush when he looks back upon the past? As for our days before we were regenerated, may they be forgiven and forgotten; but since then, though we have not sinned as before, yet we have sinned against light and against love—light which has really penetrated our minds, and love in which we have rejoiced. Oh, the atrocity of the sin of a pardoned soul! An unpardoned sinner sins cheaply compared with the sin of one of God’s own elect ones, who has had communion with Christ and leaned his head upon Jesus’ bosom. Look at David! Many will talk of his sin, but I pray you look at his repentance, and hear his broken bones, as each one of them moans out its dolorous confession! Mark his tears, as they fall upon the ground, and the deep sighs with which he accompanies the softened music of his harp! We have erred: let us, therefore, seek the spirit of penitence. Look, again, at Peter! We speak much of Peter’s denying his Master. Remember, it is written, “He wept bitterly.” Have <i>we</i> no denials of our Lord to be lamented with tears? Alas! these sins of ours, before and after conversion, would consign us to the place of inextinguishable fire if it were not for the sovereign mercy which has made us to differ, snatching us like brands from the burning. My soul, bow down under a sense of thy natural sinfulness, and worship thy God. Admire the grace which saves thee—the mercy which spares thee—the love which pardons thee!"]}