{"verses":[{"passage":"Shadrach, Meshach, and Abednego, answered and said ... Be it known unto thee, O king, that we will not serve thy gods.","reference":{"book":"Daniel","chapter":"3","verse":"16, 18"}}],"reading":["The narrative of the manly courage and marvellous deliverance of the three holy children, or rather champions, is well calculated to excite in the minds of believers firmness and steadfastness in upholding the truth in the teeth of tyranny and in the very jaws of death. Let young Christians especially learn from their example, both in matters of faith in religion, and matters of uprightness in business, never to sacrifice their consciences. Lose all rather than lose your integrity, and when all else is gone, still hold fast a clear conscience as the rarest jewel which can adorn the bosom of a mortal. Be not guided by the will-o’-the-wisp of policy, but by the pole-star of divine authority. Follow the right at all hazards. When you see no present advantage, walk by faith and not by sight. Do God the honour to trust him when it comes to matters of loss for the sake of principle. See whether he will be your debtor! See if he doth not even in this life prove his word that “Godliness, with contentment, is great gain,” and that they who “seek first the kingdom of God and his righteousness, shall have all these things added unto them.” Should it happen that, in the providence of God, you are a loser by conscience, you shall find that if the Lord pays you not back in the silver of earthly prosperity, he will discharge his promise in the gold of spiritual joy. Remember that a man’s life consisteth not in the abundance of that which he possesseth. To wear a guileless spirit, to have a heart void of offence, to have the favour and smile of God, is greater riches than the mines of Ophir could yield, or the traffic of Tyre could win. “Better is a dinner of herbs where love is, than a stalled ox and inward contention therewith.” An ounce of heart's-ease is worth a ton of gold."]}