{"verses":[{"passage":"And they were all filled with the Holy Ghost.","reference":{"book":"Acts","chapter":"2","verse":"4"}}],"reading":["Rich were the blessings of this day if all of us were filled with the Holy Ghost. The consequences of this sacred filling of the soul it would be impossible to overestimate. Life, comfort, light, purity, power, peace; and many other precious blessings are inseparable from the Spirit’s benign presence. As sacred <i>oil</i>, he anoints the head of the believer, sets him apart to the priesthood of saints, and gives him grace to execute his office aright. As the only truly purifying <i>water</i> he cleanses us from the power of sin and sanctifies us unto holiness, working in us to will and to do of the Lord’s good pleasure. As the <i>light</i>, he manifested to us at first our lost estate, and now he reveals the Lord Jesus to us and in us, and guides us in the way of righteousness. Enlightened by his pure celestial ray, we are no more darkness but light in the Lord. <i>As fire</i>, he both purges us from dross, and sets our consecrated nature on a blaze. He is the sacrificial flame by which we are enabled to offer our whole souls as a living sacrifice unto God. As heavenly <i>dew</i>, he removes our barrenness and fertilizes our lives. O that he would drop from above upon us at this early hour! Such morning dew would be a sweet commencement for the day. As the <i>dove</i>, with wings of peaceful love he broods over his Church and over the souls of believers, and as a Comforter he dispels the cares and doubts which mar the peace of his beloved. He descends upon the chosen as upon the Lord in Jordan, and bears witness to their sonship by working in them a filial spirit by which they cry Abba, Father. As the <i>wind</i>, he brings the breath of life to men; blowing where he listeth he performs the quickening operations by which the spiritual creation is animated and sustained. Would to God, that we might feel his presence this day and every day."]}