{"verses":[{"passage":"Thou art fairer than the children of men.","reference":{"book":"Psalm","chapter":"45","verse":"2"}}],"reading":["The entire person of Jesus is but as one gem, and his life is all along but one impression of the seal. He is altogether complete; not only in his several parts, but as a gracious all-glorious whole. His character is not a mass of fair colours mixed confusedly, nor a heap of precious stones laid carelessly one upon another; he is a picture of beauty and a breastplate of glory. In him, all the “things of good repute” are in their proper places, and assist in adorning each other. Not one feature in his glorious person attracts attention at the expense of others; but he is perfectly and altogether lovely.","Oh, Jesus! thy power, thy grace, thy justice, thy tenderness, thy truth, thy majesty, and thine immutability make up such a man, or rather such a God-man, as neither heaven nor earth hath seen elsewhere. Thy infancy, thy eternity, thy sufferings, thy triumphs, thy death, and thine immortality, are all woven in one gorgeous tapestry, without seam or rent. Thou art music without discord; thou art many, and yet not divided; thou art all things, and yet not diverse. As all the colours blend into one resplendent rainbow, so all the glories of heaven and earth meet in thee, and unite so wondrously, that there is none like thee in all things; nay, if all the virtues of the most excellent were bound in one bundle, they could not rival thee, thou mirror of all perfection. Thou hast been anointed with the holy oil of myrrh and cassia, which thy God hath reserved for thee alone; and as for thy fragrance, it is as the holy perfume, the like of which none other can ever mingle, even with the art of the apothecary; each spice is fragrant, but the compound is divine.","“Oh, sacred symmetry! oh, rare connection","Of many perfects, to make one perfection!","Oh, heavenly music, where all parts do meet","In one sweet strain, to make one perfect sweet!”"]}