{"verses":[{"passage":"Be zealous.","reference":{"book":"Revelation","chapter":"3","verse":"19"}}],"reading":["If you would see souls converted, if you would hear the cry that “the kingdoms of this world have become the kingdoms of our Lord;” if you would place crowns upon the head of the Saviour, and his throne lifted high, then be filled with zeal. For, under God, the way of the world’s conversion must be by the zeal of the church. Every grace shall do exploits, but this shall be first; prudence, knowledge, patience, and courage will follow in their places, but zeal must lead the van. It is not the extent of your knowledge, though that is useful; it is not the extent of your talent, though that is not to be despised; it is your zeal that shall do great exploits. This zeal is the fruit of the Holy Spirit: it draws its vital force from <i>the continued </i><i>operations</i> of the Holy Ghost in the soul. If our inner life dwindles, if our heart beats slowly before God, we shall not know zeal; but if all be strong and vigorous within, then we cannot but feel a loving anxiety to see the kingdom of Christ come, and his will done on earth, even as it is in heaven. A deep <i>sense of gratitude</i> will nourish Christian zeal. Looking to the hole of the pit whence we were digged, we find abundant reason why we should spend and be spent for God. And zeal is also stimulated by <i>the thought of the eternal future</i>. It looks with tearful eyes down to the flames of hell, and it cannot slumber: it looks up with anxious gaze to the glories of heaven, and it cannot but bestir itself. It feels that time is short compared with the work to be done, and therefore it devotes all that it has to the cause of its Lord. And it is ever strengthened by <i>the remembrance of Christ’s example</i>. He was clothed with zeal as with a cloak. How swift the chariot-wheels of duty went with him! He knew no loitering by the way. Let us prove that we are his disciples by manifesting the same spirit of zeal."]}