{"verses":[{"passage":"Howbeit, in the business of the ambassadors of the princes of Babylon, who sent unto him to enquire of the wonder that was done in the land, God left him, to try him, that he might know all that was in his heart.","reference":{"book":"2 Chronicles","chapter":"32","verse":"31"}}],"reading":["Hezekiah was growing so inwardly great, and priding himself so much upon the favour of God, that self-righteousness crept in, and through his carnal security, the grace of God was for a time, in its more active operations, withdrawn. Here is quite enough to account with the Babylonians; for if the grace of God should leave the best Christian, there is enough of sin in his heart to make him the worst of transgressors. If left to yourselves, you who are warmest for Christ would cool down like Laodicea into sickening lukewarmness: you who are sound in the faith would be white with the leprosy of false doctrine; you who now walk before the Lord in excellency and integrity would reel to and fro, and stagger with a drunkenness of evil passion. Like the moon, we borrow our light; bright as we are when grace shines on us, we are darkness itself when the Sun of Righteousness withdraws himself. <i>Therefore let us cry to God </i><i>never to leave us</i>. “Lord, take not thy Holy Spirit from us! Withdraw not from us thine indwelling grace! Hast thou not said, ‘I the Lord do keep it; I will water it every moment: lest any hurt it, I will keep it night and day’? Lord, keep us everywhere. Keep us when in the valley, that we murmur not against thy humbling hand; keep us when on the mountain, that we wax not giddy through being lifted up; keep us in youth, when our passions are strong; keep us in old age, when becoming conceited of our wisdom, we may therefore prove greater fools than the young and giddy; keep us when we come to die, lest, at the very last, we should deny thee! Keep us living, keep us dying, keep us labouring, keep us suffering, keep us fighting, keep us resting, keep us everywhere, for everywhere we need thee, O our God!”"]}