{"verses":[{"passage":"Ephraim is a cake not turned.","reference":{"book":"Hosea","chapter":"7","verse":"8"}}],"reading":["A cake not turned is <i>uncooked on one side</i>; and so Ephraim was, in many respects, untouched by divine grace: though there was some partial obedience, there was very much rebellion left. My soul, I charge thee, see whether this be thy case. Art thou thorough in the things of God? Has grace gone through the very centre of thy being so as to be felt in its divine operations in all thy powers, thy actions, thy words, and thy thoughts? To be sanctified, spirit, soul, and body, should be thine aim and prayer; and although sanctification may not be perfect in thee anywhere in degree, yet it must be universal in its action; there must not be the appearance of holiness in one place and reigning sin in another, else thou, too, wilt be a cake not turned.","A cake not turned is <i>soon burnt on the side nearest the </i><i>fire</i>, and although no man can have too much religion, there are some who seem burnt black with bigoted zeal for that part of truth which they have received, or are charred to a cinder with a vainglorious Pharisaic ostentation of those religious performances which suit their humour. The assumed appearance of superior sanctity frequently accompanies a total absence of all vital godliness. The saint in public is a devil in private. He deals in flour by day and in soot by night. The cake which is burned on one side, is dough on the other.","<i>If it be so with me, O Lord, turn me</i>! Turn my unsanctified nature to the fire of thy love and let it feel the sacred glow, and let my burnt side cool a little while I learn my own weakness and want of heat when I am removed from thy heavenly flame. Let me not be found a double-minded man, but one entirely under the powerful influence of reigning grace; for well I know if I am left like a cake unturned, and am not on both sides the subject of thy grace, I must be consumed forever amid everlasting burnings."]}