{"verses":[{"passage":"Then Israel sang this song, Spring up, O well; sing ye unto it.","reference":{"book":"Numbers","chapter":"21","verse":"17"}}],"reading":["Famous was the well of Beer in the wilderness, because it was <i>the subject of a promise</i>: “That is the well whereof the Lord spake unto Moses, Gather the people together, and I will give them water.” The people needed water, and it was promised by their gracious God. We need fresh supplies of heavenly grace, and in the covenant the Lord has pledged himself to give all we require. The well next became <i>the cause of a song</i>. Before the water gushed forth, cheerful faith prompted the people to sing; and as they saw the crystal fount bubbling up, the music grew yet more joyous. In like manner, we who believe the promise of God should rejoice in the prospect of divine revivals in our souls, and as we experience them our holy joy should overflow. Are we thirsting? Let us not murmur, but sing. Spiritual thirst is bitter to bear, but we need not bear it—the promise indicates a well; let us be of good heart, and look for it. Moreover, the well was <i>the centre of prayer</i>. “Spring up, O well.” What God has engaged to give, we must enquire after, or we manifest that we have neither desire nor faith. This evening let us ask that the Scripture we have read, and our devotional exercises, may not be an empty formality, but a channel of grace to our souls. O that God the Holy Spirit would work in us with all his mighty power, filling us with all the fulness of God. Lastly, the well was <i>the object of effort</i>. “The nobles of the people digged it with their staves.” The Lord would have us active in obtaining grace. Our staves are ill adapted for digging in the sand, but we must use them to the utmost of our ability. Prayer must not be neglected; the assembling of ourselves together must not be forsaken; ordinances must not be slighted. The Lord will give us his peace most plenteously, but not in a way of idleness. Let us, then, bestir ourselves to seek him in whom are all our fresh springs."]}