{"verses":[{"passage":"Are they Israelites? so am I.","reference":{"book":"2 Corinthians","chapter":"11","verse":"22"}}],"reading":["We have here <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.1\">a personal claim</span>, and one that <i>needs proof</i>. The apostle knew that <i>his</i> claim was indisputable, but there are many persons who have no right to the title who yet claim to belong to the Israel of God. If we are with confidence declaring, “So am I also an Israelite,” let us only say it after having searched our heart as in the presence of God. But if we can give proof that we are following Jesus, if we can from the heart say, “I trust him wholly, trust him only, trust him simply, trust him now, and trust him ever,” then the position which the saints of God hold belongs to us—all their enjoyments are our possessions; we may be the very least in Israel, “less than the least of all saints,” yet since the mercies of God belong to the saints <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.2\">as saints</span>, and not as advanced saints, or well-taught saints, we may put in our plea, and say, “Are they Israelites? so am I; therefore the promises are mine, grace is mine, glory will be mine.” The claim, rightfully made, is one which will yield untold comfort. When God’s people are rejoicing that they are his, what a happiness if they can say, “<span style=\"font-variant:small-caps\" id=\"d0606pm-p3.3\">So am I</span> !” When they speak of being pardoned, and justified, and accepted in the Beloved, how joyful to respond, “Through the grace of God, <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.4\">so am I</span>.” But this claim not only has its enjoyments and privileges, but also its conditions and duties. We must share with God’s people in cloud as well as in sunshine. When we hear them spoken of with contempt and ridicule for being Christians, we must come boldly forward and say, “So am I.” When we see them working for Christ, giving their time, their talent, their whole heart to Jesus, we must be able to say, “So do I.” O let us prove our gratitude by our devotion, and live as those who, having claimed a privilege, are willing to take the responsibility connected with it."]}