{"verses":[{"passage":"He will make her wilderness like Eden.","reference":{"book":"Isaiah","chapter":"51","verse":"3"}}],"reading":["Methinks, I see in vision a howling wilderness, a great and terrible desert, like to the Sahara. I perceive nothing in it to relieve the eye, all around I am wearied with a vision of hot and arid sand, strewn with ten thousand bleaching skeletons of wretched men who have expired in anguish, having lost their way in the pitiless waste. What an appalling sight! How horrible! a sea of sand without a bound, and without an oasis, a cheerless graveyard for a race forlorn! But behold and wonder! Upon a sudden, upspringing from the scorching sand I see a plant of renown; and as it grows it buds, the bud expands—it is a rose, and at its side a lily bows its modest head; and, miracle of miracles! as the fragrance of those flowers is diffused the wilderness is transformed into a fruitful field, and all around it blossoms exceedingly, the glory of Lebanon is given unto it, the excellency of Carmel and Sharon. Call it not Sahara, call it Paradise. Speak not of it any longer as the valley of deathshade, for where the skeletons lay bleaching in the sun, behold a resurrection is proclaimed, and up spring the dead, a mighty army, full of life immortal. Jesus is that plant of renown, and his presence makes all things new. Nor is the wonder less in each individual’s salvation. Yonder I behold you, dear reader, cast out, an infant, unswathed, unwashed, defiled with your own blood, left to be food for beasts of prey. But lo, a jewel has been thrown into your bosom by a divine hand, and for its sake you have been pitied and tended by divine providence, you are washed and cleansed from your defilement, you are adopted into heaven’s family, the fair seal of love is upon your forehead, and the ring of faithfulness is on your hand—you are now a prince unto God, though once an orphan, cast away. O prize exceedingly the matchless power and grace which changes deserts into gardens, and makes the barren heart to sing for joy."]}