{"verses":[{"passage":"And he went a little farther, and fell on his face, and prayed.","reference":{"book":"Matthew","chapter":"26","verse":"39"}}],"reading":["There are several instructive features in our Saviour’s prayer in his hour of trial. It was <i>lonely prayer</i>. He withdrew even from his three favoured disciples. Believer, be much in solitary prayer, especially in times of trial. Family prayer, social prayer, prayer in the Church, will not suffice, these are very precious, but the best beaten spice will smoke in your censer in your private devotions, where no ear hears but God's.","It was <i>humble prayer</i>. Luke says he knelt, but another evangelist says he “fell on his face.” Where, then, must be <span style=\"font-variant:small-caps\" id=\"d0322am-p4.1\">thy</span> place, thou humble servant of the great Master? What dust and ashes should cover <i>thy</i> head! Humility gives us good foot-hold in prayer. There is no hope of prevalence with God unless we abase ourselves that he may exalt us in due time.","It was <i>filial prayer</i>. “Abba, Father.” You will find it a stronghold in the day of trial to plead your adoption. You have no rights as a subject, you have forfeited them by your treason; but nothing can forfeit a child’s right to a father’s protection. Be not afraid to say, “My Father, hear my cry.”","Observe that it was <i>persevering prayer</i>. He prayed three times. Cease not until you prevail. Be as the importunate widow, whose continual coming earned what her first supplication could not win. Continue in prayer, and watch in the same with thanksgiving.","Lastly, <i>it was the prayer of resignation</i>. “Nevertheless, not as I will, but as thou wilt.” Yield, and God yields. Let it be as God wills, and God will determine for the best. Be thou content to leave thy prayer in his hands, who knows when to give, and how to give, and what to give, and what to withhold. So pleading, earnestly, importunately, yet with humility and resignation, thou shalt surely prevail."]}