{"verses":[{"passage":"Say unto my soul, I am thy salvation.","reference":{"book":"Psalm","chapter":"35","verse":"3"}}],"reading":["What does this sweet prayer teach me? It shall be my evening’s petition; but first let it yield me an instructive meditation. The text informs me first of all that <i>David had </i><i>his doubts</i>; for why should he pray, “Say unto my soul, I am thy salvation,” if he were not sometimes exercised with doubts and fears? Let me, then, be of good cheer, for I am not the only saint who has to complain of weakness of faith. If David doubted, I need not conclude that I am no Christian because I have doubts. The text reminds me that <i>David was not content </i><i>while he had doubts and fears</i>, but he repaired at once to the mercy-seat to pray for assurance; for he valued it as much fine gold. I too must labour after an abiding sense of my acceptance in the Beloved, and must have no joy when his love is not shed abroad in my soul. When my Bridegroom is gone from me, my soul must and will fast. I learn also that <i>David knew where </i><i>to obtain full assurance</i>. He went to his God in prayer, crying, “Say unto my soul I am thy salvation.” I must be much alone with God if I would have a clear sense of Jesus’ love. Let my prayers cease, and my eye of faith will grow dim. Much in prayer, much in heaven; slow in prayer, slow in progress. I notice that <i>David would not be satisfied unless his assurance </i><i>had a divine source</i>. “Say unto my soul.” Lord, do <i>thou</i> say it! Nothing short of a divine testimony in the soul will ever content the true Christian. Moreover, David could not rest unless his assurance had <i>a vivid personality</i> about it. “Say unto <i>my</i> soul, I am <i>thy</i> salvation.” Lord, if thou shouldst say this to all the saints, it were nothing, unless thou shouldst say it to me. Lord, I have sinned; I deserve not thy smile; I scarcely dare to ask it; but oh! say to <i>my</i> soul, even to <i>my</i> soul, “I am <i>thy</i> salvation.” Let me have a present, personal, infallible, indisputable sense that I am thine, and that thou art mine."]}