{"verses":[{"passage":"Blessed are the peacemakers: for they shall be called the children of God.","reference":{"book":"Matthew","chapter":"5","verse":"9"}}],"reading":["This is the seventh of the beatitudes: and seven was the number of perfection among the Hebrews. It may be that the Saviour placed the peacemaker the seventh upon the list because he most nearly approaches the perfect man in Christ Jesus. He who would have perfect blessedness, so far as it can be enjoyed on earth, must attain to this seventh benediction, and become a peacemaker. There is a significance also in the position of the text. The verse which precedes it speaks of the blessedness of “the pure in heart: for they shall see God.” It is well to understand that we are to be “first pure, then peaceable.” Our peaceableness is never to be a compact with sin, or toleration of evil. We must set our faces like flints against everything which is contrary to God and his holiness: purity being in our souls a settled matter, we can go on to peaceableness. Not less does the verse that follows seem to have been put there on purpose. However peaceable we may be in this world, yet we shall be misrepresented and misunderstood: and no marvel, for even the Prince of Peace, by his very peacefulness, brought fire upon the earth. He himself, though he loved mankind, and did no ill, was “despised and rejected of men, a man of sorrows and acquainted with grief.” Lest, therefore, the peaceable in heart should be surprised when they meet with enemies, it is added in the following verse, “Blessed are they which are persecuted for righteousness’ sake: for theirs is the kingdom of heaven.” Thus, the peacemakers are not only pronounced to be blessed, but they are compassed about with blessings. Lord, give us grace to climb to this seventh beatitude! Purify our minds that we may be “first pure, then peaceable,” and fortify our souls, that our peaceableness may not lead us into cowardice and despair, when for thy sake we are persecuted."]}