{"verses":[{"passage":"Yea, he is altogether lovely.","reference":{"book":"Song of Solomon","chapter":"5","verse":"16"}}],"reading":["The superlative beauty of Jesus is all-attracting; it is not so much to be admired as to be loved. He is more than pleasant and fair, he is lovely. Surely the people of God can fully justify the use of this golden word, for he is the object of their warmest love, a love founded on the intrinsic excellence of his person, the complete perfection of his charms. Look, O disciples of Jesus, to your Master’s lips, and say, “Are they not most sweet?” Do not his words cause your hearts to burn within you as he talks with you by the way? Ye worshippers of Immanuel, look up to his head of much fine gold, and tell me, are not his thoughts precious unto you? Is not your adoration sweetened with affection as ye humbly bow before that countenance which is as Lebanon, excellent as the cedars? Is there not a charm in his every feature, and is not his whole person fragrant with such a savour of his good ointments, that therefore the virgins love him? Is there one member of his glorious body which is not attractive?—one portion of his person which is not a fresh lodestone to our souls?—one office which is not a strong cord to bind your heart? Our love is not as a seal set upon his heart of love alone; it is fastened upon his arm of power also; nor is there a single part of him upon which it does not fix itself. We anoint his whole person with the sweet spikenard of our fervent love. His whole life we would imitate; his whole character we would transcribe. In all other beings we see some lack, in him there is all perfection. The best even of his favoured saints have had blots upon their garments and wrinkles upon their brows; he is nothing but loveliness. All earthly suns have their spots: the fair world itself hath its wilderness; we cannot love the whole of the most lovely thing; but Christ Jesus is gold without alloy-light without darkness—glory without cloud—“Yea, he is <i>altogether</i> lovely.”"]}