{"verses":[{"passage":"As the Father hath loved me, so have I loved you.","reference":{"book":"John","chapter":"15","verse":"9"}}],"reading":["As the Father loves the Son, in the same manner Jesus loves his people. What is that divine method? He loved him <i>without </i><i>beginning</i>, and thus Jesus loves his members. “<i>I have loved </i><i>thee with an everlasting love</i>.” You can trace the beginning of human affection; you can easily find the beginning of your love to Christ, but his love to us is a stream whose source is hidden in eternity. God the Father loves Jesus <i>without any </i><i>change</i>. Christian, take this for your comfort, that there is no change in Jesus Christ’s love to those who rest in him. Yesterday you were on Tabor’s top, and you said, “He loves me:” today you are in the valley of humiliation, but he loves you still the same. On the hill Mizar, and among the Hermons, you heard his voice, which spake so sweetly with the turtle-notes of love; and now on the sea, or even in the sea, when all his waves and billows go over you, his heart is faithful to his ancient choice. The Father loves the Son <i>without any end</i>, and thus does the Son love his people. Saint, thou needest not fear the loosing of the silver cord, for his love for thee will never cease. Rest confident that even down to the grave Christ will go with you, and that up again from it he will be your guide to the celestial hills. Moreover, the Father loves the Son <i>without </i><i>any measure</i>, and the same immeasurable love the Son bestows upon his chosen ones. The whole heart of Christ is dedicated to his people. He “loved us and gave himself for us.” His is a love which passeth knowledge. Ah! we have indeed an immutable Saviour, a precious Saviour, one who loves without measure, without change, without beginning, and without end, even as the Father loves him! There is much food here for those who know how to digest it. May the Holy Ghost lead us into its marrow and fatness!"]}