{"verses":[{"passage":"I tell you that, if these should hold their peace, the stones would immediately cry out.","reference":{"book":"Luke","chapter":"19","verse":"40"}}],"reading":["But could the stones cry out? Assuredly they could if he who opens the mouth of the dumb should bid them lift up their voice. Certainly if they were to speak, they would have much to testify in praise of him who created them by the word of his power; they could extol the wisdom and power of their <i>Maker</i> who called them into being. Shall not <i>we</i> speak well of him who made us anew, and out of stones raised up children unto Abraham? The old rocks could tell of chaos and order, and the handiwork of God in successive stages of creation’s drama; and cannot <i>we</i> talk of God’s decrees, of God’s great work in ancient times, in all that he did for his church in the days of old? If the stones were to speak, they could tell of their <i>breaker</i>, how he took them from the quarry, and made them fit for the temple, and cannot we tell of our glorious Breaker, who broke our hearts with the hammer of his word, that he might build us into his temple? If the stones should cry out they would magnify their <i>builder</i>, who polished them and fashioned them after the similitude of a palace; and shall not we talk of our Architect and Builder, who has put us in our place in the temple of the living God? If the stones could cry out, they might have a long, long story to tell by way of memorial, for many a time hath a great stone been rolled as a memorial before the Lord; and we too can testify of Ebenezers, stones of help, pillars of remembrance. The broken stones of the law cry out against us, but Christ himself, who has rolled away the stone from the door of the sepulchre, speaks for us. Stones might well cry out, but we will not let them: we will hush their noise with ours; we will break forth into sacred song, and bless the majesty of the Most High, all our days glorifying him who is called by Jacob the Shepherd and Stone of Israel."]}