{"verses":[{"passage":"Abide in me.","reference":{"book":"John","chapter":"15","verse":"4"}}],"reading":["Communion with Christ is a certain cure for every ill. Whether it be the wormwood of woe, or the cloying surfeit of earthly delight, close fellowship with the Lord Jesus will take bitterness from the one, and satiety from the other. Live near to Jesus, Christian, and it is a matter of secondary importance whether thou livest on the mountain of honour or in the valley of humiliation. Living near to Jesus, thou art covered with the wings of God, and underneath thee are the everlasting arms. Let nothing keep thee from that hallowed intercourse, which is the choice privilege of a soul wedded to <span style=\"font-variant:small-caps\" id=\"d0309pm-p3.1\">the well-beloved</span>. Be not content with an interview now and then, but seek always to retain his company, for only in his presence hast thou either comfort or safety. Jesus should not be unto us a friend who calls upon us now and then, but one with whom we walk evermore. Thou hast a difficult road before thee: see, O traveller to heaven, that thou go not without thy guide. Thou hast to pass through the fiery furnace; enter it not unless, like Shadrach, Meshach, and Abednego, thou hast the Son of God to be thy companion. Thou hast to storm the Jericho of thine own corruptions: attempt not the warfare until, like Joshua, thou hast seen the Captain of the Lord’s host, with his sword drawn in his hand. Thou art to meet the Esau of thy many temptations: meet him not until at Jabbok’s brook thou hast laid hold upon the angel, and prevailed. In every case, in every condition, thou wilt need Jesus; but most of all, when the iron gates of death shall open to thee. Keep thou close to thy soul’s Husband, lean thy head upon his bosom, ask to be refreshed with the spiced wine of his pomegranate, and thou shalt be found of him at the last, without spot, or wrinkle, or any such thing. Seeing thou hast lived with him, and lived in him here, thou shalt abide with him forever."]}