{"verses":[{"passage":"To whom belongest thou?","reference":{"book":"1 Samuel","chapter":"30","verse":"13"}}],"reading":["No neutralities can exist in religion. We are either ranked under the banner of Prince Immanuel, to serve and fight his battles, or we are vassals of the black prince, Satan. “To whom belongest thou?”","Reader, let me assist you in your response. <i>Have you been </i><i>“born again”</i>? If you have, you belong to Christ, but without the new birth you cannot be his. <i>In whom do you trust</i>? For those who believe in Jesus are the sons of God. <i>Whose work are </i><i>you doing</i>? You are sure to serve your master, for he whom you serve is thereby owned to be your lord. <i>What company do </i><i>you keep</i>? If you belong to Jesus, you will fraternize with those who wear the livery of the cross. “Birds of a feather flock together.” <i>What is your conversation</i>? Is it heavenly or is it earthly? <i>What have you learned of your Master</i>?—for servants learn much from their masters to whom they are apprenticed. If you have served your time with Jesus, it will be said of you, as it was of Peter and John, “They took knowledge of them, that they had been with Jesus.”","We press the question, “To whom belongest thou?” Answer honestly before you give sleep to your eyes. If you are not Christ’s you are in a hard service—<i>Run away from your cruel </i><i>master</i>! Enter into the service of the Lord of Love, and you shall enjoy a life of blessedness. If you <i>are</i> Christ’s let me advise you to do four things. You belong to Jesus—<i>obey </i><i>him</i>; let his word be your law; let his wish be your will. You belong to the Beloved, then <i>love him</i>; let your heart embrace him; let your whole soul be filled with him. You belong to the Son of God, then <i>trust him</i>; rest nowhere but on him. You belong to the King of kings, then <i>be decided for him</i>. Thus, without your being branded upon the brow, all will know to whom you belong."]}