{"verses":[{"passage":"Thou shalt be called, Sought out.","reference":{"book":"Isaiah","chapter":"62","verse":"12"}}],"reading":["The surpassing grace of God is seen very clearly in that we were not only sought, but sought <i>out</i>. Men <i>seek</i> for a thing which is lost upon the floor of the house, but in such a case there is only seeking, not seeking out. The loss is more perplexing and the search more persevering when a thing is sought <i>out</i>. We were mingled with the mire: we were as when some precious piece of gold falls into the sewer, and men gather out and carefully inspect a mass of abominable filth, and continue to stir and rake, and search among the heap until the treasure is found. Or, to use another figure, we were lost in a labyrinth; we wandered hither and thither, and when mercy came after us with the gospel, it did not find us at the first coming, it had to search for us and seek us out; for we as lost sheep were so desperately lost, and had wandered into such a strange country, that it did not seem possible that even the Good Shepherd should track our devious roamings. Glory be to unconquerable grace, we were sought <i>out</i>! No gloom could hide us, no filthiness could conceal us, we were found and brought home. Glory be to infinite love, God the Holy Spirit restored us!","The lives of some of God’s people, if they could be written would fill us with holy astonishment. Strange and marvellous are the ways which God used in their case to find his own. Blessed be his name, he never relinquishes the search until the chosen are sought out effectually. They are not a people sought today and cast away to-morrow. Almightiness and wisdom combined will make no failures, they shall be called, “<i>Sought out</i>!” That any should be sought out is matchless grace, but that <i>we</i> should be sought out is grace beyond degree! We can find no reason for it but God’s own sovereign love, and can only lift up our heart in wonder, and praise the Lord that this night we wear the name of “<i>Sought out</i>.”"]}