{"verses":[{"passage":"Let us not sleep, as do others.","reference":{"book":"1 Thessalonians","chapter":"5","verse":"6"}}],"reading":["There are many ways of promoting Christian wakefulness. Among the rest, let me strongly advise Christians to converse together concerning the ways of the Lord. Christian and Hopeful, as they journeyed towards the Celestial City, said to themselves, “To prevent drowsiness in this place, let us fall into good discourse.” Christian enquired, “Brother, where shall we begin?” And Hopeful answered, “Where God began with us.” Then Christian sang this song—","Christians who isolate themselves and walk alone, are very liable to grow drowsy. Hold Christian company, and you will be kept wakeful by it, and refreshed and encouraged to make quicker progress in the road to heaven. But as you thus take “sweet counsel” with others in the ways of God, take care that the theme of your converse is the Lord Jesus. Let the eye of faith be constantly looking unto him; let your heart be full of him; let your lips speak of his worth. Friend, live near to the cross, and thou wilt not sleep. <i>Labour to impress thyself with </i><i>a deep sense of the value of the place to which thou art </i><i>going</i>. If thou rememberest that thou art going to heaven, thou wilt not sleep on the road. If thou thinkest that hell is behind thee, and the devil pursuing thee, thou wilt not loiter. Would the manslayer sleep with the avenger of blood behind him, and the city of refuge before him? Christian, wilt thou sleep whilst the pearly gates are open—the songs of angels waiting for thee to join them—a crown of gold ready for thy brow? Ah! no; in holy fellowship continue to watch and pray that ye enter not into temptation.","“When saints do sleepy grow, let them come hither,","And hear how these two pilgrims talk together;","Yea, let them learn of them, in any wise,","Thus to keep open their drowsy slumb'ring eyes.","Saints’ fellowship, if it be managed well,","Keeps them awake, and that in spite of hell.”"]}