{"verses":[{"passage":"And she said, Truth, Lord: yet the dogs eat of the crumbs which fall from their masters’ table.","reference":{"book":"Matthew","chapter":"15","verse":"27"}}],"reading":["This woman gained comfort in her misery by thinking <span style=\"font-variant:small-caps\" id=\"d0327pm-p3.1\">great thoughts of Christ</span>. The Master had talked about the children’s bread: “Now,” argued she, “since thou art the Master of the table of grace, I know that thou art a generous housekeeper, and there is sure to be abundance of bread on thy table; there will be such an abundance for the children that there will be crumbs to throw on the floor for the dogs, and the children will fare none the worse because the dogs are fed.” She thought him one who kept so good a table that all that she needed would only be a crumb in comparison; yet remember, what she wanted was to have the devil cast out of her daughter. It was a very great thing to her, but she had such a high esteem of Christ, that she said, “It is nothing to him, it is but a crumb for Christ to give.” This is the royal road to comfort. Great thoughts of your sin alone will drive you to despair; but great thoughts of Christ will pilot you into the haven of peace. “My sins are many, but oh! it is nothing to Jesus to take them all away. The weight of my guilt presses me down as a giant’s foot would crush a worm, but it is no more than a grain of dust to him, because he has already borne its curse in his own body on the tree. It will be but a small thing for him to give me full remission, although it will be an infinite blessing for me to receive it.” The woman opens her soul’s mouth very wide, expecting great things of Jesus, and he fills it with his love. Dear reader, do the same. She confessed what Christ laid at her door, but she laid fast hold upon him, and drew arguments even out of his hard words; she believed great things of him, and she thus overcame him. <span style=\"font-variant:small-caps\" id=\"d0327pm-p3.2\">She won the victory by believing in Him</span>. Her case is an instance of prevailing faith; and if we would conquer like her, we must imitate her tactics."]}