{"verses":[{"passage":"I will accept you with your sweet savour.","reference":{"book":"Ezekiel","chapter":"20","verse":"41"}}],"reading":["The merits of our great Redeemer are as sweet savour to the Most High. Whether we speak of the active or passive righteousness of Christ, there is an equal fragrance. There was a sweet savour in his active life by which he honoured the law of God, and made every precept to glitter like a precious jewel in the pure setting of his own person. Such, too, was his passive obedience, when he endured with unmurmuring submission, hunger and thirst, cold and nakedness, and at length sweat great drops of blood in Gethsemane, gave his back to the smiters, and his cheeks to them that plucked out the hair, and was fastened to the cruel wood, that he might suffer the wrath of God in our behalf. These two things are sweet before the Most High; and for the sake of his doing and his dying, his substitutionary sufferings and his vicarious obedience, the Lord our God accepts us. What a preciousness must there be in him to overcome our want of preciousness! What a sweet savour to put away our ill savour! What a cleansing power in his blood to take away sin such as ours! and what glory in his righteousness to make such unacceptable creatures to be accepted in the Beloved! Mark, believer, how sure and unchanging must be our acceptance, since it is <i>in him</i>! Take care that you never doubt your acceptance in Jesus. You cannot be accepted without Christ; but, when you have received his merit, you cannot be unaccepted. Notwithstanding all your doubts, and fears, and sins, Jehovah’s gracious eye never looks upon you in anger; though he sees sin in you, in yourself, yet when he looks at you through Christ, he sees no sin. You are always accepted in Christ, are always blessed and dear to the Father’s heart. Therefore lift up a song, and as you see the smoking incense of the merit of the Saviour coming up, this evening, before the sapphire throne, let the incense of your praise go up also."]}