{"verses":[{"passage":"Husbands, love your wives, even as Christ also loved the church.","reference":{"book":"Ephesians","chapter":"5","verse":"25"}}],"reading":["What a golden example Christ gives to his disciples! Few masters could venture to say, “If you would practise my teaching, imitate my life;” but as the life of Jesus is the exact transcript of perfect virtue, he can point to himself as the paragon of holiness, as well as the teacher of it. The Christian should take nothing short of Christ for his model. Under no circumstances ought we to be content unless we reflect the grace which was in him. As a husband, the Christian is to look upon the portrait of Christ Jesus, and he is to paint according to that copy. The true Christian is to be such a husband as Christ was to his church. The love of a husband is <i>special</i>. The Lord Jesus cherishes for the church a peculiar affection, which is set upon her above the rest of mankind: “I pray for them, I pray not for the world.” The elect church is the favourite of heaven, the treasure of Christ, the crown of his head, the bracelet of his arm, the breastplate of his heart, the very centre and core of his love. A husband should love his wife with a <i>constant</i> love, for thus Jesus loves his church. He does not vary in his affection. He may change in his display of affection, but the affection itself is still the same. A husband should love his wife with an <i>enduring</i> love, for nothing “shall be able to separate us from the love of God, which is in Christ Jesus our Lord.” A true husband loves his wife with a <i>hearty</i> love, fervent and intense. It is not mere lip-service. Ah! beloved, what more could Christ have done in proof of his love than he has done? Jesus has a <i>delighted </i><i>love</i> towards his spouse: He prizes her affection, and delights in her with sweet complacence. Believer, you wonder at Jesus’ love; you admire it—<i>are you imitating it</i>? In your domestic relationships is the rule and measure of your love—“<i>even as Christ loved the church</i>?”"]}