{"verses":[{"passage":"Who hath blessed us with all spiritual blessings.","reference":{"book":"Ephesians","chapter":"1","verse":"3"}}],"reading":["All the goodness of the past, the present, and the future, Christ bestows upon his people. In the mysterious ages of the past the Lord Jesus was his Father’s first elect, and in his <i>election</i> he gave us an interest, for we were chosen in him from before the foundation of the world. He had from all eternity the prerogatives of <i>Sonship</i>, as his Father’s only-begotten and well-beloved Son, and he has, in the riches of his grace, by adoption and regeneration, elevated us to sonship also, so that to us he has given “power to become the sons of God.” The <i>eternal covenant</i>, based upon suretiship and confirmed by oath, is ours, for our strong consolation and security. In the <i>everlasting settlements of predestinating </i><i>wisdom</i> and omnipotent decree, the eye of the Lord Jesus was ever fixed on us; and we may rest assured that in the whole roll of destiny there is not a line which militates against the interests of his redeemed. The <i>great betrothal</i> of the Prince of Glory is ours, for it is to us that he is affianced, as the sacred nuptials shall ere long declare to an assembled universe. The <i>marvellous incarnation</i> of the God of heaven, with all the amazing condescension and humiliation which attended it, is ours. The bloody sweat, the scourge, the cross, are ours forever. Whatever blissful consequences flow from <i>perfect </i><i>obedience, finished atonement, resurrection, ascension, or </i><i>intercession</i>, all are ours by his own gift. Upon his breastplate he is now bearing our names; and in his authoritative pleadings at the throne he remembers our persons and pleads our cause. His <i>dominion</i> over principalities and powers, and his absolute majesty in heaven, he employs for the benefit of them who trust in him. His high estate is as much at our service as was his condition of abasement. He who gave himself for us in the depths of woe and death, doth not withdraw the grant now that he is enthroned in the highest heavens."]}