{"verses":[{"passage":"Made perfect.","reference":{"book":"Hebrews","chapter":"12","verse":"23"}}],"reading":["Recollect that there are two kinds of perfection which the Christian needs—the perfection of justification in the person of Jesus, and the perfection of sanctification wrought in him by the Holy Spirit. At present, corruption yet remains even in the breasts of the regenerate—experience soon teaches us this. Within us are still lusts and evil imaginations. But I rejoice to know that the day is coming when God shall finish the work which he has begun; and he shall present my soul, not only perfect in Christ, but perfect through the Spirit, without spot or blemish, or any such thing. Can it be true that this poor sinful heart of mine is to become holy even as God is holy? Can it be that this spirit, which often cries, “O wretched man that I am! who shall deliver me from the body of this sin and death?” shall get rid of sin and death—that I shall have no evil things to vex my ears, and no unholy thoughts to disturb my peace? Oh, happy hour! may it be hastened! When I cross the Jordan, the work of sanctification will be finished; but not till that moment shall I even claim perfection in myself. Then my spirit shall have its last baptism in the Holy Spirit’s fire. Methinks I long to die to receive that last and final purification which shall usher me into heaven. Not an angel more pure than I shall be, for I shall be able to say, in a double sense, “I am clean,” through Jesus’ blood, and through the Spirit’s work. Oh, how should we extol the power of the Holy Ghost in thus making us fit to stand before our Father in heaven! Yet let not the hope of perfection hereafter make us content with imperfection now. If it does this, our hope cannot be genuine; for a good hope is a purifying thing, even now. The work of grace must be <i>abiding </i><i>in us now</i> or it cannot be <i>perfected then</i>. Let us pray to “be filled with the Spirit,” that we may bring forth <i>increasingly</i> the fruits of righteousness."]}