{"verses":[{"passage":"There is corn in Egypt.","reference":{"book":"Genesis","chapter":"42","verse":"2"}}],"reading":["Famine pinched all the nations, and it seemed inevitable that Jacob and his family should suffer great want; but the God of providence, who never forgets the objects of electing love, had stored a granary for his people by giving the Egyptians warning of the scarcity, and leading them to treasure up the grain of the years of plenty. Little did Jacob expect deliverance from Egypt, but there was the corn in store for him. Believer, though all things are apparently against thee, rest assured that God has made a reservation on thy behalf; in the roll of thy griefs there is a saving clause. Somehow he will deliver thee, and somewhere he will provide for thee. The quarter from which thy rescue shall arise may be a very unexpected one, but help will assuredly come in thine extremity, and thou shalt magnify the name of the Lord. If men do not feed thee, ravens shall; and if earth yield not wheat, heaven shall drop with manna. Therefore be of good courage, and rest quietly in the Lord. God can make the sun rise in the west if he pleases, and make the source of distress the channel of delight. The corn in Egypt was all in the hands of the beloved Joseph; he opened or closed the granaries at will. And so the riches of providence are all in the absolute power of our Lord Jesus, who will dispense them liberally to his people. Joseph was abundantly ready to succour his own family; and Jesus is unceasing in his faithful care for his brethren. Our business is to go after the help which is provided for us: we must not sit still in despondency, but bestir ourselves. Prayer will bear us soon into the presence of our royal Brother: once before his throne we have only to ask and have: his stores are not exhausted; there is corn still: his heart is not hard, he will give the corn to us. Lord, forgive our unbelief, and this evening constrain us to draw largely from thy fulness and receive grace for grace."]}