{"verses":[{"passage":"I pray not that thou shouldst take them out of the world.","reference":{"book":"John","chapter":"17","verse":"15"}}],"reading":["It is a sweet and blessed event which will occur to all believers in God’s own time—the going home to be with Jesus. In a few more years the Lord’s soldiers, who are now fighting “the good fight of faith” will have done with conflict, and have entered into the joy of their Lord. But although Christ prays that his people may eventually be with him where he is, he does not ask that they may be taken at once away from this world to heaven. He wishes them to stay here. Yet how frequently does the wearied pilgrim put up the prayer, “O that I had wings like a dove! for then would I fly away and be at rest;” but Christ does not pray like that, he leaves us in his Father’s hands, until, like shocks of corn fully ripe, we shall each be gathered into our Master’s garner. Jesus does not plead for our instant removal by death, for to abide in the flesh is needful for others if not profitable for ourselves. He asks that we may be kept from evil, but he never asks for us to be admitted to the inheritance in glory till we are of full age. Christians often want to die when they have any trouble. Ask them why, and they tell you, “Because we would be with the Lord.” We fear it is not so much because they are longing to be with the Lord, as because they desire to get rid of their troubles; else they would feel the same wish to die at other times when not under the pressure of trial. They want to go home, not so much for the Saviour’s company, as to be at rest. Now it is quite right to desire to depart if we can do it in the same spirit that Paul did, because to be with Christ is far better, but the wish to escape from trouble is a selfish one. Rather let your care and wish be to glorify God by your life here as long as he pleases, even though it be in the midst of toil, and conflict, and suffering, and leave him to say when “it is enough.”"]}