{"verses":[{"passage":"Only be thou strong and very courageous.","reference":{"book":"Joshua","chapter":"1","verse":"7"}}],"reading":["Our God’s tender love for his servants makes him concerned for the state of their inward feelings. He desires them to be of good courage. Some esteem it a small thing for a believer to be vexed with doubts and fears, but God thinks not so. From this text it is plain that our Master would not have us entangled with fears. He would have us without carefulness, without doubt, without cowardice. Our Master does not think so lightly of our unbelief as we do. When we are desponding we are subject to a grievous malady, not to be trifled with, but to be carried at once to the beloved Physician. Our Lord loveth not to see our countenance sad. It was a law of Ahasuerus that no one should come into the king’s court dressed in mourning: this is not the law of the King of kings, for we may come mourning as we are; but still he would have us put off the spirit of heaviness, and put on the garment of praise, for there is much reason to rejoice. The Christian man ought to be of a courageous spirit, in order that he may glorify the Lord by enduring trials in an heroic manner. If he be fearful and fainthearted, <i>it will </i><i>dishonour his God</i>. Besides, <i>what a bad example it is</i>. This disease of doubtfulness and discouragement is an epidemic which soon spreads amongst the Lord’s flock. One downcast believer makes twenty souls sad. Moreover, unless your courage is kept up, <i>Satan will be too much for you</i>. Let your spirit be joyful in God your Saviour, the joy of the Lord shall be your strength, and no fiend of hell shall make headway against you; but cowardice throws down the banner. Moreover, <i>labour is </i><i>light</i> to a man of cheerful spirit; and <i>success waits upon </i><i>cheerfulness</i>. The man who toils, rejoicing in his God, believing with all his heart, has success guaranteed. He who sows in hope shall reap in joy; therefore, dear reader, “be thou strong, and very courageous.”"]}