{"verses":[{"passage":"He shall gather the lambs with his arm, and carry them in his bosom.","reference":{"book":"Isaiah","chapter":"40","verse":"11"}}],"reading":["Who is he of whom such gracious words are spoken? He is <span style=\"font-variant:small-caps\" id=\"d0514pm-p3.1\">the Good Shepherd</span>. <i>Why</i> doth he carry the lambs in his bosom? Because <i>He hath a tender heart, and any weakness at once melts his </i><i>heart</i>. The sighs, the ignorance, the feebleness of the little ones of his flock draw forth his compassion. <i>It is his </i><i>office</i>, as a faithful High Priest, to consider the weak. Besides, <i>he purchased them with blood, they are his </i><i>property</i>: he must and will care for <i>that</i> which cost him so dear. Then he is <i>responsible for each lamb</i>, bound by covenant engagements not to lose one. Moreover, <i>they are all a </i><i>part of his glory and reward</i>.","But how may we understand the expression, “He will <i>carry</i> them”? Sometimes he carries them by <i>not permitting them to </i><i>endure much trial</i>. Providence deals tenderly with them. Often they are “carried” by being filled with <i>an unusual </i><i>degree of love</i>, so that they bear up and stand fast. Though their knowledge may not be deep, they have great sweetness in what they do know. Frequently he “carries” them by giving them <i>a very simple faith</i>, which takes the promise just as it stands, and believingly runs with every trouble straight to Jesus. The simplicity of their faith gives them an unusual degree of confidence, which carries them above the world.","“He carries the lambs <i>in his bosom</i>.” Here is <i>boundless </i><i>affection</i>. Would he put them in his bosom if he did not love them much? Here is <i>tender nearness</i>: so near are they, that they could not possibly be nearer. Here is <i>hallowed </i><i>familiarity</i>: there are precious love-passages between Christ and his weak ones. Here is <i>perfect safety</i>: in his bosom who can hurt them? They must hurt the Shepherd first. Here is <i>perfect rest and sweetest comfort</i>. Surely we are not sufficiently sensible of the infinite tenderness of Jesus!"]}