{"verses":[{"passage":"Who giveth us richly all things to enjoy.","reference":{"book":"1 Timothy","chapter":"6","verse":"17"}}],"reading":["Our Lord Jesus is ever giving, and does not for a solitary instant withdraw his hand. As long as there is a vessel of grace not yet full to the brim, the oil shall not be stayed. He is a sun ever-shining; he is manna always falling round the camp; he is a rock in the desert, ever sending out streams of life from his smitten side; the rain of his grace is always dropping; the river of his bounty is ever-flowing, and the well-spring of his love is constantly overflowing. As the King can never die, so his grace can never fail. Daily we pluck his fruit, and daily his branches bend down to our hand with a fresh store of mercy. There are seven feast-days in his weeks, and as many as are the days, so many are the banquets in his years. Who has ever returned from his door unblessed? Who has ever risen from his table unsatisfied, or from his bosom un-emparadised? His mercies are new every morning and fresh every evening. Who can know the number of his benefits, or recount the list of his bounties? Every sand which drops from the glass of time is but the tardy follower of a myriad of mercies. The wings of our hours are covered with the silver of his kindness, and with the yellow gold of his affection. The river of time bears from the mountains of eternity the golden sands of his favour. The countless stars are but as the standard bearers of a more innumerable host of blessings. Who can count the dust of the benefits which he bestows on Jacob, or tell the number of the fourth part of his mercies towards Israel? How shall my soul extol him who daily loadeth us with benefits, and who crowneth us with loving-kindness? O that my praise could be as ceaseless as his bounty! O miserable tongue, how canst thou be silent? Wake up, I pray thee, lest I call thee no more my glory, but my shame. “Awake, psaltery and harp: I myself will awake right early.”"]}