{"verses":[{"passage":"Who healeth all thy diseases.","reference":{"book":"Psalm","chapter":"103","verse":"3"}}],"reading":["Humbling as is the statement, yet the fact is certain, that we are all more or less suffering under the disease of sin. What a comfort to know that we have a great Physician who is both able and willing to heal us! Let us think of him awhile tonight. His cures are very <i>speedy</i>—there is life in a look at him; his cures are <i>radical</i>—he strikes at the centre of the disease; and hence, his cures are sure and certain. He never fails, and <i>the disease never returns</i>. There is no relapse where Christ heals; no fear that his patients should be merely patched up for a season, he makes new men of them: a new heart also does he give them, and a right spirit does he put within them. He is well skilled in <i>all</i> diseases. Physicians generally have some <i>speciality</i>. Although they may know a little about almost all our pains and ills, there is usually one disease which they have studied above all others; but Jesus Christ is thoroughly acquainted with the whole of human nature. He is as much at home with one sinner as with another, and never yet did he meet with an out-of-the-way case that was difficult to him. He has had extraordinary complications of strange diseases to deal with, but he has known exactly with one glance of his eye how to treat the patient. He is the only universal doctor; and the medicine he gives is the only true catholicon, healing in every instance. Whatever our spiritual malady may be, we should apply at once to this Divine Physician. There is no brokenness of heart which Jesus cannot bind up. “His blood cleanseth from all sin.” We have but to think of the myriads who have been delivered from all sorts of diseases through the power and virtue of his touch, and we shall joyfully put ourselves in his hands. We trust him, and sin dies; we love him, and grace lives; we wait for him and grace is strengthened; we see him as he is, and grace is perfected forever."]}