{"verses":[{"passage":"Continue in the faith.","reference":{"book":"Acts","chapter":"14","verse":"22"}}],"reading":["Perseverance is the badge of true saints. The Christian life is not a <i>beginning</i> only in the ways of God, but also a <i>continuance</i> in the same as long as life lasts. It is with a Christian as it was with the great Napoleon: he said, “Conquest has made me what I am, and conquest must maintain me.” So, under God, dear brother in the Lord, conquest has made you what you are, and conquest must sustain you. Your motto must be, “Excelsior.” He only is a true conqueror, and shall be crowned at the last, who continueth till war’s trumpet is blown no more. Perseverance is, therefore, the target of all our spiritual enemies. The <i>world</i> does not object to your being a Christian for a time, if she can but tempt you to cease your pilgrimage, and settle down to buy and sell with her in Vanity Fair. The <i>flesh</i> will seek to ensnare you, and to prevent your pressing on to glory. “It is weary work being a pilgrim; come, give it up. Am I always to be mortified? Am I never to be indulged? Give me at least a furlough from this constant warfare.” <i>Satan</i> will make many a fierce attack on your perseverance; it will be the mark for all his arrows. He will strive to hinder you <i>in </i><i>service</i>: he will insinuate that you are doing no good; and that you want rest. He will endeavour to make you weary of <i>suffering</i>, he will whisper, “Curse God, and die.” Or he will attack your <i>steadfastness</i>: “What is the good of being so zealous? Be quiet like the rest; sleep as do others, and let your lamp go out as the other virgins do.” Or he will assail your <i>doctrinal sentiments</i>: “Why do you hold to these denominational creeds? Sensible men are getting more liberal; they are removing the old landmarks: fall in with the times.” Wear your shield, Christian, therefore, close upon your armour, and cry mightily unto God, that by his Spirit you may endure to the end."]}