{"verses":[{"passage":"So Mephibosheth dwelt in Jerusalem: for he did eat continually at the king’s table; and was lame on both his feet.","reference":{"book":"2 Samuel","chapter":"9","verse":"13"}}],"reading":["Mephibosheth was no great ornament to a royal table, yet he had a continual place at David’s board, because the king could see in his face the features of the beloved Jonathan. Like Mephibosheth, we may cry unto the King of Glory, “What is thy servant, that thou shouldst look upon such a dead dog as I am?” but still the Lord indulges us with most familiar intercourse with himself, because he sees in our countenances the remembrance of his dearly-beloved Jesus. The Lord’s people are <i>dear for another’s sake</i>. Such is the love which the Father bears to his only begotten, that for his sake he raises his lowly brethren from poverty and banishment, to courtly companionship, noble rank, and royal provision. Their <i>deformity shall not rob them of their privileges</i>. Lameness is no bar to sonship; the cripple is as much the heir as if he could run like Asahel. Our right does not limp, though our might may. A king’s table is a noble hiding-place for lame legs, and at the gospel feast we learn to glory in infirmities, because the power of Christ resteth upon us. Yet grievous <i>disability </i><i>may mar the persons of the best-loved saints</i>. Here is one feasted by David, and yet so lame in both his feet that he could not go up with the king when he fled from the city, and was therefore maligned and injured by his servant Ziba. Saints whose faith is weak, and whose knowledge is slender, are great losers; they are exposed to many enemies, and cannot follow the king whithersoever he goeth. This <i>disease frequently arises from </i><i>falls</i>. Bad nursing in their spiritual infancy often causes converts to fall into a despondency from which they never recover, and sin in other cases brings broken bones. Lord, help the lame to leap like an hart, and satisfy all thy people with the bread of thy table!"]}