{"verses":[{"passage":"Fear not to go down into Egypt; for I will there make of thee a great nation: I will go down with thee into Egypt; and I will also surely bring thee up again.","reference":{"book":"Genesis","chapter":"46","verse":"3,4"}}],"reading":["Jacob must have shuddered at the thought of leaving the land of his father’s sojourning, and dwelling among heathen strangers. It was <i>a new scene, and likely to be a trying </i><i>one</i>: who shall venture among couriers of a foreign monarch without anxiety? Yet the way was <i>evidently appointed</i> for him, and therefore he resolved to go. This is frequently the position of believers now—they are called to perils and temptations altogether untried: at such seasons <i>let them </i><i>imitate Jacob’s example</i> by offering sacrifices of prayer unto God, and seeking his direction; let them not take a step until they have waited upon the Lord for his blessing: then they <i>will have Jacob’s companion</i> to be their friend and helper. How blessed to feel assured that the Lord is with us in all our ways, and condescends to go down into our humiliations and banishments with us! Even beyond the ocean our Father’s love beams like the sun in its strength. We cannot hesitate to go where Jehovah promises his presence; even the valley of deathshade grows bright with the radiance of this assurance. Marching onwards with faith in their God, believers <i>shall have </i><i>Jacob’s promise</i>. They shall be brought up again, whether it be from the troubles of life or the chambers of death. Jacob’s seed came out of Egypt in due time, and so shall all the faithful pass unscathed through the tribulation of life, and the terror of death. Let us <i>exercise Jacob’s confidence. “Fear </i><i>not</i>,” is the Lord’s command and his divine encouragement to those who at his bidding are launching upon new seas; the divine presence and preservation forbid so much as one unbelieving fear. Without our God we should fear to move; but when he bids us to, it would be dangerous to tarry. Reader, go forward, and fear not."]}