{"verses":[{"passage":"Afterward.","reference":{"book":"Hebrews","chapter":"12","verse":"11"}}],"reading":["How happy are tried Christians, <i>afterwards</i>. No calm more deep than that which succeeds a storm. Who has not rejoiced in clear shinings after rain? Victorious banquets are for well-exercised soldiers. After killing the lion we eat the honey; after climbing the Hill Difficulty, we sit down in the arbour to rest; after traversing the Valley of Humiliation, after fighting with Apollyon, the shining one appears, with the healing branch from the tree of life. Our sorrows, like the passing keels of the vessels upon the sea, leave a silver line of holy light behind them “afterwards.” It is peace, sweet, deep peace, which follows the horrible turmoil which once reigned in our tormented, guilty souls. See, then, the happy estate of a Christian! He has his best things last, and he therefore in this world receives his worst things first. But even his worst things are “afterward” good things, harsh ploughings yielding joyful harvests. Even now he grows rich by his losses, he rises by his falls, he lives by dying, and becomes full by being emptied; if, then, his grievous afflictions yield him so much peaceable fruit in this life, what shall be the full vintage of joy “afterwards” in heaven? If his dark nights are as bright as the world’s days, what shall his days be? If even his starlight is more splendid than the sun, what must his sunlight be? If he can sing in a dungeon, how sweetly will he sing in heaven! If he can praise the Lord in the fires, how will he extol him before the eternal throne! If evil be good to him <i>now</i>, what will the overflowing goodness of God be to him <i>then</i>? Oh, blessed “afterward!” Who would not be a Christian? Who would not bear the present cross for the crown which cometh afterwards? But herein is work for patience, for the rest is not for today, nor the triumph for the present, but “afterward.” Wait, O soul, and let patience have her perfect work."]}