{"verses":[{"passage":"The Lord will perfect that which concerneth me.","reference":{"book":"Psalm","chapter":"138","verse":"8"}}],"reading":["Most manifestly the confidence which the Psalmist here expressed was a <i>divine confidence</i>. He did not say, “<i>I</i> have grace enough to perfect that which concerneth me—my faith is so steady that it will not stagger—my love is so warm that it will never grow cold—my resolution is so firm that nothing can move it”; no, his dependence was on the Lord alone. If we indulge in any confidence which is not grounded on the Rock of Ages, our confidence is worse than a dream, it will fall upon us, and cover us with its ruins, to our sorrow and confusion. All that Nature spins time will unravel, to the eternal confusion of all who are clothed therein. The Psalmist was wise, he rested upon nothing short of the <i>Lord's</i> work. It is the Lord who has begun the good work within us; it is he who has carried it on; and if he does not finish it, it never will be complete. If there be one stitch in the celestial garment of our righteousness which we are to insert ourselves, then we are lost; but this is our confidence, the Lord who began will perfect. He <i>has</i> done it all, <i>must</i> do it all, and <i>will</i> do it all. Our confidence must not be in what we have done, nor in what we have resolved to do, but entirely in what <i>the Lord</i> will do. Unbelief insinuates—“You will never be able to stand. Look at the evil of your heart, you can never conquer sin; remember the sinful pleasures and temptations of the world that beset you, you will be certainly allured by them and led astray.” Ah! yes, we should indeed perish if left to our own strength. If we had alone to navigate our frail vessels over so rough a sea, we might well give up the voyage in despair; but, thanks be to God, he will perfect that which concerneth us, and bring us to the desired haven. We can never be too confident when we confide in him alone, and never too much concerned to <i>have such</i> a trust."]}