{"verses":[{"passage":"Acquaint now thyself with him.","reference":{"book":"Job","chapter":"22","verse":"21"}}],"reading":["If we would rightly “acquaint ourselves with God, and be at peace,” we must know him as he has revealed himself, not only in <i>the unity of his essence and subsistence</i>, but also in <i>the </i><i>plurality of his persons</i>. God said, “Let us make man in our own image”—let not man be content until he knows something of the “us” from whom his being was derived. Endeavour to know the Father; bury your head in his bosom in deep repentance, and confess that you are not worthy to be called his son; receive the kiss of his love; let the ring which is the token of his eternal faithfulness be on your finger; sit at his table and let your heart make merry in his grace. Then press forward and seek to know much of <i>the Son</i> of God who is the brightness of his Father’s glory, and yet in unspeakable condescension of grace became man for our sakes; know him in the singular complexity of his nature: eternal God, and yet suffering, finite man; follow him as he walks the waters with the tread of deity, and as he sits upon the well in the weariness of humanity. Be not satisfied unless you know much of Jesus Christ as your Friend, your Brother, your Husband, your all. Forget not <i>the Holy </i><i>Spirit</i>; endeavour to obtain a clear view of his nature and character, his attributes, and his works. Behold that Spirit of the Lord, who first of all moved upon chaos, and brought forth order; who now visits the chaos of your soul, and creates the order of holiness. Behold him as the Lord and giver of spiritual life, the Illuminator, the Instructor, the Comforter, and the Sanctifier. Behold him as, like holy unction, he descends upon the head of Jesus, and then afterwards rests upon <i>you</i> who are as the skirts of his garments. Such an intelligent, scriptural, and experimental belief in the Trinity in Unity is yours if you truly know God; and such knowledge <i>brings peace </i><i>indeed</i>."]}