{"verses":[{"passage":"And they rose up the same hour, and returned to Jerusalem ... and they told what things were done in the way, and how he was known of them.","reference":{"book":"Luke","chapter":"24","verse":"33,35"}}],"reading":["When the two disciples had reached Emmaus, and were refreshing themselves at the evening meal, the mysterious stranger who had so enchanted them upon the road, took bread and brake it, made himself known to them, and then vanished out of their sight. They had constrained him to abide with them, because the day was far spent; but now, although it was much later, their love was a lamp to their feet, yea, wings also; they forgot the darkness, their weariness was all gone, and forthwith they journeyed back the threescore furlongs to tell the gladsome news of a risen Lord, who had appeared to them by the way. They reached the Christians in Jerusalem, and were received by a burst of joyful news before they could tell their own tale. These early Christians were all on fire to speak of Christ’s resurrection, and to proclaim what they knew of the Lord; they made common property of their experiences. This evening let their example impress us deeply. We too must bear our witness concerning Jesus. John’s account of the sepulchre needed to be supplemented by Peter; and Mary could speak of something further still; combined, we have a full testimony from which nothing can be spared. We have each of us peculiar gifts and special manifestations; but the one object God has in view is the perfecting of the whole body of Christ. We must, therefore, bring our spiritual possessions and lay them at the apostle’s feet, and make distribution unto all of what God has given to us. Keep back no part of the precious truth, but speak what you know, and testify what you have seen. Let not the toil or darkness, or possible unbelief of your friends, weigh one moment in the scale. Up, and be marching to the place of duty, and there tell what great things God has shown to your soul."]}