{"verses":[{"passage":"Saying, This is the blood of the testament which God hath enjoined unto you.","reference":{"book":"Hebrews","chapter":"9","verse":"20"}}],"reading":["There is a strange power about the very name of blood, and the sight of it is always affecting. A kind heart cannot bear to see a sparrow bleed, and unless familiarized by use, turns away with horror at the slaughter of a beast. As to the blood of men, it is a consecrated thing: it is murder to shed it in wrath, it is a dreadful crime to squander it in war. Is this solemnity occasioned by the fact that the blood is the life, and the pouring of it forth the token of death? We think so. When we rise to contemplate the blood of the Son of God, our awe is yet more increased, and we shudder as we think of the guilt of sin, and the terrible penalty which the Sin-bearer endured. Blood, always precious, is priceless when it streams from Immanuel’s side. The blood of Jesus seals the <i>covenant</i> of grace, and makes it forever sure. Covenants of old were made by sacrifice, and the everlasting covenant was ratified in the same manner. Oh, the delight of being saved upon the sure foundation of divine engagements which cannot be dishonoured! Salvation by the works of the law is a frail and broken vessel whose shipwreck is sure; but the covenant vessel fears no storms, for the blood ensures the whole. The blood of Jesus made his <i>testament</i> valid. Wills are of no power unless the testators die. In this light the soldier’s spear is a blessed aid to faith, since it proved our Lord to be really dead. Doubts upon that matter there can be none, and we may boldly appropriate the legacies which he has left for his people. Happy they who see their title to heavenly blessings assured to them by a dying Saviour. But has this blood no voice to us? Does it not bid us sanctify ourselves unto him by whom we have been redeemed? Does it not call us to newness of life, and incite us to entire consecration to the Lord? O that the power of the blood might be known, and felt in us this night!"]}