{"verses":[{"passage":"Joshua the high priest standing before the angel of the Lord.","reference":{"book":"Zechariah","chapter":"3","verse":"1"}}],"reading":["In Joshua <i>the high priest</i> we see a picture of each and every child of God, who has been made nigh by the blood of Christ, and has been taught to minister in holy things, and enter into that which is within the veil. Jesus has made us priests and kings unto God, and even here upon earth we exercise the priesthood of consecrated living and hallowed service. But this high priest is said to be “<i>standing</i> before the angel of the Lord,” that is, standing to minister. This should be the perpetual position of every true believer. Every place is now God’s temple, and his people can as truly serve him in their daily employments as in his house. They are to be always “ministering,” offering the spiritual sacrifice of prayer and praise, and presenting themselves a “living sacrifice.” But notice where it is that Joshua stands to minister, it is <i>before the angel</i> of Jehovah. It is only through a mediator that we poor defiled ones can ever become priests unto God. I present what I have before the messenger, the angel of the covenant, the Lord Jesus; and through him my prayers find acceptance wrapped up in his prayers; my praises become sweet as they are bound up with bundles of myrrh, and aloes, and cassia from Christ’s own garden. If I can bring him nothing but my tears, he will put them with his own tears in his own bottle for he once wept; if I can bring him nothing but my groans and sighs, he will accept these as an acceptable sacrifice, for he once was broken in heart, and sighed heavily in spirit. I myself, standing in him, am accepted in the Beloved; and all my polluted works, though in themselves only objects of divine abhorrence, are so received, that God smelleth a sweet savour. He is content and I am blessed. See, then, the position of the Christian—“a priest—standing—before the angel of the Lord.”"]}