{"verses":[{"passage":"It is enough for the disciple that he be as his master.","reference":{"book":"Matthew","chapter":"10","verse":"25"}}],"reading":["No one will dispute this statement, for it would be unseemly for the servant to be exalted above his Master. When our Lord was on earth, what was the treatment he received? Were his claims acknowledged, his instructions followed, his perfections worshipped, by those whom he came to bless? No; “He was despised and rejected of men.” Outside the camp was his place: cross-bearing was his occupation. Did the world yield him solace and rest? “Foxes have holes, and the birds of the air have nests; but the Son of man hath not where to lay his head.” This inhospitable country afforded him no shelter: it cast him out and crucified him. Such—if you are a follower of Jesus, and maintain a consistent, Christ-like walk and conversation—you must expect to be the lot of that part of your spiritual life which, in its outward development, comes under the observation of men. They will treat it as they treated the Saviour—they will despise it. Dream not that worldlings will admire you, or that the more holy and the more Christ-like you are, the more peaceably people will act towards you. They prized not the polished gem, how should they value the jewel in the rough? “If they have called the Master of the house Beelzebub, how much more shall they call them of his household?” If we were more like Christ, we should be more hated by his enemies. It were a sad dishonour to a child of God to be the world’s favourite. It is a very ill omen to hear a wicked world clap its hands and shout “Well done” to the Christian man. He may begin to look to his character, and wonder whether he has not been doing wrong, when the unrighteous give him their approbation. Let us be true to our Master, and have no friendship with a blind and base world which scorns and rejects him. Far be it from us to seek a crown of honour where our Lord found a coronet of thorns."]}