{"verses":[{"passage":"The glorious Lord will be unto us a place of broad rivers and streams.","reference":{"book":"Isaiah","chapter":"33","verse":"21"}}],"reading":["Broad rivers and streams produce fertility, and abundance in the land. Places near broad rivers are remarkable for the variety of their plants and their plentiful harvests. God is all this to his Church. Having God she has <i>abundance</i>. What can she ask for that he will not give her? What want can she mention which he will not supply? “In this mountain shall the Lord of Hosts make unto all people a feast of fat things.” Want ye the bread of life? It drops like manna from the sky. Want ye refreshing streams? The rock follows you, and that Rock is Christ. If you suffer any want it is your own fault; if you are straitened you are not straitened in him, but in your own bowels. Broad rivers and streams also point to <i>commerce</i>. Our glorious Lord is to us a place of heavenly merchandise. Through our Redeemer we have commerce with the past; the wealth of Calvary, the treasures of the covenant, the riches of the ancient days of election, the stores of eternity, all come to us down the broad stream of our gracious Lord. We have commerce, too, with the future. What galleys, laden to the water’s edge, come to us from the millennium! What visions we have of the days of heaven upon earth! Through our glorious Lord we have commerce with angels; communion with the bright spirits washed in blood, who sing before the throne; nay, better still, we have fellowship with the Infinite One. Broad rivers and streams are specially intended to set forth the idea of <i>security</i>. Rivers were of old a defence. Oh! beloved, what a defence is God to his Church! The devil cannot cross this broad river of God. How he wishes he could turn the current, but fear not, for God abideth immutably the same. Satan may worry, but he cannot destroy us; no galley with oars shall invade our river, neither shall gallant ship pass thereby."]}