{"verses":[{"passage":"His place of defence shall be the munitions of rocks: bread shall be given him; his waters shall be sure.","reference":{"book":"Isaiah","chapter":"33","verse":"16"}}],"reading":["Do you doubt, O Christian, do you doubt as to whether God will fulfil his promise? Shall the munitions of rock be carried by storm? Shall the storehouses of heaven fail? Do you think that your heavenly Father, though he knoweth that you have need of food and raiment, will yet forget you? When not a sparrow falls to the ground without your Father, and the very hairs of your head are all numbered, will you mistrust and doubt him? Perhaps your affliction will continue upon you till you dare to trust your God, and then it shall end. Full many there be who have been tried and sore vexed till at last they have been driven in sheer desperation to exercise faith in God, and the moment of their faith has been the instant of their deliverance; they have seen whether God would keep his promise or not. Oh, I pray you, doubt him no longer! Please not Satan, and vex not yourself by indulging any more those hard thoughts of God. Think it not a light matter to doubt Jehovah. Remember, it is a <i>sin</i>; and not a little sin either, but in the highest degree criminal. The angels never doubted him, nor the devils either: we alone, out of all the beings that God has fashioned, dishonour him by unbelief, and tarnish his honour by mistrust. Shame upon us for this! Our God does not deserve to be so basely suspected; in our past life we have proved him to be true and faithful to his word, and with so many instances of his love and of his kindness as we have received, and are daily receiving, at his hands, it is base and inexcusable that we suffer a doubt to sojourn within our heart. May we henceforth wage constant war against doubts of our God—enemies to our peace and to his honour; and with an unstaggering faith believe that what he has promised he will also perform. “Lord, I believe, help thou mine unbelief.”"]}