{"verses":[{"passage":"In thy light shall we see light.","reference":{"book":"Psalm","chapter":"36","verse":"9"}}],"reading":["No lips can tell the love of Christ to the heart till Jesus himself shall speak within. Descriptions all fall flat and tame unless the Holy Ghost fills them with life and power; till our Immanuel reveals himself within, the soul sees him not. If you would see the sun, would you gather together the common means of illumination, and seek in that way to behold the orb of day? No, the wise man knoweth that the sun must reveal itself, and only by its own blaze can that mighty lamp be seen. It is so with Christ. “Blessed art thou, Simon Bar-jona:” said he to Peter, “for flesh and blood hath not revealed this unto thee.” Purify flesh and blood by any educational process you may select, elevate mental faculties to the highest degree of intellectual power, yet none of these can reveal Christ. The Spirit of God must come with power, and overshadow the man with his wings, and then in that mystic holy of holies the Lord Jesus must display himself to the sanctified eye, as he doth not unto the purblind sons of men. Christ must be his own mirror. The great mass of this blear-eyed world can see nothing of the ineffable glories of Immanuel. He stands before them without form or comeliness, a root out of a dry ground, rejected by the vain and despised by the proud. Only where the Spirit has touched the eye with eye-salve, quickened the heart with divine life, and educated the soul to a heavenly taste, only there is he understood. “To you that believe he is precious;” to you he is the chief corner-stone, the Rock of your salvation, your all in all; but to others he is “a stone of stumbling and a rock of offence.” Happy are those to whom our Lord manifests himself, for his promise to such is that he will <i>make his abode with them</i>. O Jesus, our Lord, our heart is open, come in, and go out no more forever. Show thyself to us now! Favour us with a glimpse of thine all-conquering charms."]}