{"verses":[{"passage":"Underneath are the everlasting arms.","reference":{"book":"Deuteronomy","chapter":"33","verse":"27"}}],"reading":["God—the eternal God—is himself our support at all times, and especially when we are sinking in deep trouble. There are seasons when the Christian <i>sinks very low in humiliation</i>. Under a deep sense of his great sinfulness, he is humbled before God till he scarcely knows how to pray, because he appears, in his own sight, so worthless. Well, child of God, remember that when thou art at thy worst and lowest, yet “underneath” thee “are everlasting arms.” Sin may drag thee ever so low, but Christ’s great atonement is still under all. You may have descended into the deeps, but you cannot have fallen so low as “the uttermost;” and to the uttermost he saves. Again, the Christian sometimes sinks very deeply in <i>sore trial from </i><i>without</i>. Every earthly prop is cut away. What then? Still underneath him are “the everlasting arms.” He cannot fall so deep in distress and affliction but what the covenant grace of an ever-faithful God will still encircle him. The Christian may be sinking under <i>trouble from within through</i> fierce conflict, but even then he cannot be brought so low as to be beyond the reach of the “everlasting arms”—they are underneath him; and, while thus sustained, all Satan’s efforts to harm him avail nothing.","This assurance of support is a comfort to any <i>weary but </i><i>earnest worker</i> in the service of God. It implies a promise of strength for each day, grace for each need, and power for each duty. And, further, <i>when death comes</i>, the promise shall still hold good. When we stand in the midst of Jordan, we shall be able to say with David, “I will fear no evil, for thou art with me.” We shall descend into the grave, but we shall go no lower, for the eternal arms prevent our further fall. All through life, and at its close, we shall be upheld by the “everlasting arms”—arms that neither flag nor lose their strength, for “the everlasting God fainteth not, neither is weary.”"]}