{"verses":[{"passage":"Thou art from everlasting.","reference":{"book":"Psalm","chapter":"93","verse":"2"}}],"reading":["Christ is <span style=\"font-variant:small-caps\" id=\"d1118pm-p3.1\">Everlasting</span>. Of him we may sing with David, “Thy throne, O God, is forever and ever.” Rejoice, believer, in Jesus Christ, the same yesterday, today, and forever. Jesus always <i>was</i>. The Babe born in Bethlehem was united to the Word, which was in the beginning, by whom all things were made. The title by which Christ revealed himself to John in Patmos was, “Him which is, and which was, and which is to come.” If he were not God from everlasting, we could not so devoutly love him; we could not feel that he had any share in the eternal love which is the fountain of all covenant blessings; but since he was from all eternity with the Father, we trace the stream of divine love to himself equally with his Father and the blessed Spirit. As our Lord always <i>was</i>, so also he is for evermore. Jesus is not dead; “He ever liveth to make intercession for us.” Resort to him in all your times of need, for he is waiting to bless you still. Moreover, Jesus our Lord ever <i>shall be</i>. If God should spare your life to fulfil your full day of threescore years and ten, you will find that his cleansing fountain is still opened, and his precious blood has not lost its power; you shall find that the Priest who filled the healing fount with his own blood, lives to purge you from all iniquity. When only your last battle remains to be fought, you shall find that the hand of your conquering Captain has not grown feeble—the living Saviour shall cheer the dying saint. When you enter heaven you shall find him there bearing the dew of his youth; and through eternity the Lord Jesus shall still remain the perennial spring of joy, and life, and glory to his people. Living waters may you draw from this sacred well! Jesus always was, he always is, he always shall be. He is eternal in all his attributes, in all his offices, in all his might, and willingness to bless, comfort, guard, and crown his chosen people."]}