{"verses":[{"passage":"O that I knew where I might find him!","reference":{"book":"Job","chapter":"23","verse":"3"}}],"reading":["In Job’s uttermost extremity he cried after the Lord. The longing desire of an afflicted child of God is once more to see his Father’s face. His first prayer is not “O that I might be healed of the disease which now festers in every part of my body!” nor even “O that I might see my children restored from the jaws of the grave, and my property once more brought from the hand of the spoiler!” but the first and uppermost cry is, “O that I knew where I might find <span style=\"font-variant:small-caps\" id=\"d1119pm-p3.1\">Him</span>, who is my God! that I might come even to his seat!” God’s children run home when the storm comes on. It is the heaven-born instinct of a gracious soul to seek shelter from all ills beneath the wings of Jehovah. “He that hath made his refuge God,” might serve as the title of a true believer. A hypocrite, when afflicted by God, resents the infliction, and, like a slave, would run from the Master who has scourged him; but not so the true heir of heaven, he kisses the hand which smote him, and seeks shelter from the rod in the bosom of the God who frowned upon him. Job’s desire to commune with God was intensified by the failure of all other sources of consolation. The patriarch turned away from his sorry friends, and looked up to the celestial throne, just as a traveller turns from his empty skin bottle, and betakes himself with all speed to the well. He bids farewell to earth-born hopes, and cries, “O that I knew where I might find my God!” Nothing teaches us so much the preciousness of the Creator, as when we learn the emptiness of all besides. Turning away with bitter scorn from earth’s hives, where we find no honey, but many sharp stings, we rejoice in him whose faithful word is sweeter than honey or the honeycomb. In every trouble we should first seek to realize God’s presence with us. Only let us enjoy his smile, and we can bear our daily cross with a willing heart for his dear sake."]}