{"verses":[{"passage":"And Amaziah said to the man of God, But what shall we do for the hundred talents which I have given to the army of Israel? And the man of God answered, The Lord is able to give thee much more than this.","reference":{"book":"2 Chronicles","chapter":"25","verse":"9"}}],"reading":["A very important question this seemed to be to the king of Judah, and possibly it is of even more weight with the tried and tempted O Christian. To lose money is at no times pleasant, and when principle involves it, the flesh is not always ready to make the sacrifice. “Why lose that which may be so usefully employed? May not the truth itself be bought too dear? What shall we do without it? Remember the children, and our small income!” All these things and a thousand more would tempt the Christian to put forth his hand to unrighteous gain, or stay himself from carrying out his conscientious convictions, when they involve serious loss. All men cannot view these matters in the light of faith; and even with the followers of Jesus, the doctrine of “we must live” has quite sufficient weight.","<i>The Lord is able to give thee much more than this</i> is a very satisfactory answer to the anxious question. Our Father holds the purse-strings, and what we lose for his sake he can repay a thousand-fold. It is ours to obey his will, and we may rest assured that he will provide for us. The Lord will be no man’s debtor at the last. Saints know that a grain of heart's-ease is of more value than a ton of gold. He who wraps a threadbare coat about a good conscience has gained a spiritual wealth far more desirable than any he has lost. God’s smile and a dungeon are enough for a true heart; his frown and a palace would be hell to a gracious spirit. Let the worst come to the worst, let all the talents go, we have not lost our treasure, for that is above, where Christ sitteth at the right hand of God. Meanwhile, even now, the Lord maketh the meek to inherit the earth, and no good thing doth he withhold from them that walk uprightly."]}