{"verses":[{"passage":"Michael and his angels fought against the dragon; and the dragon fought and his angels.","reference":{"book":"Revelation","chapter":"12","verse":"7"}}],"reading":["War always will rage between the two great sovereignties until one or other be crushed. Peace between good and evil is an impossibility; the very pretence of it would, in fact, be the triumph of the powers of darkness. <i>Michael will always </i><i>fight</i>; his holy soul is vexed with sin, and will not endure it. Jesus will always be the dragon’s foe, and that not in a quiet sense, but actively, vigorously, with full determination to exterminate evil. All his servants, whether angels in heaven or messengers on earth, will and must fight; they are born to be warriors—at the cross they enter into covenant never to make truce with evil; they are a warlike company, firm in defence and fierce in attack. The duty of every soldier in the army of the Lord is daily, with all his heart, and soul, and strength, to fight against the dragon.","<i>The dragon and his angels will not decline the affray</i>; they are incessant in their onslaughts, sparing no weapon, fair or foul. We are foolish to expect to serve God without opposition: the more zealous we are, the more sure are we to be assailed by the myrmidons of hell. The church may become slothful, but not so her great antagonist; his restless spirit never suffers the war to pause; he hates the woman’s seed, and would fain devour the church if he could. The servants of Satan partake much of the old dragon’s energy, and are usually an active race. War rages all around, and to dream of peace is dangerous and futile.","Glory be to God, we know the end of the war. The great dragon shall be cast out and forever destroyed, while Jesus and they who are with him shall receive the crown. Let us sharpen our swords tonight, and pray the Holy Spirit to nerve our arms for the conflict. Never battle so important, never crown so glorious. Every man to his post, ye warriors of the cross, and may the Lord tread Satan under your feet shortly!"]}