{"verses":[{"passage":"And ye shall be witnesses unto me.","reference":{"book":"Acts","chapter":"1","verse":"8"}}],"reading":["In order to learn how to discharge your duty as a witness for Christ, look at his example. He is always witnessing: by the well of Samaria, or in the Temple of Jerusalem: by the lake of Gennesaret, or on the mountain’s brow. He is witnessing night and day; his mighty prayers are as vocal to God as his daily services. He witnesses under all circumstances; Scribes and Pharisees cannot shut his mouth; even before Pilate he witnesses a good confession. He witnesses so clearly, and distinctly that there is no mistake in him. Christian, make your life a clear testimony. Be you as the brook wherein you may see every stone at the bottom—not as the muddy creek, of which you only see the surface—but clear and transparent, so that your heart’s love to God and man may be visible to all. You need not say, “I am true:” be true. Boast not of integrity, but be upright. So shall your testimony be such that men cannot help seeing it. Never, for fear of feeble man, restrain your witness. Your lips have been warmed with a coal from off the altar; let them speak as like heaven-touched lips should do. “In the morning sow thy seed, and in the evening withhold not thine hand.” Watch not the clouds, consult not the wind—in season and out of season witness for the Saviour, and if it shall come to pass that for Christ’s sake and the gospel’s you shall endure suffering in any shape, shrink not, but rejoice in the honour thus conferred upon you, that you are counted worthy to suffer with your Lord; and joy also in this—that your sufferings, your losses, and persecutions shall make you a platform, from which the more vigorously and with greater power you shall witness for Christ Jesus. Study your great Exemplar, and be filled with his Spirit. Remember that you need much teaching, much upholding, much grace, and much humility, if your witnessing is to be to your Master’s glory."]}