{"verses":[{"passage":"Seeking the wealth of his people.","reference":{"book":"Esther","chapter":"10","verse":"3"}}],"reading":["Mordecai was a true patriot, and therefore, being exalted to the highest position under Ahasuerus, he used his eminence to promote the prosperity of Israel. In this he was a type of Jesus, who, upon his throne of glory, seeks not his own, but spends his power for his people. It were well if every Christian would be a Mordecai to the church, striving according to his ability for its prosperity. Some are placed in stations of affluence and influence, let them honour their Lord in the high places of the earth, and testify for Jesus before great men. Others have what is far better, namely, close fellowship with the King of kings, let them be sure to plead daily for the weak of the Lord’s people, the doubting, the tempted, and the comfortless. It will redound to their honour if they make much intercession for those who are in darkness and dare not draw nigh unto the mercy seat. Instructed believers may serve their Master greatly if they lay out their talents for the general good, and impart their wealth of heavenly learning to others, by teaching them the things of God. The very least in our Israel may at least <i>seek</i> the welfare of his people; and his desire, if he can give no more, shall be acceptable. It is at once the most Christlike and the most happy course for a believer to cease from living to himself. He who blesses others cannot fail to be blessed himself. On the other hand, to seek our own personal greatness is a wicked and unhappy plan of life, its way will be grievous and its end will be fatal.","Here is the place to ask thee, my friend, whether thou art to the best of thy power seeking the wealth of the church in thy neighbourhood? I trust thou art not doing it mischief by bitterness and scandal, nor weakening it by thy neglect. Friend, unite with the Lord’s poor, bear their cross, do them all the good thou canst, and thou shalt not miss thy reward."]}