{"verses":[{"passage":"For he saith to Moses, I will have mercy on whom I will have mercy, and I will have compassion on whom I will have compassion.","reference":{"book":"Romans","chapter":"9","verse":"15"}}],"reading":["In these words the Lord in the plainest manner claims the right to give or to withhold his mercy according to his own sovereign will. As the prerogative of life and death is vested in the monarch, so the Judge of all the earth has a right to spare or condemn the guilty, as may seem best in his sight. Men by their sins have forfeited all claim upon God; they deserve to perish for their sins—and if they all do so, they have no ground for complaint. If the Lord steps in to save any, he may do so if the ends of justice are not thwarted; but if he judges it best to leave the condemned to suffer the righteous sentence, none may arraign him at their bar. Foolish and impudent are all those discourses about the rights of men to be all placed on the same footing; ignorant, if not worse, are those contentions against discriminating grace, which are but the rebellions of proud human nature against the crown and sceptre of Jehovah. When we are brought to see our own utter ruin and ill desert, and the justice of the divine verdict against sin, we no longer cavil at the truth that the Lord is not bound to save us; we do not murmur if he chooses to save others, as though he were doing us an injury, but feel that if he deigns to look upon us, it will be his own free act of undeserved goodness, for which we shall forever bless his name.","How shall those who are the subjects of divine election sufficiently adore the grace of God? They have no room for boasting, for sovereignty most effectually excludes it. The Lord’s will alone is glorified, and the very notion of human merit is cast out to everlasting contempt. There is no more humbling doctrine in Scripture than that of election, none more promotive of gratitude, and, consequently, none more sanctifying. Believers should not be afraid of it, but adoringly rejoice in it."]}