{"verses":[{"passage":"As ye have received Christ Jesus the Lord.","reference":{"book":"Colossians","chapter":"2","verse":"6"}}],"reading":["The life of faith is represented as <i>receiving—an act which </i><i>implies the very opposite of anything like merit</i>. It is simply the acceptance of a gift. As the earth drinks in the rain, as the sea receives the streams, as night accepts light from the stars, so we, giving nothing, partake freely of the grace of God. The saints are not, by nature, wells, or streams, they are but cisterns into which the living water flows; they are empty vessels into which God pours his salvation. The idea of receiving implies <i>a sense of realization</i>, making the matter a <i>reality</i>. One cannot very well receive a shadow; we receive that which is substantial: so is it in the life of faith, Christ becomes real to us. While we are without faith, Jesus is a mere name to us—a person who lived a long while ago, so long ago that his life is only a history to us now! By an act of faith Jesus becomes a real person in the consciousness of our heart. But receiving also means <i>grasping or getting </i><i>possession of</i>. The thing which I receive becomes my own: I appropriate to myself that which is given. When I receive Jesus, he becomes my Saviour, so mine that neither life nor death shall be able to rob me of him. All this is to receive Christ—to take him as God’s free gift; to realize him in my heart, and to appropriate him as mine.","Salvation may be described as the blind receiving sight, the deaf receiving hearing, the dead receiving life; but we have not only received these blessings, we have received <span style=\"font-variant:small-caps\" id=\"d1108am-p4.1\">Christ Jesus</span> himself. It is true that he gave us life from the dead. He gave us pardon of sin; he gave us imputed righteousness. These are all precious things, but we are not content with them; we have received <i>Christ himself</i>. The Son of God has been poured into us, and we have received him, and appropriated him. What a heartful Jesus must be, for heaven itself cannot contain him!"]}