{"verses":[{"passage":"The love of Christ constraineth us.","reference":{"book":"2 Corinthians","chapter":"5","verse":"14"}}],"reading":["How much owest thou unto my Lord? Has he ever done anything for thee? Has he forgiven thy sins? Has he covered thee with a robe of righteousness? Has he set thy feet upon a rock? Has he established thy goings? Has he prepared heaven for thee? Has he prepared thee for heaven? Has he written thy name in his book of life? Has he given thee countless blessings? Has he laid up for thee a store of mercies, which eye hath not seen nor ear heard? Then do something for Jesus worthy of his love. Give not a mere wordy offering to a dying Redeemer. How will you feel when your Master comes, if you have to confess that you <i>did</i> nothing for him, but kept your love shut up, like a stagnant pool, neither flowing forth to his poor or to his work. Out on such love as that! What do men think of a love which never shows itself in action? Why, they say, “Open rebuke is better than secret love.” Who will accept a love so weak that it does not actuate you to a single deed of self-denial, of generosity, of heroism, or zeal! Think how <i>he</i> has loved you, and given himself for you! Do you know the power of that love? Then let it be like a rushing mighty wind to your soul to sweep out the clouds of your worldliness, and clear away the mists of sin. “For Christ’s sake” be this the tongue of fire that shall sit upon you: “for Christ’s sake” be this the divine rapture, the heavenly afflatus to bear you aloft from earth, the divine spirit that shall make you bold as lions and swift as eagles in your Lord’s service. Love should give wings to the feet of service, and strength to the arms of labour. Fixed on God with a constancy that is not to be shaken, resolute to honour him with a determination that is not to be turned aside, and pressing on with an ardour never to be wearied, let us manifest the constraints of love to Jesus. May the divine lodestone draw us heavenward towards itself."]}