{"verses":[{"passage":"Wherefore hast thou afflicted thy servant?","reference":{"book":"Numbers","chapter":"11","verse":"11"}}],"reading":["Our heavenly Father sends us frequent troubles <i>to try our </i><i>faith</i>. If our faith be worth anything, it will stand the test. Gilt is afraid of fire, but gold is not: the <i>paste</i> gem dreads to be touched by the diamond, but the true jewel fears no test. It is a poor faith which can only trust God when friends are true, the body full of health, and the business profitable; but that is true faith which holds by the Lord’s faithfulness when friends are gone, when the body is sick, when spirits are depressed, and the light of our Father’s countenance is hidden. A faith which can say, in the direst trouble, “Though he slay me, yet will I trust in him,” is heaven-born faith. The Lord afflicts his servants <i>to glorify himself</i>, for he is greatly glorified in the graces of his people, which are his own handiwork. When “tribulation worketh patience; and patience, experience; and experience, hope,” the Lord is honoured by these growing virtues. We should never know the music of the harp if the strings were left untouched; nor enjoy the juice of the grape if it were not trodden in the winepress; nor discover the sweet perfume of cinnamon if it were not pressed and beaten; nor feel the warmth of fire if the coals were not utterly consumed. The wisdom and power of the great Workman are discovered by the trials through which his vessels of mercy are permitted to pass. Present afflictions <i>tend also </i><i>to heighten future joy</i>. There must be shades in the picture to bring out the beauty of the lights. Could we be so supremely blessed in heaven, if we had not known the curse of sin and the sorrow of earth? Will not peace be sweeter after conflict, and rest more welcome after toil? Will not the recollection of past sufferings enhance the bliss of the glorified? There are many other comfortable answers to the question with which we opened our brief meditation, let us muse upon it all day long."]}