{"verses":[{"passage":"He shall take of mine, and shall show it unto you.","reference":{"book":"John","chapter":"16","verse":"15"}}],"reading":["There are times when all the promises and doctrines of the Bible are of no avail, unless a gracious hand shall apply them to us. We are thirsty, but too faint to crawl to the water-brook. When a soldier is wounded in battle it is of little use for him to know that there are those at the hospital who can bind up his wounds, and medicines there to ease all the pains which he now suffers: what he needs is to be carried thither, and to have the remedies applied. It is thus with our souls, and to meet this need there is one, even the Spirit of truth, who takes of the things of Jesus, and applies them to us. Think not that Christ hath placed his joys on heavenly shelves that we may climb up to them for ourselves, but he draws near, and sheds his peace abroad in our hearts. O Christian, if thou art tonight labouring under deep distresses, thy Father does not give thee promises and then leave thee to draw them up from the Word like buckets from a well, but the promises he has written in the Word he will write anew on your heart. He will manifest his love to you, and by his blessed Spirit, dispel your cares and troubles. Be it known unto thee, O mourner, that it is God’s prerogative to wipe every tear from the eye of his people. The good Samaritan did not say, “Here is the wine, and here is the oil for you;” he actually poured in the oil and the wine. So Jesus not only gives you the sweet wine of the promise, but holds the golden chalice to your lips, and pours the life-blood into your mouth. The poor, sick, way-worn pilgrim is not merely strengthened to walk, but he is borne on eagles’ wings. Glorious gospel! which provides everything for the helpless, which draws nigh to us when we cannot reach after it—brings us grace before we seek for grace! Here is as much glory in the giving as in the gift. Happy people who have the Holy Ghost to bring Jesus to them."]}