{"verses":[{"passage":"Jesus saith unto them, Come and dine.","reference":{"book":"John","chapter":"21","verse":"12"}}],"reading":["In these words the believer is invited to a holy nearness to Jesus. “Come and dine,” implies the same table, the same meat; aye, and sometimes it means to sit side by side, and lean our head upon the Saviour’s bosom. It is being brought into the banqueting-house, where waves the banner of redeeming love. “Come and dine,” gives us a vision of <i>union with Jesus</i>, because the only food that we can feast upon when we dine with Jesus is <i>himself</i>. Oh, what union is this! It is a depth which reason cannot fathom, that we thus feed upon Jesus. “He that eateth my flesh, and drinketh my blood, dwelleth in me, and I in him.” It is also an invitation to enjoy <i>fellowship with </i><i>the saints</i>. Christians may differ on a variety of points, but they have all one spiritual appetite; and if we cannot all <i>feel</i> alike, we can all <i>feed</i> alike on the bread of life sent down from heaven. At the table of fellowship with Jesus we are one bread and one cup. As the loving cup goes round we pledge one another heartily therein. Get nearer to Jesus, and you will find yourself linked more and more in spirit to all who are like yourself, supported by the same heavenly manna. If we were more near to Jesus we should be more near to one another. We likewise see in these words the <i>source of strength</i> for every Christian. To look at Christ is to live, but for strength to serve him you must “come and dine.” We labour under much unnecessary weakness on account of neglecting this precept of the Master. We none of us need to put ourselves on low diet; on the contrary, we should fatten on the marrow and fatness of the gospel that we may accumulate strength therein, and urge every power to its full tension in the Master’s service. Thus, then, if you would realize <i>nearness</i> to Jesus, <i>union</i> with Jesus, <i>love</i> to his people and <i>strength from Jesus</i>, “come and dine” with him by faith."]}