{"verses":[{"passage":"He will give grace and glory.","reference":{"book":"Psalm","chapter":"84","verse":"11"}}],"reading":["Bounteous is Jehovah in his nature; to give is his delight. His gifts are beyond measure precious, and are as freely given as the light of the sun. He gives grace to his elect because he wills it, to his redeemed because of his covenant, to the called because of his promise, to believers because they seek it, to sinners because they need it. He gives grace abundantly, seasonably, constantly, readily, sovereignly; doubly enhancing the value of the boon by the manner of its bestowal. Grace in all its forms he freely renders to his people: comforting, preserving, sanctifying, directing, instructing, assisting grace, he generously pours into their souls without ceasing, and he always will do so, whatever may occur. Sickness may befall, but the Lord will give grace; poverty may happen to us, but grace will surely be afforded; death must come but grace will light a candle at the darkest hour. Reader, how blessed it is as years roll round, and the leaves begin again to fall, to enjoy such an unfading promise as this, “The Lord will give grace.”","The little conjunction “<i>and</i>” in this verse is a diamond rivet binding the present with the future: grace and glory always go together. God has married them, and none can divorce them. The Lord will never deny a soul glory to whom he has freely given to live upon his grace; indeed, glory is nothing more than grace in its Sabbath dress, grace in full bloom, grace like autumn fruit, mellow and perfected. How soon we may have glory none can tell! It may be before this month of October has run out we shall see the Holy City; but be the interval longer or shorter, we shall be glorified ere long. Glory, the glory of heaven, the glory of eternity, the glory of Jesus, the glory of the Father, the Lord will surely give to his chosen. Oh, rare promise of a faithful God!","Two golden links of one celestial chain:","Who owneth grace shall surely glory gain."]}