{"verses":[{"passage":"The Comforter, which is the Holy Ghost.","reference":{"book":"John","chapter":"14","verse":"26"}}],"reading":["This age is peculiarly the dispensation of the Holy Spirit, in which Jesus cheers us, not by his personal presence, as he shall do by-and-by, but by the indwelling and constant abiding of the Holy Ghost, who is evermore the Comforter of the church. It is his office to console the hearts of God’s people. He convinces of sin; he illuminates and instructs; but still the main part of his work lies in making glad the hearts of the renewed, in confirming the weak, and lifting up all those that be bowed down. He does this by revealing Jesus to them. The Holy Spirit consoles, but Christ <i>is the consolation</i>. If we may use the figure, the Holy Spirit is the Physician, but Jesus is the medicine. <i>He</i> heals the wound, but it is by applying the holy ointment of Christ’s name and grace. He takes not of his own things, but of the things of Christ. So if we give to the Holy Spirit the Greek name of <i>Paraclete</i>, as we sometimes do, then our heart confers on our blessed Lord Jesus the title of <i>Paraclesis</i>. If the one be the Comforter, the other is the Comfort. Now, with such rich provision for his need, why should the Christian be sad and desponding? The Holy Spirit has graciously engaged to be thy Comforter: dost thou imagine, O thou weak and trembling believer, that he will be negligent of his sacred trust? Canst thou suppose that he has undertaken what he cannot or will not perform? If it be his especial work to strengthen thee, and to comfort thee, dost thou suppose he has forgotten his business, or that he will fail in the loving office which he sustains towards thee? Nay, think not so hardly of the tender and blessed Spirit whose name is “the Comforter.” He delights to give the oil of joy for mourning, and the garment of praise for the spirit of heaviness. Trust thou in him, and he will surely comfort thee till the house of mourning is closed forever, and the marriage feast has begun."]}