{"verses":[{"passage":"We are all as an unclean thing.","reference":{"book":"Isaiah","chapter":"64","verse":"6"}}],"reading":["The believer is a new creature, he belongs to a holy generation and a peculiar people—the Spirit of God is in him, and in all respects he is far removed from the natural man; but for all that the Christian is a sinner still. He is so from the imperfection of his nature, and will continue so to the end of his earthly life. The black fingers of sin leave smuts upon our fairest robes. Sin mars our repentance, ere the great Potter has finished it, upon the wheel. Selfishness defiles our tears, and unbelief tampers with our faith. The best thing we ever did apart from the merit of Jesus only swelled the number of our sins; for when we have been most pure in our own sight, yet, like the heavens, we are not pure in God’s sight; and as he charged his angels with folly, much more must he charge us with it, even in our most angelic frames of mind. The song which thrills to heaven, and seeks to emulate seraphic strains, hath human discords in it. The prayer which moves the arm of God is still a bruised and battered prayer, and only moves that arm because the sinless One, the great Mediator, has stepped in to take away the sin of our supplication. The most golden faith or the purest degree of sanctification to which a Christian ever attained on earth, has still so much alloy in it as to be only worthy of the flames, in itself considered. Every night we look in the glass we see a sinner, and had need confess, “We are all as an unclean thing, and all our righteousnesses are as filthy rags.” Oh, how precious the blood of Christ to such hearts as ours! How priceless a gift is his perfect righteousness! And how bright the hope of perfect holiness hereafter! Even now, though sin dwells in us, <i>its power is broken</i>. It has no dominion; it is a broken-backed snake; we are in bitter conflict with it, but it is with a vanquished foe that we have to deal. Yet a little while and we shall enter victoriously into the city where nothing defileth."]}