{"verses":[{"passage":"He that believeth and is baptized shall be saved.","reference":{"book":"Mark","chapter":"16","verse":"16"}}],"reading":["Mr. MacDonald asked the inhabitants of the island of St. Kilda how a man must be saved. An old man replied, “We shall be saved if we repent, and forsake our sins, and turn to God.” “Yes,” said a middle-aged female, “and with a true heart too.” “Aye,” rejoined a third, “and with prayer”; and, added a fourth, “It must be the prayer of the heart.” “And we must be diligent too,” said a fifth, “in keeping the commandments.” Thus, each having contributed his mite, feeling that a very decent creed had been made up, they all looked and listened for the preacher’s approbation, but they had aroused his deepest pity. The carnal mind always maps out for itself a way in which self can work and become great, but the Lord’s way is quite the reverse. Believing and being baptized are no matters of merit to be gloried in—they are so simple that boasting is excluded, and free grace bears the palm. It may be that the reader is unsaved—what is the reason? Do you think the way of salvation as laid down in the text to be dubious? How can that be when God has pledged his own word for its certainty? Do you think it too easy? Why, then, do you not attend to it? Its ease leaves those without excuse who neglect it. To believe is simply to trust, to depend, to rely upon Christ Jesus. To be baptized is to submit to the ordinance which our Lord fulfilled at Jordan, to which the converted ones submitted at Pentecost, to which the jailer yielded obedience the very night of his conversion. The outward sign saves not, but it sets forth to us our death, burial, and resurrection with Jesus, and, like the Lord’s Supper, is not to be neglected. Reader, do you believe in Jesus? Then, dear friend, dismiss your fears, you shall be saved. Are you still an unbeliever, then remember there is but one door, and if you will not enter by it you will perish in your sins."]}