{"verses":[{"passage":"Whom he did predestinate, them he also called.","reference":{"book":"Romans","chapter":"8","verse":"30"}}],"reading":["In the second epistle to Timothy, first chapter, and ninth verse, are these words—“Who hath saved us, and called us with an <i>holy</i> calling.” Now, here is a touchstone by which we may try our calling. It is “an holy calling, not according to our works, but according to his own purpose and grace.” This calling forbids all trust in our own doings, and conducts us to Christ alone for salvation, but it afterwards purges us from dead works to serve the living and true God. As he that hath called you is holy, so must you be holy. If you are living in sin, you are not called, but if you are truly Christ's, you can say, “Nothing pains me so much as sin; I desire to be rid of it; Lord, help me to be holy.” Is this the panting of thy heart? Is this the tenor of thy life towards God, and his divine will? Again, in <a class=\"scripRef\" id=\"d1011pm-p3.1\" href=\"/ccel/bible/asv.Phil.3.html#Phil.3.13\" onclick=\"return goBible('nt','Phil','3','13','3','14');\" onmouseover=\"popupVerse(this, 'Phil 3:13 - 3:14')\" onmouseout=\"leaveVerse()\" name=\"_Phil_3_13_3_14\">Philippians, 3:13, 14</a>, we are told of “The <i>high</i> calling of God in Christ Jesus.” Is then your calling a high calling? Has it ennobled your heart, and set it upon heavenly things? Has it elevated your hopes, your tastes, your desires? Has it upraised the constant tenor of your life, so that you spend it with God and for God? Another test we find in <a class=\"scripRef\" id=\"d1011pm-p3.2\" href=\"/ccel/bible/asv.Heb.3.html#Heb.3.1\" onclick=\"return goBible('nt','Heb','3','1','3','1');\" onmouseover=\"popupVerse(this, 'Heb 3:1 - 3:1')\" onmouseout=\"leaveVerse()\" name=\"_Heb_3_1_0_0\">Hebrews 3:1</a>—“Partakers of the <i>heavenly</i> calling.” Heavenly calling means a call <i>from</i> heaven. If man alone call thee, thou art uncalled. Is thy calling of God? Is it a call <i>to</i> heaven as well as from heaven? Unless thou art a stranger here, and heaven thy home, thou hast not been called with a heavenly calling; for those who have been so called, declare that they look for a city which hath foundations, whose builder and maker is God, and they themselves are strangers and pilgrims upon the earth. Is thy calling thus holy, high, heavenly? Then, beloved, thou hast been called of God, for such is the calling wherewith God doth call his people."]}