{"verses":[{"passage":"Grow up into him in all things.","reference":{"book":"Ephesians","chapter":"4","verse":"15"}}],"reading":["Many Christians remain stunted and dwarfed in spiritual things, so as to present the same appearance year after year. No up-springing of advanced and refined feeling is manifest in them. They exist but do not “<i>grow up into him in all </i><i>things</i>.” But should we rest content with being in the “green blade,” when we might advance to “the ear,” and eventually ripen into the “full corn in the ear?” Should we be satisfied to believe in Christ, and to say, “I am safe,” without wishing to know in our own experience more of the fulness which is to be found in him. It should not be so; we should, as good traders in heaven’s market, covet to be enriched in the knowledge of Jesus. It is all very well to keep other men’s vineyards, but we must not neglect our own spiritual growth and ripening. Why should it always be winter time in our hearts? We must have our seed time, it is true, but O for a spring time—yea, a summer season, which shall give promise of an early harvest. If we would ripen in grace, we must live near to Jesus—in his presence—ripened by the sunshine of his smiles. We must hold sweet communion with him. We must leave the distant view of his face and come near, as John did, and pillow our head on his breast; then shall we find ourselves advancing in holiness, in love, in faith, in hope—yea, in every precious gift. As the sun rises first on mountain-tops and gilds them with his light, and presents one of the most charming sights to the eye of the traveller; so is it one of the most delightful contemplations in the world to mark the glow of the Spirit’s light on the head of some saint, who has risen up in spiritual stature, like Saul, above his fellows, till, like a mighty Alp, snow-capped, he reflects first among the chosen, the beams of the Sun of Righteousness, and bears the sheen of his effulgence high aloft for all to see, and seeing it, to glorify his Father which is in heaven."]}