{"verses":[{"passage":"He himself hath suffered being tempted.","reference":{"book":"Hebrews","chapter":"2","verse":"18"}}],"reading":["It is a common-place thought, and yet it tastes like nectar to the weary heart—Jesus was tempted as I am. You have heard that truth many times: have you grasped it? He was tempted to the very same sins into which we fall. Do not dissociate Jesus from our common manhood. It is a dark room which you are going through, but Jesus went through it before. It is a sharp fight which you are waging, but Jesus has stood foot to foot with the same enemy. Let us be of good cheer, Christ has borne the load before us, and the blood-stained footsteps of the King of glory may be seen along the road which we traverse at this hour. There is something sweeter yet—Jesus was tempted, but Jesus never sinned. Then, my soul, it is not needful for thee to sin, for Jesus was a man, and if one man endured these temptations and sinned not, then in his power his members may also cease from sin. Some beginners in the divine life think that they cannot be tempted without sinning, but they mistake; there is no sin in <i>being tempted</i>, but there <i>is</i> sin in <i>yielding to </i><i>temptation</i>. Herein is comfort for the sorely tempted ones. There is still more to encourage them if they reflect that the Lord Jesus, though tempted, gloriously triumphed, and as he overcame, so surely shall his followers also, for Jesus is the representative man for his people; the Head has triumphed, and the members share in the victory. Fears are needless, for Christ is with us, armed for our defence. Our place of safety is the bosom of the Saviour. Perhaps we are tempted just now, in order to drive us nearer to him. Blessed be any wind that blows us into the port of our Saviour’s love! Happy wounds, which make us seek the beloved Physician. Ye tempted ones, come to your tempted Saviour, for he can be touched with a feeling of your infirmities, and will succour every tried and tempted one."]}