{"verses":[{"passage":"Pleasant fruits, new and old, which I have laid up for thee, O my beloved.","reference":{"book":"Song of Solomon","chapter":"7","verse":"13"}}],"reading":["The spouse desires to give to Jesus all that she produces. Our heart has “all manner of pleasant fruits,” both “old and new,” and they are laid up for our Beloved. At this rich autumnal season of fruit, let us survey our stores. We have <i>new</i> fruits. We desire to feel new life, new joy, new gratitude; we wish to make new resolves and carry them out by new labours; our heart blossoms with new prayers, and our soul is pledging herself to new efforts. But we have some <i>old</i> fruits too. There is our first love: a choice fruit that! and Jesus delights in it. There is our first faith: that simple faith by which, having nothing, we became possessors of all things. There is our joy when first we knew the Lord: let us revive it. We have our old remembrances of the promises. How faithful has God been! In sickness, how softly did he make our bed! In deep waters, how placidly did he buoy us up! In the flaming furnace, how graciously did he deliver us. Old fruits, indeed! We have many of them, for his mercies have been more than the hairs of our head. Old sins we must regret, but then we have had repentances which he has given us, by which we have wept our way to the cross, and learned the merit of his blood. We have fruits, this morning, both new and old; but here is the point—<i>they are all laid up for Jesus</i>. Truly, those are the best and most acceptable services in which Jesus is the solitary aim of the soul, and his glory, without any admixture whatever, the end of all our efforts. Let our many fruits be laid up only for our Beloved; let us display them when he is with us, and not hold them up before the gaze of men. Jesus, we will turn the key in our garden door, and none shall enter to rob thee of one good fruit from the soil which thou hast watered with thy bloody sweat. Our all shall be thine, thine only, O Jesus, our Beloved!"]}