{"verses":[{"passage":"And David said in his heart, I shall now perish one day by the hand of Saul.","reference":{"book":"1 Samuel","chapter":"27","verse":"1"}}],"reading":["The thought of David’s heart at this time was a <i>false</i> thought, because he certainly had no ground for thinking that God’s anointing him by Samuel was intended to be left as an empty unmeaning act. On no one occasion had the Lord deserted his servant; he had been placed in perilous positions very often, but not one instance had occurred in which divine interposition had not delivered him. The trials to which he had been exposed had been varied; they had not assumed one form only, but many—yet in every case he who sent the trial had also graciously ordained a way of escape. David could not put his finger upon any entry in his diary, and say of it, “Here is evidence that the Lord will forsake me,” for the entire tenor of his past life proved the very reverse. He should have argued from what God <i>had</i> done for him, that God would be his defender still. But is it not just in the same way that <i>we</i> doubt God’s help? Is it not <i>mistrust without a cause</i>? Have we ever had the shadow of a reason to doubt our Father’s goodness? Have not his lovingkindnesses been marvellous? Has he <i>once</i> failed to justify our trust? Ah, no! our God has not left us at any time. We have had dark nights, but the star of love has shone forth amid the blackness; we have been in stern conflicts, but over our head he has held aloft the shield of our defence. We have gone through many trials, but never to our detriment, always to our advantage; and the conclusion from our past experience is, that he who has been with us in six troubles, will not forsake us in the seventh. What we have known of our faithful God, proves that he will keep us to the end. Let us not, then, reason contrary to evidence. How can we ever be so ungenerous as to <i>doubt</i> our God? Lord, throw down the Jezebel of our unbelief, and let the dogs devour it."]}