{"verses":[{"passage":"Praying in the Holy Ghost.","reference":{"book":"Jude","chapter":"20","verse":null}}],"reading":["Mark the grand characteristic of true prayer—“<i>In the Holy </i><i>Ghost</i>.” The seed of acceptable devotion must come from heaven’s storehouse. Only the prayer which comes from God can go to God. We must shoot the Lord’s arrows back to him. That desire which he writes upon our heart will move his heart and bring down a blessing, but the desires of the flesh have no power with him.","Praying in the Holy Ghost is praying in <i>fervency</i>. Cold prayers ask the Lord not to hear them. Those who do not plead with fervency, plead not at all. As well speak of lukewarm fire as of lukewarm prayer—it is essential that it be red hot. It is praying <i>perseveringly</i>. The true suppliant gathers force as he proceeds, and grows more fervent when God delays to answer. The longer the gate is closed, the more vehemently does he use the knocker, and the longer the angel lingers the more resolved is he that he will never let him go without the blessing. Beautiful in God’s sight is tearful, agonizing, unconquerable importunity. It means praying <i>humbly</i>, for the Holy Spirit never puffs us up with pride. It is his office to convince of sin, and so to bow us down in contrition and brokenness of spirit. We shall never sing <i>Gloria in excelsis</i> except we pray to God <i>De profundis</i>: out of the depths must we cry, or we shall never behold glory in the highest. It is <i>loving</i> prayer. Prayer should be perfumed with love, saturated with love—love to our fellow saints, and love to Christ. Moreover, it must be a prayer full of <i>faith</i>. A man prevails only as he believes. The Holy Spirit is the author of faith, and strengthens it, so that we pray believing God’s promise. O that this blessed combination of excellent graces, priceless and sweet as the spices of the merchant, might be fragrant within us because the Holy Ghost is in our hearts! Most blessed Comforter, exert thy mighty power within us, helping our infirmities in prayer."]}