{"verses":[{"passage":"I count all things but loss for the excellency of the knowledge of Christ Jesus my Lord.","reference":{"book":"Philippians","chapter":"3","verse":"8"}}],"reading":["Spiritual knowledge of Christ will be a <i>personal</i> knowledge. I cannot know Jesus through another person’s acquaintance with him. No, I must know him <i>myself</i>; I must know him on my own account. It will be an <i>intelligent</i> knowledge—I must know <i>him</i>, not as the visionary dreams of him, but as the Word reveals him. I must know his natures, divine and human. I must know his offices—his attributes—his works—his shame—his glory. I must meditate upon him until I “comprehend with all saints what is the breadth, and length, and depth, and height; and know the love of Christ, which passeth knowledge.” It will be an <i>affectionate</i> knowledge of him; indeed, if I know him at all, I must love him. An ounce of heart knowledge is worth a ton of head learning. Our knowledge of him will be a <i>satisfying</i> knowledge. When I know my Saviour, my mind will be full to the brim—I shall feel that I have that which my spirit panted after. “This is that bread whereof if a man eat he shall never hunger.” At the same time it will be an <i>exciting</i> knowledge; the more I know of my Beloved, the more I shall want to know. The higher I climb the loftier will be the summits which invite my eager footsteps. I shall want the more as I get the more. Like the miser’s treasure, my gold will make me covet more. To conclude; this knowledge of Christ Jesus will be a most <i>happy</i> one; in fact, so elevating, that sometimes it will completely bear me up above all trials, and doubts, and sorrows; and it will, while I enjoy it, make me something more than “Man that is born of woman, who is of few days, and full of trouble”; for it will fling about me the immortality of the ever living Saviour, and gird me with the golden girdle of his eternal joy. Come, my soul, sit at Jesus’s feet and learn of him all this day."]}