{"verses":[{"passage":"Keep not back.","reference":{"book":"Isaiah","chapter":"43","verse":"6"}}],"reading":["Although this message was sent to the south, and referred to the seed of Israel, it may profitably be a summons to ourselves. Backward we are naturally to all good things, and it is a lesson of grace to learn to go forward in the ways of God. Reader, are you unconverted, but do you desire to trust in the Lord Jesus? Then <i>keep not back</i>. Love invites you, the promises secure you success, the precious blood prepares the way. Let not sins or fears hinder you, but come to Jesus just as you are. Do you long to pray? Would you pour out your heart before the Lord? <i>Keep not back</i>. The mercy-seat is prepared for such as need mercy; a sinner’s cries will prevail with God. You are invited, nay, you are commanded to pray; come therefore with boldness to the throne of grace.","Dear friend, are you already saved? Then <i>keep not back</i> from union with the Lord’s people. Neglect not the ordinances of baptism and the Lord’s Supper. You may be of a timid disposition, but you must strive against it, lest it lead you into disobedience. There is a sweet promise made to those who confess Christ—by no means miss it, lest you come under the condemnation of those who deny him. If you have talents <i>keep </i><i>not back</i> from using them. Hoard not your wealth, waste not your time; let not your abilities rust or your influence be unused. Jesus kept not back; imitate him by being foremost in self-denials and self-sacrifices. <i>Keep not back</i> from close communion with God, from boldly appropriating covenant blessings, from advancing in the divine life, from prying into the precious mysteries of the love of Christ. Neither, beloved friend, be guilty of keeping others back by your coldness, harshness, or suspicions. For Jesus’ sake go forward yourself, and encourage others to do the like. Hell and the leaguered bands of superstition and infidelity are forward to the fight. O soldiers of the cross, keep not back."]}