{"verses":[{"passage":"It is a faithful saying.","reference":{"book":"2 Timothy","chapter":"2","verse":"11"}}],"reading":["Paul has four of these “<i>faithful sayings</i>.” The first occurs in <a class=\"scripRef\" id=\"d1027am-p3.1\" href=\"/ccel/bible/asv.iTim.1.html#iTim.1.15\" onclick=\"return goBible('nt','iTim','1','15','1','15');\" onmouseover=\"popupVerse(this, 'iTim 1:15 - 1:15')\" onmouseout=\"leaveVerse()\" name=\"_1Tim_1_15_0_0\">1 Timothy 1:15</a>, “This is a faithful saying, and worthy of all acceptation, that Christ Jesus came into the world to save sinners.” The next is in <a class=\"scripRef\" id=\"d1027am-p3.2\" href=\"/ccel/bible/asv.iTim.4.html#iTim.4.6\" onclick=\"return goBible('nt','iTim','4','6','4','6');\" onmouseover=\"popupVerse(this, 'iTim 4:6 - 4:6')\" onmouseout=\"leaveVerse()\" name=\"_1Tim_4_6_0_0\">1 Timothy 4:6</a>, “Godliness is profitable unto all things, having the promise of the life that now is, and of that which is to come. This is a faithful saying, and worthy of all acceptation.” The third is in <a class=\"scripRef\" id=\"d1027am-p3.3\" href=\"/ccel/bible/asv.iiTim.2.html#iiTim.2.12\" onclick=\"return goBible('nt','iiTim','2','12','2','12');\" onmouseover=\"popupVerse(this, 'iiTim 2:12 - 2:12')\" onmouseout=\"leaveVerse()\" name=\"_2Tim_2_12_0_0\">2 Timothy 2:12</a>, “It is a faithful saying—If we suffer with him we shall also reign with him”; and the fourth is in <a class=\"scripRef\" id=\"d1027am-p3.4\" href=\"/ccel/bible/asv.Titus.3.html#Titus.3.3\" onclick=\"return goBible('nt','Titus','3','3','3','3');\" onmouseover=\"popupVerse(this, 'Titus 3:3 - 3:3')\" onmouseout=\"leaveVerse()\" name=\"_Titus_3_3_0_0\">Titus 3:3</a>, “This is a faithful saying, that they which have believed in God might be careful to maintain good works.” We may trace a connection between these faithful sayings. The first one lays the foundation of our eternal salvation in the free grace of God, as shown to us in the mission of the great Redeemer. The next affirms the double blessedness which we obtain through this salvation—the blessings of the upper and nether springs—of time and of eternity. The third shows one of the duties to which the chosen people are called; we are ordained to suffer for Christ with the promise that “if we suffer, we shall also reign with him.” The last sets forth the active form of Christian service, bidding us diligently to maintain good works. Thus we have the root of salvation in free grace; next, the privileges of that salvation in the life which now is, and in that which is to come; and we have also the two great branches of suffering with Christ and serving with Christ, loaded with the fruits of the Spirit. Treasure up these faithful sayings. Let them be the guides of our life, our comfort, and our instruction. The apostle of the Gentiles proved them to be faithful, they are faithful still, not one word shall fall to the ground; they are worthy of all acceptation, let us accept them now, and prove their faithfulness. Let these four faithful sayings be written on the four corners of my house."]}