{"verses":[{"passage":"In the evening withhold not thy hand.","reference":{"book":"Ecclesiastes","chapter":"11","verse":"6"}}],"reading":["In <i>the evening of the day</i> opportunities are plentiful: men return from their labour, and the zealous soul-winner finds time to tell abroad the love of Jesus. Have I no evening work for Jesus? If I have not, let me no longer withhold my hand from a service which requires abundant labour. Sinners are perishing for lack of knowledge; he who loiters may find his skirts crimson with the blood of souls. Jesus gave both his hands to the nails, how can I keep back one of mine from his blessed work? Night and day he toiled and prayed for me, how can I give a single hour to the pampering of my flesh with luxurious ease? Up, idle heart; stretch out thy hand to work, or uplift it to pray; heaven and hell are in earnest, let me be so, and this evening sow good seed for the Lord my God.","<i>The evening of life</i> has also its calls. Life is so short that a morning of manhood’s vigour, and an evening of decay, make the whole of it. To some it seems long, but a four-pence is a great sum of money to a poor man. Life is so brief that no man can afford to lose a day. It has been well said that if a great king should bring us a great heap of gold, and bid us take as much as we could count in a day, we should make a long day of it; we should begin early in the morning, and in the evening we should not withhold our hand; but to win souls is far nobler work, how is it that we so soon withdraw from it? Some are spared to a long evening of green old age; if such be my case, let me use such talents as I still retain, and to the last hour serve my blessed and faithful Lord. By his grace I will die in harness, and lay down my charge only when I lay down my body. Age may instruct the young, cheer the faint, and encourage the desponding; if eventide has less of vigorous heat, it should have more of calm wisdom, therefore in the evening I will not withhold my hand."]}