{"verses":[{"passage":"Trust in him at all times.","reference":{"book":"Psalm","chapter":"62","verse":"8"}}],"reading":["Faith is as much the rule of temporal as of spiritual life; we ought to have faith in God for our earthly affairs as well as for our heavenly business. It is only as we learn to trust in God for the supply of all our daily need that we shall live above the world. We are not to be idle, <i>that</i> would show we did <i>not</i> trust in God, who worketh hitherto, but in the devil, who is the father of idleness. We are not to be imprudent or rash; that were to trust chance, and not the living God, who is a God of economy and order. Acting in all prudence and uprightness, we are to rely simply and entirely upon the Lord at all times.","Let me commend to you a life of trust in God in temporal things. Trusting in God, you will not be compelled to mourn because you have used sinful means to grow rich. Serve God with integrity, and if you achieve no success, at least no sin will lie upon your conscience. Trusting God, you will not be guilty of self-contradiction. He who trusts in craft, sails this way today, and that way the next, like a vessel tossed about by the fickle wind; but he that trusteth in the Lord is like a vessel propelled by steam, she cuts through the waves, defies the wind, and makes one bright silvery straightforward track to her destined haven. Be you a man with living principles within; never bow to the varying customs of worldly wisdom. Walk in your path of integrity with steadfast steps, and show that you are invincibly strong in the strength which confidence in God alone can confer. Thus you will be delivered from anxious care, you will not be troubled with evil tidings, your heart will be fixed, trusting in the Lord. How pleasant to float along the stream of providence! There is no more blessed way of living than a life of dependence upon a covenant-keeping God. We have no care, for he careth for us; we have no troubles, because we cast our burdens upon the Lord."]}