{"verses":[{"passage":"Howl, fir tree, for the cedar is fallen.","reference":{"book":"Zechariah","chapter":"11","verse":"2"}}],"reading":["When in the forest there is heard the crash of a falling oak, it is a sign that the woodman is abroad, and every tree in the whole company may tremble lest to-morrow the sharp edge of the axe should find it out. We are all like trees marked for the axe, and the fall of one should remind us that for every one, whether great as the cedar, or humble as the fir, the appointed hour is stealing on apace. I trust we do not, by often hearing of death, become callous to it. May we never be like the birds in the steeple, which build their nests when the bells are tolling, and sleep quietly when the solemn funeral peals are startling the air. May we regard death as the most weighty of all events, and be sobered by its approach. It ill behoves us to sport while our eternal destiny hangs on a thread. The sword is out of its scabbard—let us not trifle; it is furbished, and the edge is sharp—let us not play with it. He who does not prepare for death is more than an ordinary fool, he is a madman. When the voice of God is heard among the trees of the garden, let fig tree and sycamore, and elm and cedar, alike hear the sound thereof.","Be ready, servant of Christ, for thy Master comes on a sudden, when an ungodly world least expects him. See to it that thou be faithful in his work, for the grave shall soon be digged for thee. Be ready, parents, see that your children are brought up in the fear of God, for they must soon be orphans; be ready, men of business, take care that your affairs are correct, and that you serve God with all your hearts, for the days of your terrestrial service will soon be ended, and you will be called to give account for the deeds done in the body, whether they be good or whether they be evil. May we all prepare for the tribunal of the great King with a care which shall be rewarded with the gracious commendation, “Well done, good and faithful servant”"]}