{"verses":[{"passage":"Be ye separate.","reference":{"book":"2 Corinthians","chapter":"6","verse":"17"}}],"reading":["The Christian, while in the world, is not to be of the world. He should be distinguished from it in <i>the great object of his </i><i>life</i>. To him, “to live,” should be “Christ.” Whether he eats, or drinks, or whatever he does, he should do all to God’s glory. You may lay up treasure; but lay it up in heaven, where neither moth nor rust doth corrupt, where thieves break not through nor steal. You may strive to be rich; but be it your ambition to be “rich in faith,” and good works. You may have pleasure; but when you are merry, sing psalms and make melody in your hearts to the Lord. In your <i>spirit</i>, as well as in your aim, you should differ from the world. Waiting humbly before God, always conscious of his presence, delighting in communion with him, and seeking to know his will, you will prove that you are of heavenly race. And you should be separate from the world in your <i>actions</i>. If a thing be right, though you lose by it, it must be done; if it be wrong, though you would gain by it, you must scorn the sin for your Master’s sake. You must have no fellowship with the unfruitful works of darkness, but rather reprove them. Walk worthy of your high calling and dignity. Remember, O Christian, that thou art a son of the King of kings. Therefore, keep thyself unspotted from the world. Soil not the fingers which are soon to sweep celestial strings; let not these eyes become the windows of lust which are soon to see the King in his beauty—let not those feet be defiled in miry places, which are soon to walk the golden streets—let not those hearts be filled with pride and bitterness which are ere long to be filled with heaven, and to overflow with ecstatic joy.","Then rise my soul! and soar away,","Above the thoughtless crowd;","Above the pleasures of the gay,","And splendours of the proud;","Up where eternal beauties bloom,","And pleasures all divine;","Where wealth, that never can consume,","And endless glories shine."]}