{"verses":[{"passage":"Accepted in the beloved.","reference":{"book":"Ephesians","chapter":"1","verse":"6"}}],"reading":["What a state of privilege! It includes our <i>justification</i> before God, but the term “acceptance” in the Greek means more than that. It signifies that we are the objects of <i>divine </i><i>complacence</i>, nay, even of <i>divine delight</i>. How marvellous that we, worms, mortals, sinners, should be the objects of divine love! But it is only “<i>in the beloved</i>.” Some Christians seem to be accepted in their own experience, at least, that is their apprehension. When their spirit is lively, and their hopes bright, they think God accepts them, for they feel so high, so heavenly-minded, so drawn above the earth! But when their souls cleave to the dust, they are the victims of the fear that they are no longer accepted. If they could but see that all their high joys do not exalt them, and all their low despondencies do not really depress them in their Father’s sight, but that they stand accepted in One who never alters, in One who is always the beloved of God, always perfect, always without spot or wrinkle, or any such thing, how much happier they would be, and how much more they would honour the Saviour! Rejoice then, believer, in this: thou art accepted “in the beloved.” Thou lookest within, and thou sayest, “There is nothing acceptable <i>here</i>!” But look at Christ, and see if there is not everything acceptable <i>there</i>. Thy sins trouble thee; but God has cast thy sins behind his back, and thou art accepted in the Righteous One. Thou hast to fight with corruption, and to wrestle with temptation, but thou art already accepted in him who has overcome the powers of evil. The devil tempts thee; be of good cheer, he cannot destroy thee, for thou art accepted in him who has broken Satan’s head. Know by full assurance thy glorious standing. Even glorified souls are not more accepted than thou art. They are only accepted in heaven “in the beloved,” and thou art even now accepted in Christ after the same manner."]}