{"verses":[{"passage":"Let Israel rejoice in him.","reference":{"book":"Psalm","chapter":"149","verse":"2"}}],"reading":["Be glad of heart, O believer, but take care that thy gladness has its spring <i>in the Lord</i>. Thou hast much cause for gladness in thy God, for thou canst sing with David, “God, my exceeding joy.” Be glad that the Lord reigneth, that Jehovah is King! Rejoice that he sits upon the throne, and ruleth all things! Every attribute of God should become a fresh ray in the sunlight of our gladness. That he is wise should make us glad, knowing as we do our own foolishness. That he is <i>mighty</i>, should cause us to rejoice who tremble at our weakness. That he is everlasting, should always be a theme of joy when we know that we wither as the grass. That he is <i>unchanging</i>, should perpetually yield us a song, since <i>we</i> change every hour. That he is full of grace, that he is overflowing with it, and that this grace in covenant he has given to us; that it is ours to cleanse us, ours to keep us, ours to sanctify us, ours to perfect us, ours to bring us to glory—all this should tend to make us glad in him. This gladness in God is as a deep river; we have only as yet touched its brink, we know a little of its clear sweet, heavenly streams, but onward the depth is greater, and the current more impetuous in its joy. The Christian feels that he may delight himself not only in what God is, but also in all that God <i>has done</i> in the past. The Psalms show us that God’s people in olden times were wont to think much of God’s actions, and to have a song concerning each of them. So let God’s people now rehearse the deeds of the Lord! Let them tell of his mighty acts, and “sing unto the Lord, for he hath triumphed gloriously.” Nor let them ever cease to sing, for as new mercies flow to them day by day, so should their gladness in the Lord’s loving acts in providence and in grace show itself in continued thanksgiving. Be glad ye children of Zion and rejoice in the Lord your God."]}