{"verses":[{"passage":"There is sorrow on the sea; it cannot be quiet.","reference":{"book":"Jeremiah","chapter":"49","verse":"23"}}],"reading":["Little know we what sorrow may be upon the sea at this moment. We are safe in our quiet chamber, but far away on the salt sea the hurricane may be cruelly seeking for the lives of men. Hear how the death fiends howl among the cordage; how every timber starts as the waves beat like battering rams upon the vessel! God help you, poor drenched and wearied ones! My prayer goes up to the great Lord of sea and land, that he will make the storm a calm, and bring you to your desired haven! Nor ought I to offer prayer alone, I should try to benefit those hardy men who risk their lives so constantly. Have I ever done anything for them? What can I do? How often does the boisterous sea swallow up the mariner! Thousands of corpses lie where pearls lie deep. There is death-sorrow on the sea, which is echoed in the long wail of widows and orphans. The salt of the sea is in many eyes of mothers and wives. Remorseless billows, ye have devoured the love of women, and the stay of households. What a resurrection shall there be from the caverns of the deep when the sea gives up her dead! Till then there will be sorrow on the sea. As if in sympathy with the woes of earth, the sea is forever fretting along a thousand shores, wailing with a sorrowful cry like her own birds, booming with a hollow crash of unrest, raving with uproarious discontent, chafing with hoarse wrath, or jangling with the voices of ten thousand murmuring pebbles. The roar of the sea may be joyous to a rejoicing spirit, but to the son of sorrow the wide, wide ocean is even more forlorn than the wide, wide world. This is not our rest, and the restless billows tell us so. There is a land where there is no more sea—our faces are steadfastly set towards it; we are going to the place of which the Lord hath spoken. Till then, we cast our sorrows on the Lord who trod the sea of old, and who maketh a way for his people through the depths thereof."]}