{"verses":[{"passage":"The Lord trieth the righteous.","reference":{"book":"Psalm","chapter":"11","verse":"5"}}],"reading":["All events are under the control of Providence; consequently all the trials of our outward life are traceable at once to the great First Cause. Out of the golden gate of God’s ordinance the armies of trial march forth in array, clad in their iron armour, and armed with weapons of war. All providences are doors to trial. Even our mercies, like roses, have their thorns. Men may be drowned in seas of prosperity as well as in rivers of affliction. Our mountains are not too high, and our valleys are not too low for temptations: trials lurk on all roads. Everywhere, above and beneath, we are beset and surrounded with dangers. Yet no shower falls unpermitted from the threatening cloud; every drop has its order ere it hastens to the earth. The trials which come from God are sent to prove and strengthen our graces, and so at once to illustrate the power of divine grace, to test the genuineness of our virtues, and to add to their energy. Our Lord in his infinite wisdom and superabundant love, sets so high a value upon his people’s faith that he will not screen them from those trials by which faith is strengthened. You would never have possessed the precious faith which now supports you if the trial of your faith had not been like unto fire. You are a tree that never would have rooted so well if the wind had not rocked you to and fro, and made you take firm hold upon the precious truths of the covenant grace. Worldly ease is a great foe to faith; it loosens the joints of holy valour, and snaps the sinews of sacred courage. The balloon never rises until the cords are cut; affliction doth this sharp service for believing souls. While the wheat sleeps comfortably in the husk it is useless to man, it must be threshed out of its resting place before its value can be known. Thus it is well that Jehovah trieth the righteous, for it causeth them to grow rich towards God."]}