{"verses":[{"passage":"I will rejoice over them to do them good.","reference":{"book":"Jeremiah","chapter":"32","verse":"41"}}],"reading":["How heart-cheering to the believer is the delight which God has in his saints! We cannot see any reason in ourselves why the Lord should take pleasure in us; we cannot take delight in ourselves, for we often have to groan, being burdened; conscious of our sinfulness, and deploring our unfaithfulness; and we fear that God’s people cannot take much delight in us, for they must perceive so much of our imperfections and our follies, that they may rather lament our infirmities than admire our graces. But we love to dwell upon this transcendent truth, this glorious mystery: that as the bridegroom rejoiceth over the bride, so does the Lord rejoice over us. We do not read anywhere that God delighteth in the cloud-capped mountains, or the sparkling stars, but we do read that he delighteth in the habitable parts of the earth, and that his delights are with the sons of men. We do not find it written that even angels give his soul delight; nor doth he say, concerning cherubim and seraphim, “Thou shalt be called Hephzibah, for the Lord delighteth in thee”; but he does say all that to poor fallen creatures like ourselves, debased and depraved by sin, but saved, exalted, and glorified by his grace. In what strong language he expresses his delight in his people! Who could have conceived of the eternal One as bursting forth into a song? Yet it is written, “He will rejoice over thee with joy, he will rest in his love, he will joy over thee with singing.” As he looked upon the world he had made, he said, “It is very good”; but when he beheld those who are the purchase of Jesus’ blood, his own chosen ones, it seemed as if the great heart of the Infinite could restrain itself no longer, but overflowed in divine exclamations of joy. Should not we utter our grateful response to such a marvellous declaration of his love, and sing, “I will rejoice in the Lord, I will joy in the God of my salvation?”"]}