{"verses":[{"passage":"There were also with him other little ships.","reference":{"book":"Mark","chapter":"4","verse":"36"}}],"reading":["Jesus was the Lord High Admiral of the sea that night, and his presence preserved the whole convoy. It is well to sail with Jesus, even though it be in a little ship. When we sail in Christ’s company, we may not make sure of fair weather, for great storms may toss the vessel which carries the Lord himself, and we must not expect to find the sea less boisterous around our little boat. If we go with Jesus we must be content to fare as he fares; and when the waves are rough to him, they will be rough to us. It is by tempest and tossing that we shall come to land, as he did before us.","When the storm swept over Galilee’s dark lake all faces gathered blackness, and all hearts dreaded shipwreck. When all creature help was useless, the slumbering Saviour arose, and with a word, transformed the riot of the tempest into the deep quiet of a calm; then were the little vessels at rest as well as that which carried the Lord. Jesus is the star of the sea; and though there be sorrow upon the sea, when Jesus is on it there is joy too. May our hearts make Jesus their anchor, their rudder, their lighthouse, their life-boat, and their harbour. His Church is the Admiral’s flagship, let us attend her movements, and cheer her officers with our presence. He himself is the great attraction; let us follow ever in his wake, mark his signals, steer by his chart, and never fear while he is within hail. Not one ship in the convoy shall suffer wreck; the great Commodore will steer every barque in safety to the desired haven. By faith we will slip our cable for another day’s cruise, and sail forth with Jesus into a sea of tribulation. Winds and waves will not spare us, but they all obey him; and, therefore, whatever squalls may occur without, faith shall feel a blessed calm within. He is ever in the centre of the weather-beaten company: let us rejoice in him. His vessel has reached the haven, and so shall ours."]}