{"verses":[{"passage":"The exceeding greatness of his power to us-ward who believe according to the working of his mighty power, which he wrought in Christ, when he raised him from the dead.","reference":{"book":"Ephesians","chapter":"1","verse":"19, 20"}}],"reading":["In the resurrection of Christ, as in our salvation, there was put forth nothing short of <i>a divine power</i>. What shall we say of those who think that conversion is wrought by the free will of man, and is due to his own betterness of disposition? When we shall see the dead rise from the grave by their own power, then may we expect to see ungodly sinners of their own free will turning to Christ. It is not the word preached, nor the word read in itself; all quickening power proceeds from the Holy Ghost. This power was <i>irresistible</i>. All the soldiers and the high priests could not keep the body of Christ in the tomb; Death himself could not hold Jesus in his bonds: even thus irresistible is the power put forth in the believer when he is raised to newness of life. No sin, no corruption, no devils in hell nor sinners upon earth, can stay the hand of God’s grace when it intends to convert a man. If God omnipotently says, “Thou shalt,” man shall not say, “I will not.” Observe that the power which raised Christ from the dead was <i>glorious</i>. It reflected honour upon God and wrought dismay in the hosts of evil. So there is great glory to God in the conversion of every sinner. It was <i>everlasting power</i>. “Christ being raised from the dead dieth no more; death hath no more dominion over him.” So we, being raised from the dead, go not back to our dead works nor to our old corruptions, but we live unto God. “Because he lives we live also.” “For we are dead, and our life is hid with Christ in God.” “Like as Christ was raised up from the dead by the glory of the Father, even so we also should walk in newness of life.” Lastly, in the text mark <i>the union of the new life </i><i>to Jesus</i>. The same power which raised the Head works life in the members. What a blessing to be quickened together with Christ!"]}