{"verses":[{"passage":"For I was ashamed to require of the king a band of soldiers and horsemen to help us against the enemy in the way: because we had spoken unto the king, saying, The hand of our God is upon all them for good that seek him; but his power and his wrath is against all them that forsake him.","reference":{"book":"Ezra","chapter":"8","verse":"22"}}],"reading":["A convoy on many accounts would have been desirable for the pilgrim band, but a holy shame-facedness would not allow Ezra to seek one. He feared lest the heathen king should think his professions of faith in God to be mere hypocrisy, or imagine that the God of Israel was not able to preserve his own worshippers. He could not bring his mind to lean on an arm of flesh in a matter so evidently of the Lord, and therefore the caravan set out with no visible protection, guarded by him who is the sword and shield of his people. It is to be feared that few believers feel this holy jealousy for God; even those who in a measure walk by faith, occasionally mar the lustre of their life by craving aid from man. It is a most blessed thing to have no props and no buttresses, but to stand upright on the Rock of Ages, upheld by the Lord alone. Would any believers seek state endowments for their Church, if they remembered that the Lord is dishonoured by their asking Caesar’s aid? as if the Lord could not supply the needs of his own cause! Should we run so hastily to friends and relations for assistance, if we remembered that the Lord is magnified by our implicit reliance upon his solitary arm? My soul, wait thou only upon God. “But,” says one, “are not means to be used?” Assuredly they are; but our fault seldom lies in their neglect: far more frequently it springs out of foolishly believing in them instead of believing in God. Few run too far in neglecting the creature’s arm; but very many sin greatly in making too much of it. Learn, dear reader, to glorify the Lord by leaving means untried, if by using them thou wouldst dishonour the name of the Lord."]}