{"verses":[{"passage":"If ye be led of the Spirit, ye are not under the law.","reference":{"book":"Galatians","chapter":"5","verse":"18"}}],"reading":["He who looks at his own character and position from a legal point of view, will not only despair when he comes to the <i>end</i> of his reckoning, but if he be a wise man he will despair at the <i>beginning</i>; for if we are to be judged on the footing of the law, there shall no flesh living be justified. How blessed to know that we dwell in the domains of grace and not of law! When thinking of my state before God the question is not, “Am I perfect in myself before the law?” but, “Am I perfect in Christ Jesus?” That is a very different matter. We need not enquire, “Am I without sin naturally?” but, “Have I been washed in the fountain opened for sin and for uncleanness?” It is not “Am I in myself well pleasing to God?” but it is “Am I accepted in the Beloved?” The Christian views his evidences from the top of Sinai, and grows alarmed concerning his salvation; it were better far if he read his title by the light of Calvary. “Why,” saith he, “my faith has unbelief in it, it is not able to save me.” Suppose he had considered <i>the object</i> of his faith instead of his faith, then he would have said, “There is no failure in <i>him</i>, and therefore I am safe.” He sighs over his hope: “Ah! my hope is marred and dimmed by an anxious carefulness about present things; how can I be accepted?” Had he regarded <i>the ground</i> of his hope, he would have seen that the promise of God standeth sure, and that whatever our doubts may be, the oath and promise never fail. Ah! believer, it is safer always for you to be led of the Spirit into gospel liberty than to wear legal fetters. Judge yourself at what <i>Christ</i> is rather than at what <i>you</i> are. Satan will try to mar your peace by reminding you of your sinfulness and imperfections: you can only meet his accusations by faithfully adhering to the gospel and refusing to wear the yoke of bondage."]}