{"verses":[{"passage":"And when they could not come nigh unto him for the press, they uncovered the roof where he was: and when they had broken it up, they let down the bed wherein the sick of the palsy lay.","reference":{"book":"Mark","chapter":"2","verse":"4"}}],"reading":["<i>Faith is full of inventions</i>. The house was full, a crowd blocked up the door, but faith found a way of getting at the Lord and placing the palsied man before him. If we cannot get sinners where Jesus is by ordinary methods we must use extraordinary ones. It seems, according to <a class=\"scripRef\" id=\"d0907am-p3.1\" href=\"/ccel/bible/asv.Luke.5.html#Luke.5.19\" onclick=\"return goBible('nt','Luke','5','19','5','19');\" onmouseover=\"popupVerse(this, 'Luke 5:19 - 5:19')\" onmouseout=\"leaveVerse()\" name=\"_Luke_5_19_0_0\">Luke 5:19</a>, that a tiling had to be removed, which would make dust and cause a measure of danger to those below, but where the case is very urgent we must not mind running some risks and shocking some proprieties. Jesus was there to heal, and therefore fall what might, faith ventured all so that her poor paralysed charge might have his sins forgiven. O that we had more daring faith among us! Cannot we, dear reader, seek it this morning for ourselves and for our fellow-workers, and will we not try today to perform some gallant act for the love of souls and the glory of the Lord.","The world is constantly inventing; genius serves all the purposes of human desire: cannot faith invent too, and reach by some new means the outcasts who lie perishing around us? It was the presence of Jesus which excited victorious courage in the four bearers of the palsied man: is not the Lord among us now? Have we seen his face for ourselves this morning? Have we felt his healing power in our own souls? If so, then through door, through window, or through roof, let us, breaking through all impediments, labour to bring poor souls to Jesus. All means are good and decorous when faith and love are truly set on winning souls. If hunger for bread can break through stone walls, surely hunger for souls is not to be hindered in its efforts. O Lord, make us quick to suggest methods of reaching thy poor sin-sick ones, and bold to carry them out at all hazards."]}