{"verses":[{"passage":"A living dog is better than a dead lion.","reference":{"book":"Ecclesiastes","chapter":"9","verse":"4"}}],"reading":["Life is a precious thing, and in its humblest form it is superior to death. This truth is eminently certain in spiritual things. It is better to be the least in the kingdom of heaven than the greatest out of it. The lowest degree of grace is superior to the noblest development of unregenerate nature. Where the Holy Ghost implants divine life in the soul, there is a precious deposit which none of the refinements of education can equal. The thief on the cross excels Caesar on his throne; Lazarus among the dogs is better than Cicero among the senators; and the most unlettered Christian is in the sight of God superior to Plato. Life is the badge of nobility in the realm of spiritual things, and men without it are only coarser or finer specimens of the same lifeless material, needing to be quickened, for they are dead in trespasses and sins.","A living, loving, gospel sermon, however unlearned in matter and uncouth in style, is better than the finest discourse devoid of unction and power. A living dog keeps better watch than a dead lion, and is of more service to his master; and so the poorest spiritual preacher is infinitely to be preferred to the exquisite orator who has no wisdom but that of words, no energy but that of sound. The like holds good of our prayers and other religious exercises; if we are quickened in them by the Holy Spirit, they are acceptable to God through Jesus Christ, though we may think them to be worthless things; while our grand performances in which our hearts were absent, like dead lions, are mere carrion in the sight of the living God. O for living groans, living sighs, living despondencies, rather than lifeless songs and dead calms. Better anything than death. The snarlings of the dog of hell will at least keep us awake, but dead faith and dead profession, what greater curses can a man have? Quicken us, quicken us, O Lord!"]}