{"month":"april","date":"07","entry":{"Morning":{"verses":[{"passage":"O ye sons of men, how long will ye turn my glory into shame?","reference":{"book":"Psalm","chapter":"4","verse":"2"}}],"reading":["An instructive writer has made a mournful list of the honours which the blinded people of Israel awarded to their long expected King.","1. They gave him <i>a procession of honour</i>, in which Roman legionaries, Jewish priests, men and women, took a part, he himself bearing his cross. This is the triumph which the world awards to him who comes to overthrow man’s direst foes. Derisive shouts are his only acclamations, and cruel taunts his only paeans of praise.","2. They presented him with <i>the wine of honour</i>. Instead of a golden cup of generous wine they offered him the criminal’s stupefying death-draught, which he refused because he would preserve an uninjured taste wherewith to taste of death; and afterwards when he cried, “I thirst,” they gave him vinegar mixed with gall, thrust to his mouth upon a sponge. Oh! wretched, detestable inhospitality to the King’s Son.","3. He was provided with <i>a guard of honour</i>, who showed their esteem of him by gambling over his garments, which they had seized as their booty. Such was the body-guard of the adored of heaven; a quaternion of brutal gamblers.","4. <i>A throne of honour</i> was found for him upon the bloody tree; no easier place of rest would rebel men yield to their liege Lord. The cross was, in fact, the full expression of the world’s feeling towards him; “There,” they seemed to say, “thou Son of God, this is the manner in which God himself should be treated, could we reach him.”","5. <i>The title of honour</i> was nominally “King of the Jews,” but that the blinded nation distinctly repudiated, and really called him “King of thieves,” by preferring Barabbas, and by placing Jesus in the place of highest shame between two thieves. His glory was thus in all things turned into shame by the sons of men, but it shall yet gladden the eyes of saints and angels, world without end."]},"Evening":{"verses":[{"passage":"Deliver me from bloodguiltiness, O God, thou God of my salvation; and my tongue shall sing aloud of thy righteousness.","reference":{"book":"Psalm","chapter":"51","verse":"14"}}],"reading":["In this <span style=\"font-variant:small-caps\" id=\"d0407pm-p3.1\">solemn confession</span>, it is pleasing to observe that David plainly names his sin. He does not call it manslaughter, nor speak of it as an imprudence by which an unfortunate accident occurred to a worthy man, but he calls it by its true name, bloodguiltiness. He did not actually kill the husband of Bathsheba; but still it was planned in David’s heart that Uriah should be slain, and he was before the Lord his murderer. Learn in confession to be honest with God. Do not give fair names to foul sins; call them what you will, they will smell no sweeter. What God sees them to be, that do you labour to feel them to be; and with all openness of heart acknowledge their real character. Observe, that David was evidently oppressed with the heinousness of his sin. It is easy to use words, but it is difficult to feel their meaning. The fifty-first Psalm is the photograph of a contrite spirit. Let us seek after the like brokenness of heart; for however excellent our words may be, if our heart is not conscious of the hell-deservingness of sin, we cannot expect to find forgiveness.","Our text has in it <span style=\"font-variant:small-caps\" id=\"d0407pm-p4.1\">an earnest prayer</span>—it is addressed to the God of <i>salvation</i>. It is his prerogative to forgive; it is his very name and office to save those who seek his face. Better still, the text calls him the God of <i>my</i> salvation. Yes, blessed be his name, while I am yet going to him through Jesus’ blood, I can rejoice in the God of <i>my</i> salvation.","The psalmist ends with <span style=\"font-variant:small-caps\" id=\"d0407pm-p5.1\">a commendable vow</span>: if God will deliver him he will <i>sing</i>—nay, more, he will “<i>sing aloud</i>.” Who can sing in any other style of such a mercy as this! But note the subject of the song—“<span style=\"font-variant:small-caps\" id=\"d0407pm-p5.2\">Thy righteousness</span>.” We must sing of the finished work of a precious Saviour; and he who knows most of forgiving love will sing the loudest."]}}}
