{"month":"august","date":"13","entry":{"Morning":{"verses":[{"passage":"The cedars of Lebanon which he hath planted.","reference":{"book":"Psalm","chapter":"104","verse":"16"}}],"reading":["Lebanon’s cedars are emblematic of the Christian, in that <i>they owe their planting entirely to the Lord</i>. This is quite true of every child of God. He is not man-planted, nor self-planted, but God-planted. The mysterious hand of the divine Spirit dropped the living seed into a heart which he had himself prepared for its reception. Every true heir of heaven owns the great Husbandman as his planter. Moreover, the cedars of Lebanon <i>are not dependent upon man for their watering</i>; they stand on the lofty rock, unmoistened by human irrigation; and yet our heavenly Father supplieth them. Thus it is with the Christian who has learned to live by faith. He is independent of man, even in temporal things; for his continued maintenance he looks to the Lord his God, and to him alone. The dew of heaven is his portion, and the God of heaven is his fountain. Again, the cedars of Lebanon <i>are not protected by any mortal power</i>. They owe nothing to man for their preservation from stormy wind and tempest. They are God’s trees, kept and preserved by him, and by him alone. It is precisely the same with the Christian. He is not a hot-house plant, sheltered from temptation; he stands in the most exposed position; he has no shelter, no protection, except this, that the broad wings of the eternal God always cover the cedars which he himself has planted. Like cedars, believers are <i>full of sap,</i> having vitality enough to be ever green, even amid winter’s snows. Lastly, the flourishing and majestic condition of the cedar <i>is to the </i><i>praise of God only</i>. The Lord, even the Lord alone hath been everything unto the cedars, and, therefore David very sweetly puts it in one of the psalms, “Praise ye the Lord, fruitful trees and all cedars.” In the believer there is nothing that can magnify man; he is planted, nourished, and protected by the Lord’s own hand, and to him let all the glory be ascribed."]},"Evening":{"verses":[{"passage":"And I will remember my covenant.","reference":{"book":"Genesis","chapter":"9","verse":"15"}}],"reading":["Mark the form of the promise. God does not say, “And when ye shall look upon the bow, and <i>ye</i> shall remember my covenant, <i>then</i> I will not destroy the earth,” but it is gloriously put, not upon <i>our</i> memory, which is fickle and frail, but upon <i>God's</i> memory, which is infinite and immutable. “The bow shall be in the cloud; and I will look upon it, that I may remember the everlasting covenant.” Oh! it is not my remembering God, it is God’s remembering <i>me</i> which is the ground of my safety; it is not my laying hold of his covenant, but his covenant’s laying hold on me. Glory be to God! the whole of the bulwarks of salvation are secured by divine power, and even the minor towers, which we may imagine might have been left to man, are guarded by almighty strength. Even the <i>remembrance</i> of the covenant is not left to our memories, for <i>we</i> might forget, but our Lord cannot forget the saints whom he has graven on the palms of his hands. It is with us as with Israel in Egypt; the blood was upon the lintel and the two side-posts, but the Lord did not say, “When <i>you</i> see the blood I will pass over you,” but “When <i>I</i> see the blood I will pass over you.” My looking to Jesus brings me joy and peace, but it is God’s looking to Jesus which secures my salvation and that of all his elect, since it is impossible for our God to look at Christ, our bleeding Surety, and then to be angry with us for sins already punished in him. No, it is not left with <i>us</i> even to be saved by remembering the covenant. There is no linsey-wolsey here—not a single thread of the creature mars the fabric. It is not <i>of</i> man, neither <i>by</i> man, but of the Lord alone. We <i>should</i> remember the covenant, and we <i>shall</i> do it, through divine grace; but the hinge of our safety does not hang there—it is God’s remembering <i>us</i>, not our remembering <i>him</i>; and hence the covenant is <i>an everlasting covenant</i>."]}}}
