{"month":"december","date":"17","entry":{"Morning":{"verses":[{"passage":"I remember thee.","reference":{"book":"Jeremiah","chapter":"2","verse":"2"}}],"reading":["Let us note that Christ delights to think upon his Church, and to look upon her beauty. As the bird returneth often to its nest, and as the wayfarer hastens to his home, so doth the mind continually pursue the object of its choice. We cannot look too often upon that face which we love; we desire always to have our precious things in our sight. It is even so with our Lord Jesus. From all eternity “His delights were with the sons of men;” his thoughts rolled onward to the time when his elect should be born into the world; he viewed them in the mirror of his foreknowledge. “In thy book,” he says, “all my members were written, which in continuance were fashioned, when as yet there was none of them” (<a class=\"scripRef\" id=\"d1217am-p3.1\" href=\"/ccel/bible/asv.Ps.139.html#Ps.139.16\" onclick=\"return goBible('ot','Ps','139','16','139','16');\" onmouseover=\"popupVerse(this, 'Ps 139:16 - 139:16')\" onmouseout=\"leaveVerse()\" name=\"_Ps_139_16_0_0\">Ps. 139:16</a>). When the world was set upon its pillars, he was there, and he set the bounds of the people according to the number of the children of Israel. Many a time before his incarnation, he descended to this lower earth in the similitude of a man; on the plains of Mamre (<a class=\"scripRef\" id=\"d1217am-p3.2\" href=\"/ccel/bible/asv.Gen.18.html\" onclick=\"return goBible('ot','Gen','18','0','18','0');\" onmouseover=\"popupVerse(this, 'Gen 18:0 - 18:0')\" onmouseout=\"leaveVerse()\" name=\"_Gen_18_0_0_0\">Gen. 18</a>), by the brook of Jabbok (<a class=\"scripRef\" id=\"d1217am-p3.3\" href=\"/ccel/bible/asv.Gen.32.html#Gen.32.24\" onclick=\"return goBible('ot','Gen','32','24','32','30');\" onmouseover=\"popupVerse(this, 'Gen 32:24 - 32:30')\" onmouseout=\"leaveVerse()\" name=\"_Gen_32_24_32_30\">Gen. 32:24-30</a>), beneath the walls of Jericho (<a class=\"scripRef\" id=\"d1217am-p3.5\" href=\"/ccel/bible/asv.Josh.5.html#Josh.5.13\" onclick=\"return goBible('ot','Josh','5','13','5','13');\" onmouseover=\"popupVerse(this, 'Josh 5:13 - 5:13')\" onmouseout=\"leaveVerse()\" name=\"_Josh_5_13_0_0\">Jos. 5:13</a>), and in the fiery furnace of Babylon (<a class=\"scripRef\" id=\"d1217am-p3.6\" href=\"/ccel/bible/asv.Dan.3.html#Dan.3.19\" onclick=\"return goBible('ot','Dan','3','19','3','19');\" onmouseover=\"popupVerse(this, 'Dan 3:19 - 3:19')\" onmouseout=\"leaveVerse()\" name=\"_Dan_3_19_0_0\">Dan. 3:19</a>, <a class=\"scripRef\" id=\"d1217am-p3.7\" href=\"/ccel/bible/asv.Dan.3.html#Dan.3.25\" onclick=\"return goBible('ot','Dan','3','25','3','25');\" onmouseover=\"popupVerse(this, 'Dan 3:25 - 3:25')\" onmouseout=\"leaveVerse()\" name=\"_Dan_3_25_0_0\">25</a>), the Son of Man visited his people. Because his soul delighted in them, he could not rest away from them, for his heart longed after them. Never were they absent from his heart, for he had written their names upon his hands, and graven them upon his side. As the breastplate containing the names of the tribes of Israel was the most brilliant ornament worn by the high priest, so the names of Christ’s elect were his most precious jewels, and glittered on his heart. We may often forget to meditate upon the perfections of our Lord, but he never ceases to remember us. Let us chide ourselves for past forgetfulness, and pray for grace ever to bear him in fondest remembrance. Lord, paint upon the eyeballs of my soul the image of thy Son."]},"Evening":{"verses":[{"passage":"I am the door: by me if any man enter in, he shall be saved, and shall go in and out, and find pasture.","reference":{"book":"John","chapter":"10","verse":"9"}}],"reading":["Jesus, the great I AM, is the entrance into the true church, and the way of access to God himself. He gives to the man who comes to God by him four choice privileges.","1. <i>He shall be saved</i>. The fugitive manslayer passed the gate of the city of refuge, and was safe. Noah entered the door of the ark, and was secure. None can be lost who take Jesus as the door of faith to their souls. Entrance through Jesus into peace is the guarantee of entrance by the same door into heaven. Jesus is the only door, an open door, a wide door, a safe door; and blessed is he who rests all his hope of admission to glory upon the crucified Redeemer.","2. <i>He shall go in</i>. He shall be privileged to go in among the divine family, sharing the children’s bread, and participating in all their honours and enjoyments. He shall go in to the chambers of communion, to the banquets of love, to the treasures of the covenant, to the storehouses of the promises. He shall go in unto the King of kings in the power of the Holy Spirit, and the secret of the Lord shall be with him.","3. <i>He shall go out</i>. This blessing is much forgotten. We go out into the world to labour and suffer, but what a mercy to go in the name and power of Jesus! We are called to bear witness to the truth, to cheer the disconsolate, to warn the careless, to win souls, and to glorify God; and as the angel said to Gideon, “Go in this thy might,” even thus the Lord would have us proceed as his messengers in his name and strength.","4. <i>He shall find pasture</i>. He who knows Jesus shall never want. Going in and out shall be alike helpful to him: in fellowship with God he shall grow, and in watering others he shall be watered. Having made Jesus his all, he shall find all in Jesus. His soul shall be as a watered garden, and as a well of water whose waters fail not."]}}}
