{"month":"july","date":"28","entry":{"Morning":{"verses":[{"passage":"So foolish was I, and ignorant; I was as a beast before thee.","reference":{"book":"Psalm","chapter":"73","verse":"22"}}],"reading":["Remember this is the confession of the man after God’s own heart; and in telling us his inner life, he writes, “So foolish was I, and ignorant.” The word “<i>foolish</i>,” here, means more than it signifies in ordinary language. David, in a former verse of the Psalm, writes, “I was envious at <i>the foolish</i> when I saw the prosperity of the wicked,” which shows that the folly he intended had sin in it. He puts himself down as being thus “foolish,” and adds a word which is to give intensity to it; “so foolish was I.” <i>How foolish</i> he could not tell. It was a sinful folly, a folly which was not to be excused by frailty, but to be condemned because of its perverseness and wilful ignorance, for he had been envious of the present prosperity of the ungodly, forgetful of the dreadful end awaiting all such. And are we better than David that we should call ourselves wise! Do we profess that we have attained perfection, or to have been so chastened that the rod has taken all our wilfulness out of us? Ah, this were pride indeed! If <i>David</i> was foolish, how foolish should <i>we</i> be in our own esteem if we could but see ourselves! Look back, believer: think of your doubting God when he has been so faithful to you—think of your foolish outcry of “Not so, my Father,” when he crossed his hands in affliction to give you the larger blessing; think of the many times when you have read his providences in the dark, misinterpreted his dispensations, and groaned out, “All these things are against me,” when they are all working together for your good! Think how often you have chosen sin because of its pleasure, when indeed, that pleasure was a root of bitterness to you! Surely if we know our own heart we must plead guilty to the indictment of a sinful folly; and conscious of this “foolishness,” we must make David’s consequent resolve our own—“<i>Thou shalt guide me with thy </i><i>counsel</i>.”"]},"Evening":{"verses":[{"passage":"Who went about doing good.","reference":{"book":"Acts","chapter":"10","verse":"38"}}],"reading":["Few words, but yet an exquisite miniature of the Lord Jesus Christ. There are not many touches, but they are the strokes of a master’s pencil. Of the Saviour and only of the Saviour is it true in the fullest, broadest, and most unqualified sense. “He went about doing good.” From this description it is evident that he did good <i>personally</i>. The evangelists constantly tell us that he touched the leper with his own finger, that he anointed the eyes of the blind, and that in cases where he was asked to speak the word only at a distance, he did not usually comply, but went himself to the sick bed, and there personally wrought the cure. A lesson to us, if we would do good, to do it ourselves. Give alms with your own hand; a kind look, or word, will enhance the value of the gift. Speak to a friend about his soul; your loving appeal will have more influence than a whole library of tracts. Our Lord’s mode of doing good sets forth his <i>incessant activity</i>! He did not only the good which came close to hand, but he “went about” on his errands of mercy. Throughout the whole land of Judea there was scarcely a village or a hamlet which was not gladdened by the sight of him. How this reproves the creeping, loitering manner, in which many professors serve the Lord. Let us gird up the loins of our mind, and be not weary in well doing. Does not the text imply that Jesus Christ <i>went </i><i>out of his way to do good</i>? “He went <i>about</i> doing good.” He was never deterred by danger or difficulty. He sought out the objects of his gracious intentions. So must we. If old plans will not answer, we must try new ones, for fresh experiments sometimes achieve more than regular methods. Christ’s <i>perseverance</i>, and the <i>unity</i> of his purpose, are also hinted at, and the practical application of the subject may be summed up in the words, “He hath left us an example that we should follow in his steps.”"]}}}
