{"month":"june","date":"06","entry":{"Morning":{"verses":[{"passage":"Behold, I am vile.","reference":{"book":"Job","chapter":"40","verse":"4"}}],"reading":["One cheering word, poor lost sinner, for thee! You think you must not come to God because you are vile. Now, there is not a saint living on earth but has been made to feel that he is vile. If Job, and Isaiah, and Paul were all obliged to say “I am vile,” oh, poor sinner, wilt thou be ashamed to join in the same confession? If divine grace does not eradicate all sin from the believer, how dost thou hope to do it thyself? and if God loves his people while they are yet vile, dost thou think thy vileness will prevent his loving thee? Believe on Jesus, thou outcast of the world’s society! Jesus calls <i>thee</i>, and such as thou art.","Even now say, “Thou hast died for sinners; I am a sinner, Lord Jesus, sprinkle thy blood on me;” if thou wilt confess thy sin thou shalt find pardon. If, now, with all thy heart, thou wilt say, “I am vile, wash me,” thou shalt be washed now. If the Holy Spirit shall enable thee from thy heart to cry","thou shalt rise from reading this morning’s portion with all thy sins pardoned; and though thou didst wake this morning with every sin that man hath ever committed on thy head, thou shalt rest tonight accepted in the Beloved; though once degraded with the rags of sin, thou shalt be adorned with a robe of righteousness, and appear white as the angels are. For “now,” mark it, “<i>Now</i> is the accepted time.” If thou “believest on him who justifieth the ungodly thou art saved.” Oh! may the Holy Spirit give thee saving faith in him who receives the vilest.","“Not the righteous, not the righteous;","Sinners, Jesus came to call.”","“Just as I am, without one plea","But that thy blood was shed for me,","And that thou bidd'st me come to thee,","O Lamb of God, I come!”"]},"Evening":{"verses":[{"passage":"Are they Israelites? so am I.","reference":{"book":"2 Corinthians","chapter":"11","verse":"22"}}],"reading":["We have here <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.1\">a personal claim</span>, and one that <i>needs proof</i>. The apostle knew that <i>his</i> claim was indisputable, but there are many persons who have no right to the title who yet claim to belong to the Israel of God. If we are with confidence declaring, “So am I also an Israelite,” let us only say it after having searched our heart as in the presence of God. But if we can give proof that we are following Jesus, if we can from the heart say, “I trust him wholly, trust him only, trust him simply, trust him now, and trust him ever,” then the position which the saints of God hold belongs to us—all their enjoyments are our possessions; we may be the very least in Israel, “less than the least of all saints,” yet since the mercies of God belong to the saints <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.2\">as saints</span>, and not as advanced saints, or well-taught saints, we may put in our plea, and say, “Are they Israelites? so am I; therefore the promises are mine, grace is mine, glory will be mine.” The claim, rightfully made, is one which will yield untold comfort. When God’s people are rejoicing that they are his, what a happiness if they can say, “<span style=\"font-variant:small-caps\" id=\"d0606pm-p3.3\">So am I</span> !” When they speak of being pardoned, and justified, and accepted in the Beloved, how joyful to respond, “Through the grace of God, <span style=\"font-variant:small-caps\" id=\"d0606pm-p3.4\">so am I</span>.” But this claim not only has its enjoyments and privileges, but also its conditions and duties. We must share with God’s people in cloud as well as in sunshine. When we hear them spoken of with contempt and ridicule for being Christians, we must come boldly forward and say, “So am I.” When we see them working for Christ, giving their time, their talent, their whole heart to Jesus, we must be able to say, “So do I.” O let us prove our gratitude by our devotion, and live as those who, having claimed a privilege, are willing to take the responsibility connected with it."]}}}
